{
	"clbid": "0000152397",
	"credits": 1.0,
	"crsid": "0000036257",
	"department": "WRIT",
	"description": [
		"Faced with climate change, it's normal to feel anxious. How do we address that anxiety? How do we find joy? What actions must we take to be good ancestors to future generations? This course invites students to answer these questions while getting to know (and become good stewards of) the local nature of St. Olaf College. Together, students engage in community-oriented environmental work while discussing media from diverse voices of the emerging Climate Renaissance. Discussion topics include indigenous ecological knowledge, the search for a climate anthem, feral animals, the carbon footprint myth, and the quest to design the lawn of the future. Through these encounters, students practice essential college research and writing skills while dispelling myths that make both writing and environmental action difficult. Ultimately, participants work together to find words and ideas to live responsibly in community with each other and the more-than-human world. No prior environmental knowledge is required."
	],
	"enrolled": 3,
	"gereqs": [
		"WRR"
	],
	"groupid": "0000036257",
	"grouptype": "H",
	"instructors": [
		"Ryan C. Eichberger"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Top: Living Well in Climate Change",
	"notes": [
		"Section topic: Living Well in the Time of Climate Change",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 120,
	"offerings": [
		{
			"day": "Mo",
			"end": "14:55",
			"location": "RML 421",
			"start": "14:00"
		},
		{
			"day": "We",
			"end": "14:55",
			"location": "RML 421",
			"start": "14:00"
		},
		{
			"day": "Fr",
			"end": "14:55",
			"location": "RML 421",
			"start": "14:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"section": "H",
	"semester": 1,
	"senior": "0/0",
	"status": "O",
	"term": 20231,
	"title": "Writing and Rhetoric",
	"type": "Topic",
	"year": 2023
}
