{
	"clbid": "0000152562",
	"credits": 1.0,
	"crsid": "0000000338",
	"department": "EDUC",
	"description": [
		"Students examine the influence of race, class, and multiculturalism in American schools by participating as teachers' assistants and tutors in two distinctly different K-12 schools. Students discover the challenges and benefits associated with teaching in a diverse racial, cultural, and socio-economic environment. Through guest lectures, readings, field trips, and seminars, students learn about the truly unique geographic and cultural setting of the Hawaiian islands. This environment makes an excellent framework for examining race, ethnicity, power, and privilege in U.S. schools. Fulfills EDUC 382: Human Relations requirement. P/N only. Intended for education major/licensure students and educational studies concentrators; cannot fulfill the January Term requirement for TEFL certification. Offered alternate January Terms, even years. Apply through the Education Department. Also counts toward race and ethnic studies major and concentration. Prerequisite: EDUC 295 or EDUC 330."
	],
	"enrolled": 19,
	"gereqs": [
		"OEP",
		"PAR"
	],
	"instructors": [
		"Elizabeth A. Leer"
	],
	"learningmode": "S",
	"level": 300,
	"max": 22,
	"name": "Multicultural Education in Hawaii",
	"notes": [
		"This is a study away course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 378,
	"pn": true,
	"prerequisites": "EDUC 295 or EDUC 330.",
	"revisions": [
		{
			"_updated": "2023-09-22T02:19:39.210604+00:00",
			"enrolled": 21
		},
		{
			"_updated": "2023-10-08T02:22:14.926232+00:00",
			"notes": null
		},
		{
			"_updated": "2023-10-11T02:20:15.384080+00:00",
			"status": "O"
		},
		{
			"_updated": "2023-10-26T02:19:22.364216+00:00",
			"enrolled": 20
		},
		{
			"_updated": "2025-10-11T21:36:45.741456+00:00",
			"gereqs": [
				"MCD",
				"OEP",
				"PAR"
			]
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20232,
	"title": "Multicultural Education in Hawaii: Seminar and Practicum",
	"type": "Research",
	"year": 2023
}
