{
	"clbid": 109579,
	"credits": 1.0,
	"crsid": 17673,
	"departments": [
		"ART"
	],
	"description": [
		"Spirituality is the development of our inner life and the means by which we develop our inner self takes on many forms. “Spirituality can also be thought of as an animating, creative, energizing, and meaning-making force—a dynamic expression of who we are.” Religious practice is the way most people think of as a means to nurture inner fortitude, compassion and equanimity, but has art making been overlooked as a way? Have the testimonies of artists gone unheard? Even many religious artists talk about the centering which their art making practice brings them, saying, “I can do this for hours, it’s meditation for me.” Is art making a form of meditation? Are there similarities to artistic practice that parallel those of various faith traditions? If so, what are those similarities? In this course students will examine the spiritual aspects, if any, of their own artistic practice in the medium of their choice, in the studio spaces available during interim. (Students must speak to the appropriate faculty member to know if they may continue to work in a given studio area.) Students will discuss specific readings, artists and art works that help clarify questions “concerning the spiritual in art.”"
	],
	"enroll": "12",
	"instructors": [
		"Paul S. Briggs"
	],
	"level": 200,
	"locations": [
		"CAD 115",
		"CAD 115",
		"CAD 115"
	],
	"max": "15",
	"name": "Top:Artmaking as Spiritual Practice",
	"notes": [
		"This course has class-year limits. This course open to first-year students."
	],
	"number": 240,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:36.488212+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-28T11:31:21.783621+00:00",
			"notes": null
		},
		{
			"_updated": "2016-11-01T11:31:30.074626+00:00",
			"notes": "This course has class-year limits."
		},
		{
			"_updated": "2017-03-09T23:22:43.460166+00:00",
			"locations": [
				"DC 115",
				"DC 115",
				"DC 115"
			]
		},
		{
			"_updated": "2017-05-30T17:11:24.967972+00:00",
			"description": "The department periodically offers special topics courses. The specific title of the course is listed in the class and lab schedule when it is offered."
		},
		{
			"_updated": "2018-07-12T16:51:38.539198+00:00",
			"enroll": null,
			"max": null
		}
	],
	"semester": 2,
	"status": "O",
	"term": 20162,
	"times": [
		"M-F 0900-1000",
		"M-F 1040-1200PM",
		"M-F 0100-0300PM"
	],
	"title": "Topics in the Fine Arts",
	"type": "Topic",
	"year": 2016
}
