{
	"clbid": 109639,
	"credits": 1.0,
	"crsid": 29274,
	"departments": [
		"ASIAN"
	],
	"description": "This interdisciplinary course explores the timeless concept of the hero from both Asian and Western traditions. Classical heroes will be analyzed along with those featured in contemporary films, fictions, comics, and pop culture. The main goal is to compare and examine how heroes have informed intellectual, artistic, and moral traditions in various cultures and how heroic ideas were spread, transformed, and re-imagined to suit the needs of their times. Taught alternate year during fall semester. Counts toward Asian studies major and China studies and Japan studies concentrations.",
	"gereqs": [
		"MCG",
		"WRI"
	],
	"instructors": [
		"Ka F. Wong"
	],
	"level": 300,
	"locations": [
		"TOH 112",
		"TOH 112"
	],
	"name": "What is a Hero?",
	"number": 333,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.214033+00:00",
			"locations": []
		},
		{
			"_updated": "2016-09-22T11:31:40.516547+00:00",
			"grouptype": "R"
		},
		{
			"_updated": "2016-10-05T11:32:19.906019+00:00",
			"locations": [
				"TBA",
				"TBA"
			]
		},
		{
			"_updated": "2016-10-07T11:32:21.355144+00:00",
			"locations": [
				"TOH 212",
				"TOH 212"
			]
		},
		{
			"_updated": "2016-11-11T11:31:32.435976+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:27.391704+00:00",
			"description": "This interdisciplinary course explores the timeless concept of the hero from both Asian and Western traditions. Classical heroes will be analyzed along with those featured in contemporary films, fictions, comics, and pop culture. The main goal is to compare and examine how heroes have informed intellectual, artistic, and moral traditions in various cultures and how heroic ideas were spread, transformed, and re-imagined to suit the needs of their times. Counts toward Asian studies major and China studies and Japan studies concentrations. Taught alternate year during fall semester."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"type": "Research",
	"year": 2016
}
