{
	"clbid": "0000109377",
	"credits": 1.0,
	"crsid": "0000000004",
	"department": "AMST",
	"description": [
		"This analysis of modern American society introduces theories and methods of culture studies, beginning with anthropological definitions of culture and including perspectives of sociology, political science, history, art history, and English. Students examine the moral ecology of everyday life in America, looking at the cultural meanings of work, clothes, food, family, gender, buildings, bodies, television, advertising, and education. Offered annually in the fall semester. Counts toward women's and gender studies major and concentration and media studies concentration."
	],
	"enrolled": 24,
	"gereqs": [
		"HBS",
		"MCD"
	],
	"instructors": [
		"Mark Allister"
	],
	"level": 100,
	"max": 25,
	"name": "Perspect Am Culture",
	"number": 100,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "RML 525",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "RML 525",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "RML 525",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.200996+00:00",
			"locations": []
		},
		{
			"_updated": "2016-11-20T11:31:32.465887+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:26.878161+00:00",
			"description": "This analysis of modern American society introduces theories and methods of culture studies, beginning with anthropological definitions of culture and including perspectives of sociology, political science, history, art history, and English. Students examine the moral ecology of everyday life in America, looking at the cultural meanings of work, clothes, food, family, gender, buildings, bodies, television, advertising, and education. Counts toward women's and gender studies major and concentration and media studies concentration. Offered annually in the fall semester."
		},
		{
			"_updated": "2018-07-12T16:51:41.147662+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.743077+00:00",
			"enroll": "24",
			"max": "25"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"title": "American Culture: Interdisciplinary Perspectives",
	"type": "Research",
	"year": 2016
}
