{
	"clbid": "0000109839",
	"credits": 1.0,
	"crsid": "0000030314",
	"department": "PSCI",
	"description": [
		"A central concept in political science, civil society refers to social association and self-regulation outside of the legislative and coercive functions of the state. Students examine factors affecting the strength and nature of civil society and its effects on political life, attending to how civil society develops differently in specific parts of the world. The course also introduces normative prescriptions for improving civil society. The first part of the course introduces students to the forms, norms, and expressions of civil society, while the second part of the course delves more deeply into a specific example of a civil society. The specific topic of the second section of the course will vary each time it is offered. Offered alternate years."
	],
	"enrolled": 11,
	"gereqs": [
		"HBS"
	],
	"instructors": [
		"J. Patrick Dale"
	],
	"learningmode": "S",
	"level": 200,
	"max": 24,
	"name": "Civil Society",
	"number": 280,
	"offerings": [
		{
			"day": "Mo",
			"end": "12:40",
			"location": "CHM 232",
			"start": "10:40"
		},
		{
			"day": "Tu",
			"end": "12:40",
			"location": "CHM 232",
			"start": "10:40"
		},
		{
			"day": "We",
			"end": "12:40",
			"location": "CHM 232",
			"start": "10:40"
		},
		{
			"day": "Th",
			"end": "12:40",
			"location": "CHM 232",
			"start": "10:40"
		},
		{
			"day": "Fr",
			"end": "12:40",
			"location": "CHM 232",
			"start": "10:40"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:36.568357+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:42.548460+00:00",
			"locations": [
				"TBA"
			]
		},
		{
			"_updated": "2016-09-15T11:31:28.918627+00:00",
			"grouptype": "R"
		},
		{
			"_updated": "2017-05-30T17:11:30.571797+00:00",
			"description": "A central concept in political science, civil society refers to social association and self-regulation outside of the legislative and coercive functions of the state. Students examine factors affecting the strength and nature of civil society and its effects on political life, attending to how civil society develops differently in specific parts of the world. The course also introduces normative prescriptions for improving civil society. The first part of the course will introduce students to the forms, norms and expressions of civil society, while the second part of the course will delve more deeply into a specific example of a civil society. The specific topic of the second section of the course will vary each time it is offered. Offered alternate years."
		},
		{
			"_updated": "2018-07-12T16:51:38.573554+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:31.807109+00:00",
			"enroll": "11",
			"max": "24"
		},
		{
			"_updated": "2020-09-18T15:03:56.413280+00:00",
			"max": 24
		},
		{
			"_updated": "2020-10-15T15:24:00.621355+00:00",
			"learningmode": null
		},
		{
			"_updated": "2021-03-02T16:51:37.961124+00:00",
			"max": 27
		}
	],
	"semester": 2,
	"status": "O",
	"term": 20162,
	"type": "Research",
	"year": 2016
}
