{
	"clbid": 109505,
	"credits": 1.0,
	"crsid": 270,
	"departments": [
		"ECON"
	],
	"description": [
		"The health care sector in the U.S. is undergoing rapid change that affects patients, providers and payers. Managed care and managed competition are restructuring the delivery of health care services and reducing costs, while frustrating physicians and patients. The course examines the economic factors leading to the changes, current issues and controversies, and federal health policies. Students interested in nursing, medicine, and the sciences are encouraged to enroll. Offered annually. Counts toward American studies major. Prerequisites: one of Economics 110-121 or permission of instructor."
	],
	"enroll": 22,
	"gereqs": [
		"HBS"
	],
	"instructors": [
		"Ashley Hodgson"
	],
	"level": 200,
	"locations": [
		"TB 216"
	],
	"max": 25,
	"name": "Health Care Econ",
	"number": 245,
	"pn": false,
	"prerequisites": "Prerequisites: one of Economics 110-121 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:47.163886+00:00",
			"locations": []
		},
		{
			"_updated": "2017-05-30T17:12:22.198741+00:00",
			"description": "The health care sector in the U.S. is undergoing rapid change that affects patients, providers and payers. Managed care and managed competition are restructuring the delivery of health care services and reducing costs, while frustrating physicians and patients. The course examines the economic factors leading to the changes, current issues and controversies, and federal health policies. Students interested in nursing, medicine, and the sciences are encouraged to enroll. Offered annually. Counts toward American studies major. Counts toward biomedical studies concentration (for students through class of 2016). Prerequisites: one of Economics 110-121 or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:36.889571+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:30.326415+00:00",
			"enroll": "22",
			"max": "25"
		}
	],
	"section": "A",
	"semester": 1,
	"status": "O",
	"term": 20161,
	"times": [
		"MWF 0905-1000"
	],
	"title": "Economics of Health Care",
	"type": "Research",
	"year": 2016
}
