{
	"clbid": 109462,
	"credits": 1.0,
	"crsid": 21527,
	"departments": [
		"ENGL"
	],
	"description": [
		"This course focuses on bodily experience and afterlives in and of literature from the fourteenth to the early seventeenth century. The “corpse” of the title refers to the human bodies in the texts we will study —bodies that may experience pleasure, suffer pain and even martyrdom, and ultimately decay, as the spirit experiences some kind of afterlife. However, despite conceptions of the afterlife, the dead remained an important presence for the living, as intercessors, apparitions, ghosts and saints. The “corpus” is the body of a text—a story that is revisited by artists over time, in an afterlife of its own, as Shakespeare re-writes Hamlet or The Revenger’s Tragedy is re-imagined by Alan Cox in a postmodern film. For the English major, this course counts as a Literary History course and a pre-1800 course. Prerequisite: FYW."
	],
	"gereqs": [
		"ALS-L"
	],
	"instructors": [
		"Karen E. Marsalek"
	],
	"level": 200,
	"locations": [
		"RML 525",
		"RML 525"
	],
	"name": "Topic/Lit Hist: Corpse & Corpus",
	"number": 220,
	"pn": false,
	"prerequisites": "Prerequisite: FYW.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:47.099922+00:00",
			"grouptype": "R",
			"locations": []
		},
		{
			"_updated": "2017-05-30T17:12:19.452725+00:00",
			"description": "These courses trace the process of literary change during a selected period of approximately one hundred years, providing an experience of chronological breadth and textual variety. Students examine the development of styles, conventions, and forms within a particular national literature or across two or more national literatures. Examples of possible topics include Declarations of Independence in American Literature; Literature of the Atlantic Triangle, 1650-1800; 20th-century British and Irish Modernism. May be repeated if topic is different. Click on course title in the class and lab for more information about the course for that term. Prerequisite: FYW."
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20161,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Topics in Literary History",
	"type": "Topic",
	"year": 2016
}
