{
	"clbid": "0000109380",
	"credits": 1.0,
	"crsid": "0000000649",
	"department": "FAMST",
	"description": [
		"Students study the contemporary American family as it meets the challenge of a changing social world. The primary objective is to enlarge both personal and intellectual understanding of the complex issues facing families. Using the range of behavioral sciences concerned with family life, students study the interaction of individuals within families and families within society. Primary emphasis is on theories and practice of family communication. Offered each semester. Counts toward American studies major, family studies and educational studies concentrations, and women's and gender studies major and concentration."
	],
	"enrolled": 26,
	"instructors": [
		"Lisa L. Moore"
	],
	"level": 200,
	"locations": [
		"OM 010"
	],
	"max": 26,
	"name": "Family Relationships",
	"notes": [
		"This course has class year limits. Not open to first-year students."
	],
	"number": 242,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:47.019956+00:00",
			"locations": [],
			"notes": null
		},
		{
			"_updated": "2016-09-13T11:31:28.708461+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:15.954715+00:00",
			"description": "Students study the contemporary American family as it meets the challenge of a changing social world. The primary objective is to enlarge both personal and intellectual understanding of the complex issues facing families. Using the range of behavioral sciences concerned with family life, students study the interaction of individuals within families and families within society. Primary emphasis is on theories and practice of family communication. Offered annually in the spring semester. Counts toward American studies major, family studies and educational studies concentrations, and women's and gender studies major and concentration."
		},
		{
			"_updated": "2018-07-12T16:51:36.832625+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:30.256341+00:00",
			"enroll": "26",
			"max": "26"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 0905-1000"
	],
	"type": "Research",
	"year": 2016
}
