{
	"clbid": 109801,
	"credits": 0.0,
	"crsid": 30311,
	"departments": [
		"MUSEN"
	],
	"description": [
		"Through regular rehearsal and coaching sessions, new or already-formed chamber groups prepare and perform selected literature, and learn about related repertoire while cultivating observation, communication, and leadership skills. Typical ensembles would include instrumentalists and/or vocalists, with three to eight performers, one on a part. Examples are string quarters, brass or woodwind quintets, piano trios, saxophone quartets, and jazz combos. May be repeated. Offered each semester. Prerequisite: permission of instructor."
	],
	"instructors": [
		"Kent M. McWilliams"
	],
	"level": 100,
	"name": "Chamber Music",
	"notes": [
		"Students form chamber groups based on approval of music faculty. No set meeting",
		"times. Locations and times of rehearsals, coachings and performances determined",
		"by each coach and ensemble."
	],
	"number": 171,
	"pn": true,
	"prerequisites": "permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:47.233154+00:00",
			"locations": []
		},
		{
			"_updated": "2016-12-09T22:34:01.001592+00:00",
			"grouptype": "R"
		},
		{
			"_updated": "2017-08-08T00:46:09.607792+00:00",
			"description": "Through regular rehearsal and coaching sessions, new or already-formed chamber groups prepare and perform selected literature, and learn about related repertoire while cultivating observation, communication, and leadership skills. Typical ensembles would include instrumentalists and/or vocalists, with 3 to 8 performers, one on a part. Examples would be string quarters, brass or woodwind quintets, piano trios, saxophone quartets, and jazz combos. May be repeated. Offered each semester. Prerequisite: permission of instructor.",
			"notes": "Students form chamber groups based on approval of music faculty. No set meeting times. Locations and times of rehearsals, coachings and performances determined by each coach and ensemble.",
			"type": "Research"
		},
		{
			"_updated": "2018-02-03T00:01:55.828764+00:00",
			"prerequisites": "Prerequisite: permission of instructor."
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20161,
	"type": "Ensemble",
	"year": 2016
}
