{
	"clbid": 109722,
	"credits": 1.0,
	"crsid": 979,
	"departments": [
		"PHIL"
	],
	"description": [
		"This course examines the main Western ethical theories and their application to contemporary moral concerns. Theoretical issues may include rights, duties, virtue, hedonism, egoism, the relation between ethics and theology, the fact-value distinction, relativism, and pluralism. Students discuss current topics such as global economic justice, euthanasia, the death penalty, animal rights, censorship, racism, privacy rights versus public safety, reproductive ethics, and environmental ethics. Offered annually. Counts toward management studies concentration. Prerequisite: completion of BTS-T or permission of instructor."
	],
	"gereqs": [
		"EIN"
	],
	"instructors": [
		"Kathryn R. Swanson"
	],
	"level": 200,
	"locations": [
		"TOH 314"
	],
	"name": "Ethics and the Good Life",
	"notes": [
		"Prerequisite: completion of BTS-T or permission of instructor.",
		"Open only to seniors and a limited number of juniors during web registration."
	],
	"number": 252,
	"pn": false,
	"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.334709+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:54.723346+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2016-10-05T11:32:20.160651+00:00",
			"locations": [
				"OM 140"
			]
		},
		{
			"_updated": "2017-05-30T17:12:32.018960+00:00",
			"description": "This course examines the main Western ethical theories and their application to contemporary moral concerns. Theoretical issues may include rights, duties, virtue, hedonism, egoism, the relation between ethics and theology, the fact-value distinction, relativism, and pluralism. Students discuss current topics such as global economic justice, euthanasia, the death penalty, animal rights, censorship, racism, privacy rights versus public safety, reproductive ethics, and environmental ethics. Offered annually. Counts toward biomedical studies concentration (for students through class of 2016) and management studies concentration. Prerequisite: completion of BTS-T or permission of instructor."
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20163,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2016
}
