{
	"clbid": 109824,
	"credits": 1.0,
	"crsid": 19414,
	"departments": [
		"PSYCH"
	],
	"description": [
		"By 2030, one in five people will be aged 65 or older. This \u0093silver tsunami\u0094 will be either a burden or an opportunity for society, depending on the extent to which we promote healthy cognitive aging. Our research this semester will examine adults of all ages to characterize patterns of stability and decline in cognition, as well as possible underlying neural mechanisms. Students will explore multidisciplinary issues, methods and theories in the studies of aging and learning and gain substantial hands-on research experience! Prerequisite: Psych 125. An application is required to register for this course. Please contact Darla Frandrup for the link to the form."
	],
	"instructors": [
		"Jessica R. Petok"
	],
	"level": 300,
	"locations": [
		"RNS 226",
		"RNS 226"
	],
	"name": "Research: The Aging Mind",
	"notes": "Permission of instructor required to register. Closed during web registration.",
	"number": 396,
	"pn": false,
	"prerequisites": "Prerequisite: Psych 125. An application is required to register for this course. Please contact Darla Frandrup for the link to the form.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.430437+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-19T11:32:03.993012+00:00",
			"name": "Research:"
		},
		{
			"_updated": "2016-10-21T13:15:06.400254+00:00",
			"instructors": [
				"Petok Jessica R."
			]
		},
		{
			"_updated": "2016-10-22T11:31:45.347556+00:00",
			"notes": null,
			"status": "O"
		},
		{
			"_updated": "2016-10-27T11:31:18.188517+00:00",
			"locations": [
				"RNS 208",
				"RNS 208"
			]
		},
		{
			"_updated": "2017-05-30T17:12:35.416554+00:00",
			"description": "This course provides a comprehensive research opportunity, including an introduction to relevant background material, technical instruction, identification of a meaningful project, and data collection. The topic is determined by the faculty member in charge of the course and may relate to his/her research interests. Offered based on department decision. May be offered as a 1.00 credit course or .50 credit course. Prerequisite: determined by individual instructor.",
			"prerequisites": "Prerequisite: determined by individual instructor."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"title": "Directed Undergraduate Research",
	"type": "Research",
	"year": 2016
}
