{
	"clbid": "0000109802",
	"credits": 1.0,
	"crsid": "0000030315",
	"departments": [
		"PSCI"
	],
	"description": [
		"The political science research practicum provides a new opportunity to realize the college and department's commitment to undergraduate research. Students put research skills into practice by gathering and analyzing empirical evidence, and producing a substantive research project. With research topics varying from term to term, students develop methodological expertise surrounding a current problem in political science, and collect and analyze data to address the problem. Offered alternate years."
	],
	"enroll": 10,
	"gereqs": [
		"HBS"
	],
	"instructors": [
		"Christopher B. Chapp"
	],
	"level": 200,
	"locations": [
		"RNS 124"
	],
	"max": 16,
	"name": "Research Practicum",
	"notes": [
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 296,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:47.234688+00:00",
			"grouptype": "R",
			"locations": []
		},
		{
			"_updated": "2016-09-01T11:32:02.879256+00:00",
			"notes": null
		},
		{
			"_updated": "2017-05-30T17:12:25.026886+00:00",
			"description": "The political science research practicum provides a new opportunity to realize the college and department's commitment to undergraduate research. Students will put research skills into practive by gathering and analyzing empirical evidence, and producing a substantive research project. With research topics varying from term to term, students will develop methodological expertise surrounding a current problem in political science, and will collect and analyze data to address the problem. Offered alternate years."
		},
		{
			"_updated": "2018-07-12T16:51:36.944973+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:30.359486+00:00",
			"enroll": "10",
			"max": "16"
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20161,
	"times": [
		"MWF 1045-1140"
	],
	"title": "Political Science Research Practicum",
	"type": "Research",
	"year": 2016
}
