{
	"clbid": "0000109627",
	"credits": 1.0,
	"crsid": "0000025614",
	"department": "SWRK",
	"description": [
		"Students study historical and contemporary realities of race, class, gender, health, welfare, and human rights in South Africa. This dynamic society provides unique opportunities to study the challenges and successes of inclusion, respect, restitution, and reconciliation in the post-Apartheid era. Students travel to three regions and meet with scholars, activists, and practitioners in a variety of settings. Special emphasis is on the situations of women, children, and families. Offered periodically during Interim. Counts toward Africa and the Americas and family studies concentrations and race and ethnic studies major and concentration. Prerequisite: one course in political science, sociology/anthropology, social work, economics, psychology, family studies, or women's and gender studies."
	],
	"enrolled": 23,
	"firstyear": "0/0",
	"gereqs": [
		"MCG"
	],
	"grouptype": "R",
	"instructors": [
		"Mary Carlsen"
	],
	"learningmode": "S",
	"level": 200,
	"max": 24,
	"name": "Social Realities S Africa",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 280,
	"pn": false,
	"prerequisites": "one course in political science, sociology/anthropology, social work, economics, psychology, family studies, or women's and gender studies.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:36.557316+00:00",
			"locations": []
		},
		{
			"_updated": "2016-09-23T11:31:26.659936+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:29.891136+00:00",
			"description": "Students study historical and contemporary realities of race, social class, health, welfare,and human rights in South Africa. This dynamic society provides unique opportunities to study the challenges and successes of inclusion, respect, and reconciliation in the post-Apartheid era. Students travel to three regions and meet with public, private, and community-based organizations. Special emphasis is on the status of women and children. Offered periodically during Interim. Counts toward Africa and the Americas and family studies concentrations. Prerequisite: one course in political science, sociology/anthropology, social work, economics, psychology, family studies, or women's and gender studies."
		},
		{
			"_updated": "2018-02-03T00:01:56.915157+00:00",
			"prerequisites": "Prerequisite: one course in political science, sociology/anthropology, social work, economics, psychology, family studies, or women's and gender studies."
		},
		{
			"_updated": "2018-07-12T16:51:38.569137+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:31.801399+00:00",
			"enroll": "23",
			"max": "24"
		},
		{
			"_updated": "2018-11-02T04:18:38.400330+00:00",
			"firstyear": null
		},
		{
			"_updated": "2020-10-15T15:24:00.617936+00:00",
			"learningmode": null
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20162,
	"title": "Social Realities in South Africa",
	"type": "Research",
	"year": 2016
}
