{
	"clbid": 109470,
	"credits": 1.0,
	"crsid": 452,
	"departments": [
		"ENGL"
	],
	"description": [
		"This seminar is designed to compliment studies in literature and/or creative writing through the examination and application of rhetorical and composition (writing) theory. You will learn basic rhetorical analysis methodology. Rhetorical analysis examines what makes arguments effective for a specific purpose, audience, and context. By learning this methodology, you will improve your close reading, critical thinking, and writing skills\u0097hallmarks of a graduating English major. You will also read and discuss contemporary composition theory, investigating what writing is, how it comes into being, and how it circulates. You will apply what we learn to issues, practices, and text (literary, digital, visual, and non-academic) to analyze contemporary uses of rhetoric and writing theory. See English Department website for more details."
	],
	"instructors": [
		"Rebecca S. Richards"
	],
	"level": 300,
	"locations": [
		"RML 520",
		"RML 520"
	],
	"name": "Sem: Rhetoric & Power of Persuasion",
	"notes": "Open to rising juniors and seniors who have completed English 185 and at least two level-II English courses or by permisison of instructor.",
	"number": 399,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:47.115081+00:00",
			"locations": [],
			"notes": "Open to juniors and seniors who have completed English 185 and at least two level-II English courses or by permisison of instructor."
		},
		{
			"_updated": "2016-09-13T11:31:28.801929+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:19.992753+00:00",
			"description": "In this seminar, students learn about a range of methods for literary research by exploring literature in the context of critical, theoretical, cultural, or historical materials. For each student, the centerpiece of the course is the research and writing of a long essay that represents his or her individual research interests. Students share and respond to each other's work-in-progress and present their completed projects to the seminar. May be repeated if topic is different. Prerequisites: open to juniors and seniors who have completed ENGL 185 and at least two level II English courses or by permission of the instructor.",
			"prerequisites": "Prerequisites: open to juniors and seniors who have completed ENGL 185 and at least two level II English courses or by permission of the instructor."
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "The Major Seminar",
	"type": "Seminar",
	"year": 2016
}
