{
	"clbid": "0000164507",
	"credits": 1.0,
	"crsid": "0000036264",
	"department": "SPAN",
	"description": [
		"Students explore diverse experiences of modern Latin America through the lenses of gender and race, which provide a productive framework for examining economic, class, and other key aspects of Latin American society. Students will work with a variety of sources, both literary and non-literary, including articles, images, documents, and at least one substantive literary work. This cultural analysis provides for the development of critical reading and writing skills (e.g., description, narration, exposition, and argumentation). Taught in Spanish. Offered each semester. Also counts toward women's and gender studies, gender and sexuality studies, race and ethnic studies, and Latin American studies majors and race and ethnic studies, management studies, gender and sexuality studies, and women's and gender studies concentrations. This course is equivalent to SPAN 250 and students can earn credit from only one of them. Prerequisites: SPAN 232 or placement into SPAN 250 or SPAN 251 or permission of the instructor."
	],
	"enrolled": 4,
	"gereqs": [
		"WAC",
		"WLC"
	],
	"instructors": [
		"Mariana Reyes Payán"
	],
	"learningmode": "S",
	"level": 200,
	"max": 15,
	"name": "Gender & Race in Latin America",
	"notes": [
		"Prerequisite: Completion of Spanish placement test or SPAN 232.",
		"Students may take either SPAN 250 or SPAN 251, which are equivalent, but cannot",
		"take both."
	],
	"number": 251,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "TOH 186",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "TOH 186",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "TOH 186",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: SPAN 232 or placement into SPAN 250 or SPAN 251 or permission of the instructor.",
	"revisions": [
		{
			"_updated": "2025-10-11T21:37:10.542956+00:00",
			"gereqs": [
				"FOL-S",
				"WRI",
				"WAC",
				"WLC"
			]
		},
		{
			"_updated": "2025-11-05T03:07:25.431964+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2025-11-06T03:09:51.285079+00:00",
			"enrolled": 2
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20253,
	"title": "Gender and Race in Modern Latin America",
	"type": "Research",
	"year": 2025
}
