{
	"clbid": "0000090801",
	"credits": 1.0,
	"crsid": "0000000292",
	"department": "CSCI",
	"description": [
		"This course provides an introduction to the structure and creation of computer software, using the C++ programming language and emphasizing object-oriented programming and software life-cycle methodology. Concepts and skills are applied in a team project based on the waterfall model of software development. Topics include object-oriented programming, specification, high-level memory management, indirect addressing, formal methods, tools including UML, team software process, requirements analysis, software design strategies, and elementary ethical analysis of software systems. Prerequisite: Computer Science 121 or Computer Science 125 or Computer Science 241 or Physics 130 or Math 252 or permission of instructor. Concurrent registration in Computer Science 252 is required. Offered both semesters."
	],
	"enrolled": 25,
	"groupid": "0000000292",
	"instructors": [
		"Olaf A. Hall-Holt"
	],
	"junior": "2/8",
	"level": 200,
	"max": 25,
	"name": "Software Design",
	"notes": [
		"This course has class-year limits.",
		"Students in CSCI 251 must also register for one lab CSCI 252 AL or BL."
	],
	"number": 251,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "RNS 203",
			"start": "09:05"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "RNS 203",
			"start": "09:05"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "RNS 203",
			"start": "09:05"
		}
	],
	"pn": false,
	"prerequisites": "Computer Science 121 or Computer Science 125 or Computer Science 241 or Physics 130 or Math 252 or permission of instructor. Concurrent registration in Computer Science 252 is required. Offered both semesters.",
	"revisions": [
		{
			"_updated": "2018-02-02T23:58:09.484884+00:00",
			"prerequisites": "Prerequisite: Computer Science 121 or Computer Science 125 or Computer Science 241 or Physics 130 or Math 252 or permission of instructor. Concurrent registration in Computer Science 252 is required. Offered both semesters."
		},
		{
			"_updated": "2018-07-12T16:51:15.672725+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:09.716228+00:00",
			"enroll": "25",
			"max": "25"
		},
		{
			"_updated": "2018-10-19T04:12:20.065569+00:00",
			"firstyear": null,
			"sophomore": null
		},
		{
			"_updated": "2018-10-28T04:14:56.318694+00:00",
			"firstyear": "4/8",
			"junior": null,
			"senior": null,
			"sophomore": "2/8"
		}
	],
	"semester": 3,
	"senior": "4/8",
	"status": "C",
	"term": 20133,
	"title": "Software Design and Implementation",
	"type": "Research",
	"year": 2013
}
