{
	"clbid": "0000105914",
	"credits": 1.0,
	"crsid": "0000000792",
	"department": "MEDIA",
	"description": [
		"This introductory-level course encourages students to assess and shape their personal relationship to mass media. Its premise is that we are all, to some extent, uninformed and uncritical consumers of media products and services rather than conscientious and socially-minded users of them. In this spirit, the course provides a comprehensive historical overview of the various print and electronic media that have shaped, and continue to shape, our lives. By examining the issues that have influenced the development of the mass media, the course considers ideological, cultural, aesthetic and ethical perspectives. Counts toward American studies major and film studies concentration."
	],
	"enrolled": 25,
	"firstyear": "9/5",
	"gereqs": [
		"MCD",
		"ORC"
	],
	"instructors": [
		"William Sonnega"
	],
	"junior": "5/5",
	"level": 100,
	"max": 21,
	"name": "Mass Media",
	"notes": [
		"This course has class-year limits."
	],
	"number": 160,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "TB 216",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "TB 216",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.626895+00:00",
			"locations": []
		},
		{
			"_updated": "2016-04-27T11:01:06.311028+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-09-03T11:31:25.957278+00:00",
			"status": "C"
		},
		{
			"_updated": "2016-09-07T11:31:29.073938+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:55.615462+00:00",
			"description": "This introductory-level course is part of a two-course sequence that encourages students to assess and shape their personal relationship to mass media. Its premise is that we are all, to some extent, uninformed and uncritical consumers of media products and services rather than conscientious and socially-minded users of them. In this spirit, the course provides a comprehensive historical overview of the various print and electronic media that have shaped, and continue to shape, our lives. By examining the issues that have influenced the development of the mass media, the course considers ideological, cultural, aesthetic and ethical perspectives. Counts toward American studies major and film studies concentration."
		},
		{
			"_updated": "2018-07-12T16:51:36.667496+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:30.077511+00:00",
			"enroll": "25",
			"max": "21"
		},
		{
			"_updated": "2018-10-19T04:12:34.605361+00:00",
			"firstyear": null,
			"junior": null,
			"senior": null,
			"sophomore": null
		}
	],
	"semester": 1,
	"senior": "7/5",
	"sophomore": "4/5",
	"status": "C",
	"term": 20161,
	"type": "Research",
	"year": 2016
}
