{
	"clbid": 105299,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": "Comparative Scriptures: The Bible and Other Sacred Texts What is the place of the Bible in our religiously diverse world? In this section of Religion 121 we will study the Bibles of Judaism and Christianity together with scriptures of other religious traditions. We will consider the following questions: What is scripture? What kinds of literature are found in scriptures? What kinds of questions do scriptures address? How are scriptures used by religious people around the world? What is the relevance of scripture in the 21st century? We will carefully read and discuss selections from the Hebrew Bible of Judaism, the Old and New Testaments of Christianity, the Qur\u0092an of Islam, the Vedas and other sacred texts of Hinduism, various Buddhist sutras, and Native American stories.",
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Ben Van Overmeire"
	],
	"level": 100,
	"locations": [
		"OM 340"
	],
	"name": "Bible/Culture/Commun",
	"notes": "Section Title: Comparative Scriptures: The Bible and Other Sacred Texts",
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:45.837770+00:00",
			"instructors": [
				"Margaret Odell"
			],
			"locations": [],
			"section": "J"
		},
		{
			"_updated": "2016-06-25T06:18:55.382100+00:00",
			"notes": null
		},
		{
			"_updated": "2016-08-06T17:00:53.079113+00:00",
			"instructors": [
				"Staff"
			],
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:10:56.781244+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "Q",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
