{
	"clbid": 105487,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"Can We Have Environmental Conversations, Please? Why is it so difficult to talk about or come to action on environmental issues, when it seems as if all humans should care in making progress on how we take care of the non-human world? Our seminar will examine the impediments and the possibilities for such conversations by looking at various matters: the environmental mantra \u0093Think Globally, Act Locally\u0094; the environmental framework of \u0093Integral Ecology\u0094 and its relation to Pope Francis\u0092 encyclical Laudago Si; food production in the United States; and St. Olaf College\u0092s efforts to be good stewards of the non-human world. Students will read texts, research current events, watch films, and write essays in order to examine how we might promote environmental conversations. Intellectual play as well as experiential learning will be encouraged. (Open to Environmental Conversations students only.)"
	],
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Mark Allister"
	],
	"level": 100,
	"locations": [
		"RML 421",
		"RML 421"
	],
	"name": "First-Year Writing",
	"notes": "Open to Environmental Conversations students only. Section Title: Can We Have Environmental Conversations, Please?",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.112121+00:00",
			"locations": [],
			"status": "O"
		},
		{
			"_updated": "2016-06-25T06:18:55.716875+00:00",
			"notes": "Open to Environmental Conversations students only."
		},
		{
			"_updated": "2017-05-30T17:11:16.590045+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "K",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"type": "Research",
	"year": 2016
}
