{
	"clbid": "0000105482",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"The recent economic downturn—what many have called a collapse—has raised concerns regarding the financial health of future generations. It is now widely accepted that the potential for younger Americans to do better than previous generations—the narrative of social mobility popularly understood as the American Dream—is no longer a reality. Instead, there is a growing consensus regarding the death of this dream and with it the very possibility to improve one’s economic, social, and cultural condition. It seems that rather than progressing toward a healthy democracy, the United States has spiraled into a science fiction reality where the media controls our thinking, politics is governed by self-interest, and corporations are powerful enough to hire private armies to impose their will around the globe. This seminar centers on twentieth century American culture, particularly as it relates to issues of historical progress, national identity, cultural change, and aesthetic experimentation. The main question we will address is “What has happened to the American Dream?” In addition to literature, we will also read some philosophical and political texts. Requirements will include short writing assignments, a mid-term paper, and a final paper. Some of the texts we will discuss include The Yellow Wallpaper, as well as films like There Will Be Blood, The Corporation, Revolutionary Road, andFight Club."
	],
	"enrolled": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Carlos Gallego"
	],
	"level": 100,
	"locations": [
		"OM 020"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Title: 20th Century American Culture and the Death of the Dream"
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.102292+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.707130+00:00",
			"notes": null
		},
		{
			"_updated": "2016-08-06T17:00:53.173038+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:15.968920+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:36.436614+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.807410+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "G",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2016
}
