{
	"clbid": "0000105491",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"On Being Human. What does it mean to be a human being in our modern world? Though all modern humans are biologically and genetically distinguishable in one unified species, technology and social attitudes challenge that unity. In this seminar, we will support each other in discussing and writing about a range of topics relevant to being a modern human (and a college student!). For example, new information about our species’ scandalous relationships with extinct relatives like Neanderthals will help us interpret how evolutionary history has resulted in today's globally distributed Homo sapiens. As another example, wide ranging perspectives on racism will help us navigate this difficult concept together and then launch students into investigations of other “isms.” Course resources draw from science and literature and are accessible to students of all interests and backgrounds. Assignments are designed to build research and writing skills over the semester and will include a personal essay, a research paper, and several response and summary assignments."
	],
	"enrolled": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Jean C. Porterfield"
	],
	"junior": "0/0",
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Title: On Being Human"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "RNS 435",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "RNS 435",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.119269+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.727872+00:00",
			"locations": [
				"RNS 124",
				"RNS 124"
			],
			"notes": null
		},
		{
			"_updated": "2016-08-06T17:00:53.181047+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:17.099279+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:36.444199+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.818064+00:00",
			"enroll": "18",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:36.388185+00:00",
			"junior": null,
			"senior": null
		}
	],
	"section": "L",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20161,
	"type": "Research",
	"year": 2016
}
