{
	"clbid": 105290,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": [
		"Reading the Bible Around the World What does the place one reads the Bible matter? What difference does who one reads with make? These questions are central to this section. Composed in what we call the Middle East, the Bible has been carried around the world. The Bible is one thing Christians in have in common, though the context in which they read it varies. Protestant Reformers insisted that the Bible be made available in the vernacular, common language of believers. Missionaries make translating the Bible among their first tasks. Despite agreement that the Bible is central to faith differing readings of the Bible often lead to disputes and divisions among Christians. In this section we consider both what the Bible says and to how it is heard/read by various audiences. We pay particular attention to readers in the global south, where Christianity is growing, read this book. In addition, we look at the ways artists interpret the Bible in images drawn from the culture of their time and place. We ask what constitutes a \u0093good\u0094 reading and what factors contribute to one."
	],
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"L. DeAne Lagerquist"
	],
	"level": 100,
	"locations": [
		"OM 210"
	],
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Title: Reading the Bible Around the World",
		"Supplemental Instruction (SI) is available for this course."
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:45.818748+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.344847+00:00",
			"notes": null
		},
		{
			"_updated": "2016-08-06T17:00:53.069834+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-08-17T11:31:37.036457+00:00",
			"notes": "Section Title: Reading the Bible Around the World"
		},
		{
			"_updated": "2017-05-30T17:10:55.415158+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "A",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 0800-0855"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
