{
	"clbid": 105489,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": "The Trickster. \"The Trickster\" is an engaging and significant phenomenon in the lives of human beings all over the world. Thinking and writing about the trickster will help us discover an important part of ourselves as humans. We will read, discuss, and write about narratives and other discourses dealing with the trickster. These will include folktales, epic and fictional tales, and theoretical works. We will reflect on these readings and respond to them in our writings, particularly by using these materials as sources of inspiration. Student writing will be discussed in conferences with the instructor. Texts include Beti's The Poor Christ of Bomba, Niane's Sundiata: An Epic of Old Mali, Radin's The Trickster, and Sanders' The Epic of Gilgamesh.",
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Joseph L. Mbele"
	],
	"level": 100,
	"locations": [
		"RML 421"
	],
	"name": "First-Year Writing",
	"notes": "Section Title: The Trickster",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.116143+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.721003+00:00",
			"notes": null
		},
		{
			"_updated": "2016-08-12T11:32:18.252530+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:16.808069+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "E",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 1045-1140"
	],
	"type": "Research",
	"year": 2016
}
