{
	"clbid": "0000105488",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Changing Our Minds. The United States is a country increasingly divided by issues of politics and religion. From immigration to abortion, from gun rights to bathroom rights, from vaccinations to marijuana use, many of us feel strongly about the issues that we care about. But from where, exactly, do our deepest held beliefs emerge? And how do we actually change the minds of others—or ourselves? In this seminar, we’ll use moral psychology to consider the roots of belief and the human capacity for change. Students will investigate an issue they care about through a variety of lenses: personal reflection, research, argument/debate, and interview/immersion with an “other” viewpoint. Ultimately students will try to convince their classmates—and themselves—to see the world in a more complex light."
	],
	"enrolled": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Kaethe Schwehn"
	],
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Title: Changing Our Minds"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "RML 515",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "RML 515",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.114218+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.718958+00:00",
			"notes": null
		},
		{
			"_updated": "2016-08-06T17:00:53.178153+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:16.714577+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:36.440867+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.814265+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "N",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"type": "Research",
	"year": 2016
}
