{
	"clbid": "0000105293",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"Reading the Bible for Love and Justice This course traces the twin themes of justice and love in the Bible. Some of the questions we’ll ask include: How do conceptions of divine love and justice change over the course of the Bible’s history? What kinds of justice and love are envisioned for human communities? How do different contexts, such as family, clan and community, national and international relations, affect biblical perspectives on justice? Where do we see biblical writers wrestling with problems posed by the apparent lack of justice? Can there be love without justice, or justice without love? A major focus of the course will be on the ways contemporary reading communities address lingering problems caused by unjust uses of the Bible, for example, in questions of gender, race, and power. We will also ask whether the Bible can continue to be a resource for reflecting on justice in the modern world, and if so, how."
	],
	"enrolled": 14,
	"instructors": [
		"Margaret Odell"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Title: Reading the Bible for Love and Justice"
	],
	"number": 121,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "OM 305",
			"start": "09:05"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "OM 305",
			"start": "09:05"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "OM 305",
			"start": "09:05"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:45.824654+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.355258+00:00",
			"notes": null
		},
		{
			"_updated": "2016-09-03T11:31:25.674106+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:10:55.865173+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:36.337934+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.683760+00:00",
			"enroll": "14",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:36.236241+00:00",
			"junior": null,
			"senior": null
		},
		{
			"_updated": "2020-10-15T15:23:59.567348+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:22.025605+00:00",
			"gereqs": [
				"BTS-B"
			]
		}
	],
	"section": "D",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20161,
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
