{
	"clbid": "0000105586",
	"credits": 1.0,
	"crsid": "0000001360",
	"department": "SWRK",
	"description": [
		"Humans relate to one another in diverse families, groups, organizations, and communities. Through traditional and alternative theoretical perspectives on human behavior, students apply prerequisite and advanced material from biology, sociology, psychology, and social work to assess situations encountered by social workers. Diverse examples are drawn from literature, social work research, and from students' autobiographies. Offered annually in the fall semester. Counts toward management studies concentration. Prerequisites: SOAN 121, PSYCH 241, and BIO 123 or BIO 243; open to non-majors by permission of chair only."
	],
	"enrolled": 15,
	"instructors": [
		"Mary Carlsen"
	],
	"level": 200,
	"max": 22,
	"name": "Hum Behav in Soc Env",
	"notes": [
		"Only open to rising juniors who meet the prerequisites."
	],
	"number": 246,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "OM 210",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "OM 210",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "OM 210",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: SOAN 121, PSYCH 241, and BIO 123 or BIO 243; open to non-majors by permission of chair only.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.230323+00:00",
			"locations": []
		},
		{
			"_updated": "2017-05-30T17:11:26.045083+00:00",
			"description": "Humans relate to one another in families, groups, organizations, and communities. Through traditional and alternative theoretical perspectives on human behavior, students apply prerequisite and advanced material from biology, sociology, psychology, and social work to assess situations encountered by social workers. Diverse examples are drawn from literature -- Love in the Driest Season, The Color of Water, A Poison Stronger than Love, and from students' autobiographies. Offered annually in the fall semester. Counts toward management studies concentration. Prerequisites: SOAN 121, PSYCH 241, and BIO 123 or BIO 243; open to non-majors by permission of chair only."
		},
		{
			"_updated": "2018-07-12T16:51:36.487989+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.873554+00:00",
			"enroll": "15",
			"max": "22"
		},
		{
			"_updated": "2018-10-19T04:12:34.466730+00:00",
			"sophomore": null
		}
	],
	"semester": 1,
	"sophomore": "13/22",
	"status": "O",
	"term": 20161,
	"title": "Human Behavior in the Social Environment",
	"type": "Research",
	"year": 2016
}
