{
	"clbid": 105307,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": [
		"Call and Response in Biblical Traditions For better or worse religious persons throughout history have acted out of a sense of divine calling. As in the biblical texts humans today migrate and mobilize, associate and separate, build and destroy in effort to respond to God. This section explores the tension of these lived realities by asking: 1) What authenticates calling in the Bible? 2) Who is called, and to whom? 3) For what purposes are persons called? Specifically examining the biblical underpinnings of Protestant renderings of vocation we will address these questions by attending to the relationship between self, God and neighbor in the texts and in their contemporary reception and application. Our study will be informed by consideration of four major themes related to vocation: work, family, the environment and political engagement."
	],
	"enroll": "16",
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Kiara Jorgenson"
	],
	"level": 100,
	"locations": [
		"OM 020",
		"OM 020"
	],
	"max": "18",
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Title: Call and Response in Biblical Traditions"
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:45.856056+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.420480+00:00",
			"instructors": [
				"Staff"
			],
			"notes": null
		},
		{
			"_updated": "2016-09-03T11:31:25.685065+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-10-21T13:14:58.827516+00:00",
			"instructors": [
				"Jorgenson Kiara"
			]
		},
		{
			"_updated": "2017-05-30T17:10:58.157404+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:36.350129+00:00",
			"enroll": null,
			"max": null
		}
	],
	"section": "R",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
