{
	"clbid": 105495,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"Exploring and Re-Imaging Place in the 21st Century. Place is much more than a set of geographic coordinates or physical location. When we talk about feeling out of place or feeling at home, we are invoking discourses regarding culture, race, gender, history, and politics. Place can be the Golden Gate Bridge, a web forum, Middle Earth, Yellowstone National Park, a video game, a shared memory, or a piece of art. Through discussion of literature and scholarly essays, we will examine what place means and how we give meaning to place and vice versa. We will explore the roles technology and a mobile lifestyle play in redefining our environments and how we behave in them. Major assignments may include personal narratives, research-driven profiles on place, reviews, and interactive digital projects that challenge or enhance our perception of particular places."
	],
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Jeremy Nagamatsu"
	],
	"level": 100,
	"locations": [
		"BMC 202"
	],
	"name": "First-Year Writing",
	"notes": [
		"Section Title: Exploring and Re-Imagining Place in the 21st Century"
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.127738+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.744043+00:00",
			"notes": null
		},
		{
			"_updated": "2016-09-03T11:31:25.776364+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-09-09T11:31:33.908737+00:00",
			"locations": [
				"BMC 012"
			]
		},
		{
			"_updated": "2017-05-30T17:11:17.803785+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "F",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2016
}
