{
	"clbid": "0000105484",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Border Crossings. This seminar examines the concept of crossing borders--geographically as well as metaphorically. Using readings from journalism, nonfiction, and fiction, we examine the reasons for leaving home and breaching a boundary and the ways people create a new life on the other side. Issues we explore include 2016 as the year of the greatest refugee crisis in recorded history; \"border syndrome\" as an emotional state (Gazmend Kapllani, A Border Crossing Handbook); the body's borders and the limits of medicine (the journalists who reported on the Ebola crisis); undocumented immigration to the United States (Sonia Nazario, Enrique's Journey), and the thin line between life and death (Markus Zusak, The Book Thief). We focus on the process of writing, revision, and contextual research in short assingments, with each student's work culminating in a \"thick description\" of a border crossing."
	],
	"enrolled": 16,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Karen Cherewatuk"
	],
	"level": 100,
	"locations": [
		"RML 420"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Title: Border Crossings"
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.103854+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.710357+00:00",
			"notes": null
		},
		{
			"_updated": "2016-09-03T11:31:25.767876+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:16.141311+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:36.437448+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.808779+00:00",
			"enroll": "16",
			"max": "18"
		}
	],
	"section": "D",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 1045-1140"
	],
	"type": "Research",
	"year": 2016
}
