{
	"clbid": "0000105296",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"Land, Food and Justice in Biblical Traditions This section uses food as a lens for understanding the Bible, both in the context of cultures that wrote it, and in the context of contemporary discussions of sustainability. Because food is prominent in biblical narratives it is a useful interpretative lens. Biblical prophets make food central in their vindication of the poor and hungry. Biblical communities announce, debate, adjust, and renounce dietary prescriptions. Biblical texts employ similes, metaphors, and parables derived from food to advance larger points about spiritual growth or fulfillment. Guided by these considerations, we will address four main themes involving food and biblical traditions: (1) distributive food justice; (2) food production and care of the land; (3) food and just treatment of animals; and (4) food choices as religiously meaningful."
	],
	"enroll": 16,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"David Booth"
	],
	"level": 100,
	"locations": [
		"OM 310"
	],
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Title: Land, Food and Justice in Biblical Traditions"
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:45.831461+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.368981+00:00",
			"notes": null
		},
		{
			"_updated": "2016-08-06T17:00:53.075674+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:10:56.264429+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:36.340502+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.687625+00:00",
			"enroll": "16",
			"max": "18"
		}
	],
	"section": "G",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 1150-1245PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
