{
	"clbid": 105494,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"Race and Power. The presidential election of Barack Obama appeared to signal a new era of racial equality in the United States. However, race persists today as a system of power interlocked with class and gender as evidenced by the criminalization of black and brown communities and the fatal shootings of young men of color, as well as the ban on ethnic studies in Tucson, Arizona, despite the curriculum's life-changing effects in students' lives. This seminar looks at texts related to these events and others in order to understand how race continues to hold force over our social realities. Students write short essays and a research paper to strengthen their writing processes while developing analytical language to name and interrogate race in the United States."
	],
	"enroll": 14,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Jennifer Kwon Dobbs"
	],
	"level": 100,
	"locations": [
		"TOH 210"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Title: Race and Power"
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:46.126228+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:55.739383+00:00",
			"notes": null
		},
		{
			"_updated": "2016-09-03T11:31:25.775341+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:17.634008+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:36.447006+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:29.821232+00:00",
			"enroll": "14",
			"max": "18"
		}
	],
	"section": "I",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"MWF 0200-0255PM"
	],
	"type": "Research",
	"year": 2016
}
