{
	"clbid": "0000097424",
	"credits": 0.25,
	"crsid": "0000000812",
	"department": "MUSIC",
	"description": [
		"Students learn basic performance practice on core instruments in each instrument family. Additional topics include: common performance issues and their possible solution; Best Practices in teaching and learning core instruments of the family; and technology for teaching, learning, or composing for instruments as appropriate. Offered annually in the spring semester. Prerequisite: permission of instructor required for students not majoring in theory/composition or music education."
	],
	"enrolled": 15,
	"instructors": [
		"David Hagedorn"
	],
	"level": 100,
	"locations": [
		"CHM 138"
	],
	"max": 15,
	"name": "Percussion Techniques",
	"number": 167,
	"pn": false,
	"prerequisites": "permission of instructor required for students not majoring in theory/composition or music education.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.468033+00:00",
			"desc": "Students learn basic performance practice on core instruments in each instrument family. Additional topics include: common performance issues and their possible solution; Best Practices in teaching and learning core instruments of the family; and technology for teaching, learning, or composing for instruments as appropriate. Prerequisite: permission of instructor required for students not majoring in theory/composition or music education. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: permission of instructor required for students not majoring in theory/composition or music education. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:40.015039+00:00",
			"prerequisites": "Prerequisite: permission of instructor required for students not majoring in theory/composition or music education."
		},
		{
			"_updated": "2018-07-12T16:51:24.264423+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.020041+00:00",
			"enroll": "15",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2014
}
