{
	"clbid": "0000097261",
	"credits": 1.0,
	"crsid": "0000027929",
	"departments": [
		"ASIAN",
		"ENVST"
	],
	"description": [
		"Students investigate community-based approaches to environmental sustainability during thisInterim course taught at the Asian Rural Institute (ARI) in northern Japan. Students explore howARI builds on local Japanese resources to support its mission of training rural leaders fromdeveloping countries in organic agricultural practices. Activities include field trips, discussions,and symposia with Japanese students, as well as hands-on participation in the daily food life atARI. Prerequisites: preference given to students with prior coursework in either Asian Studies orEnvironmental Studies. Counts toward Asian studies and Environmental studies majors andconcentrations and Japan studies concentration. Offered during Interim."
	],
	"enroll": 20,
	"gereqs": [
		"MCG"
	],
	"instructors": [
		"Katherine S. Tegtmeyer Pak"
	],
	"level": 200,
	"max": 20,
	"name": "Env Sustainability Japan",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 277,
	"pn": false,
	"prerequisites": "Prerequisites: preference given to students with prior coursework in either Asian Studies orEnvironmental Studies. Counts toward Asian studies and Environmental studies majors andconcentrations and Japan studies concentration. Offered during Interim.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:03:57.900728+00:00",
			"desc": "Students investigate community-based approaches to environmental sustainability during this Interim course taught at the Asian Rural Institute (ARI) in northern Japan. Students explore how ARI builds on local Japanese resources to support its mission of training rural leaders from developing countries in organic agricultural practices. Activities include field trips, discussions, and symposia with Japanese students, as well as hands-on participation in the daily food life at ARI. Prerequisites: preference given to students with prior coursework in either Asian Studies or Environmental Studies. Counts toward Asian studies and Environmental studies majors and concentrations and Japan studies concentration. Offered during Interim.",
			"prerequisites": "Prerequisites: preference given to students with prior coursework in either Asian Studies or Environmental Studies. Counts toward Asian studies and Environmental studies majors and concentrations and Japan studies concentration. Offered during Interim.",
			"title": "Environmental Sustainability in Asia"
		},
		{
			"_updated": "2018-07-12T16:51:22.050091+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:15.509551+00:00",
			"enroll": "20",
			"max": "20"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20142,
	"title": "Environmental Sustainability in Japan",
	"type": "Research",
	"year": 2014
}
