{
	"clbid": "0000097735",
	"credits": 1.0,
	"crsid": "0000028198",
	"departments": [
		"PSYCH"
	],
	"description": [
		"In this course, students explore methods that psychologists use to develop meaningful, nuanced understandings of individual persons. The richness and complexity of personality is seen as students get first-hand experience interviewing a hired subject, interpreting personality tests, analyzing personal narratives, and applying theories and concepts used in personality and clinical psychology. Integrating information about unique personal history, personality dynamics, and life story, students learn to develop coherent conceptualizations of the signature-like features of another's personality. Counts toward psychology major. Prerequisite: PSYCH 230 and PSYCH 244 or permission of instructor."
	],
	"enroll": 16,
	"instructors": [
		"Donna K. McMillan"
	],
	"level": 300,
	"locations": [
		"RNS 124",
		"RNS 124"
	],
	"max": 15,
	"name": "Personality Assessment",
	"number": 344,
	"pn": false,
	"prerequisites": "PSYCH 230 and PSYCH 244 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-10-31T05:23:19.765981+00:00",
			"instructors": [
				"Donna McMillan"
			]
		},
		{
			"_updated": "2016-01-30T15:05:07.529304+00:00",
			"desc": "In this course, students explore methods that psychologists use to develop meaningful, nuanced understandings of individual persons. The richness and complexity of personality is seen as students get first-hand experience interviewing a hired subject, interpreting personality tests, analyzing personal narratives, and applying theories and concepts used in personality and clinical psychology. Integrating information about unique personal history, personality dynamics, and life story, students learn to develop coherent conceptualizations of the signature-like features of another's personality. Prerequisite: PSYCH 230 and PSYCH 244 or permission of instructor. Counts toward psychology major.",
			"prerequisites": "Prerequisite: PSYCH 230 and PSYCH 244 or permission of instructor. Counts toward psychology major."
		},
		{
			"_updated": "2017-05-30T15:51:49.822557+00:00",
			"instructors": [
				"McMillan Donna K."
			]
		},
		{
			"_updated": "2018-02-02T23:59:40.059369+00:00",
			"prerequisites": "Prerequisite: PSYCH 230 and PSYCH 244 or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:24.287684+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.046384+00:00",
			"enroll": "16",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"type": "Research",
	"year": 2014
}
