{
	"clbid": "0000097324",
	"credits": 1.0,
	"crsid": "0000000980",
	"department": "PHIL",
	"description": [
		"This course considers the relationships between moral principles, law, and the practice of governments. Topics may include the \"Just War\" debate, censorship, property rights and distributive justice, natural law, political liberalism and its critics, whether governments should act in accordance with specific moral principles or remain neutral, the tensions between individual rights and the good of the community, and the role of religion in public life. Offered most years. Prerequisite: completion of BTS-T or permission of instructor."
	],
	"enrolled": 25,
	"firstyear": "0/0",
	"gereqs": [
		"EIN"
	],
	"instructors": [
		"Michael Fuerstein"
	],
	"level": 200,
	"max": 25,
	"name": "Law,Politics,Morality",
	"notes": [
		"Prerequisite: completion of BTS-T or permission of instructor. Open only to",
		"seniors and juniors during web registration."
	],
	"number": 254,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "TOH 212",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "TOH 212",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "TOH 212",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": "completion of BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:58.111012+00:00",
			"locations": [
				"TB 227"
			]
		},
		{
			"_updated": "2016-01-30T15:05:07.398974+00:00",
			"desc": "This course considers the relationships between moral principles, law, and the practice of governments. Topics may include the \"Just War\" debate, censorship, property rights and distributive justice, natural law, political liberalism and its critics, whether governments should act in accordance with specific moral principles or remain neutral, the tensions between individual rights and the good of the community, and the role of religion in public life. Prerequisite: completion of BTS-T or permission of instructor. Offered most years.",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor. Offered most years."
		},
		{
			"_updated": "2018-02-02T23:59:39.972657+00:00",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:24.228651+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.979476+00:00",
			"enroll": "25",
			"max": "25"
		},
		{
			"_updated": "2018-11-02T04:18:24.869634+00:00",
			"firstyear": null,
			"sophomore": null
		}
	],
	"semester": 3,
	"sophomore": "0/0",
	"status": "C",
	"term": 20143,
	"title": "Law, Politics, and Morality",
	"type": "Research",
	"year": 2014
}
