{
	"clbid": 97300,
	"credits": 1.0,
	"crsid": 24127,
	"departments": [
		"CSCI"
	],
	"description": [
		"This course focuses on handling data: visualization, finding patterns, and communicating with data. The primary tools are Python (for transforming data) and R (for visualization and classification). Students work individually and in teams to apply basic principles and explore real-world datasets with a sustainability theme. Counts toward statistics and mathematical biology concentrations. One of CSCI 121, CSCI 125, or CSCI 251 counts toward linguistic studies concentration. Offered each semester. Prerequisite: calculus or consent of the instructor."
	],
	"gereqs": [
		"AQR"
	],
	"instructors": [
		"Olaf A. Hall-Holt"
	],
	"level": 100,
	"locations": [
		"RNS 203"
	],
	"name": "Comp Sci for Science/Math",
	"number": 125,
	"pn": false,
	"prerequisites": "Prerequisite: calculus or consent of the instructor.",
	"revisions": [
		{
			"locations": null
		},
		{
			"_updated": "2016-01-30T15:05:07.375753+00:00",
			"desc": "This course focuses on handling data: visualization, finding patterns, and communicating with data. The primary tools are Python (for transforming data) and R (for visualization and classification). Students work individually and in teams to apply basic principles and explore real-world datasets with a sustainability theme. Prerequisite: calculus or consent of the instructor. Counts toward statistics and mathematical biology concentrations. One of CSCI 121, CSCI 125, CSCI 251counts toward linguistic studies concentration. Offered each semester.",
			"prerequisites": "Prerequisite: calculus or consent of the instructor. Counts toward statistics and mathematical biology concentrations. One of CSCI 121, CSCI 125, CSCI 251counts toward linguistic studies concentration. Offered each semester."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1045-1140"
	],
	"title": "Computer Science for Scientists and Mathematicians",
	"type": "Research",
	"year": 2014
}
