{
	"clbid": "0000097814",
	"credits": 1.0,
	"crsid": "0000028122",
	"department": "ENGL",
	"description": [
		"Heroes, monsters, battles, and journeys - for over a thousand years, elements of epic poetry shaped ideas of what a good story should be. But with the modern age, the novel replaced epic as the most culturally revered literary form. Students explore how the novel draws upon as well as rejects the epic tradition, and how the novel reflects what wemean by \"modernity\" itself. This course ranges from Anglo-Saxon epic to modern and contemporary novels. Counts toward English major. Offered in alternate years during spring semester. Prerequisite:FYW."
	],
	"enrolled": 25,
	"gereqs": [
		"ALS-L"
	],
	"instructors": [
		"Mary E. Trull"
	],
	"level": 200,
	"max": 30,
	"name": "Epic and the Novel",
	"number": 284,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "RML 515",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "RML 515",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "RML 515",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisite:FYW.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.534284+00:00",
			"desc": "Heroes, monsters, battles, and journeys - for over a thousand years, elements of epic poetry shaped ideas of what a good story should be. But with the modern age, the novel replaced epic as the most culturally revered literary form. Students explore how the novel draws upon as well as rejects the epic tradition, and how the novel reflects what we mean by \"modernity\" itself. This course ranges from Anglo-Saxon epic to modern and contemporary novels. Prerequisite: FYW. Counts toward English major. Offered in alternate years during spring semester.",
			"prerequisites": "Prerequisite: FYW. Counts toward English major. Offered in alternate years during spring semester."
		},
		{
			"_updated": "2018-07-12T16:51:24.290090+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.049358+00:00",
			"enroll": "25",
			"max": "30"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"type": "Research",
	"year": 2014
}
