{
	"clbid": "0000097200",
	"credits": 1.0,
	"crsid": "0000023234",
	"department": "REL",
	"description": [
		"This course studies the historical, geographical, and cultural background of Judaism and Christianity, focusing on major biblical sites in the Holy Land. Through the intersection oftextual study, archaeology, and history, students explore biblical events from the time of Israel'sancestors to Jesus and the early church in, for example, Jerusalem, Galilee, and Jordan.The course also examines the history of conflict among Jews, Christians, and Muslims over themeaning and possession of the land. Prerequisite: BTS-B. Offered alternate years duringInterim. Counts toward ancient studies major."
	],
	"enrolled": 25,
	"firstyear": "0/0",
	"gereqs": [
		"HWC"
	],
	"instructors": [
		"James Hanson"
	],
	"level": 200,
	"max": 24,
	"name": "The Bible in Context",
	"notes": [
		"Full course title: The Bible in Context: History, Geography, and Culture in",
		"Israel and Palestine. This is an off-campus course. You will find this course",
		"listed in Studio Abroad under its course title."
	],
	"number": 271,
	"pn": false,
	"prerequisites": "BTS-B. Offered alternate years duringInterim. Counts toward ancient studies major.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:03:57.896559+00:00",
			"desc": "This course studies the historical, geographical, and cultural background of Judaism and Christianity, focusing on major biblical sites in the Holy Land. Through the intersection of textual study, archaeology, and history, students explore biblical events from the time of Israel's ancestors to Jesus and the early church in, for example, Jerusalem, Galilee, and Jordan. The course also examines the history of conflict among Jews, Christians, and Muslims over the meaning and possession of the land. Prerequisite: BTS-B. Offered alternate years during Interim. Counts toward ancient studies major.",
			"prerequisites": "Prerequisite: BTS-B. Offered alternate years during Interim. Counts toward ancient studies major.",
			"title": "Bible in Context: History, Geography, & Culture in Israel & Palestine"
		},
		{
			"_updated": "2018-02-02T23:58:55.706963+00:00",
			"prerequisites": "Prerequisite: BTS-B. Offered alternate years duringInterim. Counts toward ancient studies major."
		},
		{
			"_updated": "2018-07-12T16:51:22.045854+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:15.506471+00:00",
			"enroll": "25",
			"max": "24"
		},
		{
			"_updated": "2018-11-02T04:18:21.589250+00:00",
			"firstyear": null
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20142,
	"title": "Bible in Context: History/Geography/Culture in Israel & Palestine",
	"type": "Research",
	"year": 2014
}
