{
	"clbid": "0000097328",
	"credits": 1.0,
	"crsid": "0000001180",
	"department": "PSYCH",
	"description": [
		"With recent advances in neuroscience, we can now describe the biological correlates of many psychological disorders, including schizophrenia, depression and anxiety disorders. In this discussion-based course, students use published research findings to examine the connections between the symptoms of these pathologies and changes in brain neurobiology, biochemistry, and physiology. Offered alternate years. Counts toward neuroscience concentration. Prerequisites: PSYCH 230, PSYCH 247, plus PSYCH 238 or NEURO 239."
	],
	"enroll": 17,
	"instructors": [
		"Shelly D. Dickinson"
	],
	"level": 300,
	"locations": [
		"RNS 208",
		"RNS 208"
	],
	"max": 15,
	"name": "Neurobio/Psychopathol",
	"number": 338,
	"pn": false,
	"prerequisites": "Prerequisites: PSYCH 230, PSYCH 247, plus PSYCH 238 or NEURO 239.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.405852+00:00",
			"desc": "With recent advances in neuroscience, we can now describe the biological correlates of many psychological disorders, including schizophrenia, depression and anxiety disorders. In this discussion-based course, students use published research findings to examine the connections between the symptoms of these pathologies and changes in brain neurobiology, biochemistry, and physiology. Prerequisites: PSYCH 230, PSYCH 247, plus PSYCH 238 or NEURO 239. Offered alternate years. Counts toward neuroscience concentration.",
			"prerequisites": "Prerequisites: PSYCH 230, PSYCH 247, plus PSYCH 238 or NEURO 239. Offered alternate years. Counts toward neuroscience concentration."
		},
		{
			"_updated": "2018-07-12T16:51:24.232948+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.983412+00:00",
			"enroll": "17",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Neurobiology of Psychopathology",
	"type": "Research",
	"year": 2014
}
