{
	"clbid": 97274,
	"credits": 1.0,
	"crsid": 18782,
	"departments": [
		"ENVST"
	],
	"description": [
		"EnvSt 381 Contested Spaces (ARTS/HUMANITIES)- Mark Allister This course will cover basic hydrological concepts within the context of water resources management and anthropogenic impacts on water quantity and quality. It will include an introduction to the basic physical principles of the hydrologic cycle including precipitation, snowmelt, infiltration, evapotranspiration, soil water storage, surface and subsurface flow to streams, groundwater and stream flow. The course will be a combination of lecture, discussion, mathematical models, and hands-on measurement of hydrological processes. Examples of models we will cover include instream flow, habitat, and water quality. Students aim to understand an \"integral ecology\" that might reveal all that is at stake in a contested environmental space."
	],
	"enroll": 10,
	"instructors": [
		"Kyle A. Whittinghill"
	],
	"level": 300,
	"locations": [
		"RNS 400",
		"RNS 400"
	],
	"max": 12,
	"name": "Top: Hydrology",
	"number": 381,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:58.072239+00:00",
			"locations": [
				"RNS 316",
				"RNS 316"
			]
		},
		{
			"_updated": "2016-01-30T15:05:07.359049+00:00",
			"desc": "EnvSt 381 Contested Spaces (ARTS/HUMANITIES)- Mark Allister An environmental matter. An impasse. One side wants conservation of habitat and sustainable practices. The other side frames the situation through the lens of jobs and autonomy from government regulation . Why do so many sites and practices become environmentally contested spaces? How do we begin to resolve such impasses? Most work in environmental studies -- and nearly all that is natural science and social science based -- focuses on exterior or objective perspectives, examining structures such as individual subjects or ecosystems or political and economic systems. This seminar will consider contested spaces and the values that underlie arguments about such spaces by also focusing on interior perspectives, the role of emotion, beauty, ideas about the self, cultural mores, and so for th. Students aim to understand an \"integral ecology\" that might reveal all that is at stake in a contested environmental space."
		},
		{
			"_updated": "2018-07-12T16:51:24.206647+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.953553+00:00",
			"enroll": "10",
			"max": "12"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"T 0120-0450PM",
		"Th 0215-0335PM"
	],
	"title": "Advanced Research Topics in Environmental Studies",
	"type": "Topic",
	"year": 2014
}
