{
	"clbid": "0000097712",
	"credits": 1.0,
	"crsid": "0000000452",
	"departments": [
		"ENGL"
	],
	"description": [
		"In this seminar, students learn about a range of methods for literary research by exploring literature in the context of critical, theoretical, cultural, or historical materials. For each student, the centerpiece of the course is the research and writing of along essay that represents his or her individual research interests. Students share and respond to each other's work-in-progress and present their completed projects to the seminar. May be repeated if topics are different. Prerequisites: Open to juniors and seniors who have completed ENGL 185 and at least two level II English courses or by permission of the instructor."
	],
	"enroll": 14,
	"instructors": [
		"Rebecca S. Richards"
	],
	"level": 300,
	"locations": [
		"BMC 012"
	],
	"max": 15,
	"name": "Sem: Rhetoric/Writing",
	"number": 399,
	"pn": false,
	"prerequisites": "Prerequisites: Open to juniors and seniors who have completed ENGL 185 and at least two level II English courses or by permission of the instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.527671+00:00",
			"desc": "In this seminar, students learn about a range of methods for literary research by exploring literature in the context of critical, theoretical, cultural, or historical materials. For each student, the centerpiece of the course is the research and writing of a long essay that represents his or her individual research interests. Students share and respond to each other's work-in-progress and present their completed projects to the seminar. May be repeated if topics are different. Prerequisites: Open to rising juniors and seniors who have completed ENGL 185 and at least two level II English courses or by permission of the instructor.",
			"prerequisites": "Prerequisites: Open to rising juniors and seniors who have completed ENGL 185 and at least two level II English courses or by permission of the instructor."
		},
		{
			"_updated": "2018-07-12T16:51:24.286920+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.045435+00:00",
			"enroll": "14",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1045-1140"
	],
	"title": "The Major Seminar",
	"type": "Seminar",
	"year": 2014
}
