{
	"clbid": 97295,
	"credits": 1.0,
	"crsid": 1398,
	"departments": [
		"THEAT"
	],
	"description": [
		"An in-depth investigation of a selected topic through readings, bibliography, reports and projects. Students may register for the course more than once, provided a different topic is studied. Offered annually. Prerequisite: THEAT 110 or THEAT 180. Some topics courses may require additional prerequisites. Please inquire in the Theater Department office before registering."
	],
	"enroll": 25,
	"instructors": [
		"Gary C. Gisselman"
	],
	"level": 300,
	"locations": [
		"RNS 410"
	],
	"max": 18,
	"name": "Top: Musical Theater",
	"number": 379,
	"pn": false,
	"prerequisites": "THEAT 110 or THEAT 180. Some topics courses may require additional prerequisites. Please inquire in the Theater Department office before registering.",
	"revisions": [
		{
			"locations": [
				"RNS 208"
			]
		},
		{
			"_updated": "2016-01-30T15:05:07.369568+00:00",
			"desc": "An in-depth investigation of a selected topic through readings, bibliography, reports and projects. Students may register for the course more than once, provided a different topic is studied. Prerequisite: THEAT 110 or THEAT 180. Some topics courses may require additional prerequisites. Please inquire in the Theater Department office before registering. Offered annually.",
			"prerequisites": "Prerequisite: THEAT 110 or THEAT 180. Some topics courses may require additional prerequisites. Please inquire in the Theater Department office before registering. Offered annually."
		},
		{
			"_updated": "2018-02-02T23:59:39.950807+00:00",
			"prerequisites": "Prerequisite: THEAT 110 or THEAT 180. Some topics courses may require additional prerequisites. Please inquire in the Theater Department office before registering."
		},
		{
			"_updated": "2018-07-12T16:51:24.210854+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.958490+00:00",
			"enroll": "25",
			"max": "18"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Topics in Interpretation and Theater",
	"type": "Topic",
	"year": 2014
}
