{
	"clbid": 97228,
	"credits": 1.0,
	"crsid": 25601,
	"departments": [
		"ART"
	],
	"description": [
		"This course explores in depth the issues most crucial to artists working today in an increasingly globalized art scene. Students investigate the complexities of new media, new methods of production and exhibition, and theoretical models through readings and a required field trip to a contemporary art museum. Students analyze both journalistic criticism and theoretical texts, encompassing a wide variety of perspectives, and respond through short writing assignments and classroom discussion. Fee for field trip may be required. Offered alternate years. Prerequisite: at least one art history or studio art course, or permission of the instructor."
	],
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Christopher Tradowsky"
	],
	"level": 200,
	"locations": [
		"CAD 204"
	],
	"name": "Art Now",
	"number": 280,
	"pn": false,
	"prerequisites": "Prerequisite: at least one art history or studio art course, or permission of the instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:58.052930+00:00",
			"gereqs": null
		},
		{
			"_updated": "2016-01-30T15:05:07.339060+00:00",
			"desc": "This course explores in depth the issues most crucial to artists working today in an increasingly globalized art scene. Students investigate the complexities of new media, new methods of production and exhibition, and theoretical models through readings and a required field trip to a contemporary art museum. Students analyze both journalistic criticism and theoretical texts, encompassing a wide variety of perspectives, and respond through short writing assignments and classroom discussion. Fee for field trip may be required. Prerequisite: at least one art history or studio art course, or permission of the instructor. Offered alternate years.",
			"prerequisites": "Prerequisite: at least one art history or studio art course, or permission of the instructor. Offered alternate years."
		},
		{
			"_updated": "2017-05-30T15:51:49.767109+00:00",
			"locations": [
				"DC 204"
			]
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MWF 0200-0255PM"
	],
	"title": "Art Now: Critical Issues in Contemporary Art",
	"type": "Research",
	"year": 2014
}
