{
	"clbid": "0000097195",
	"credits": 1.0,
	"crsid": "0000001174",
	"department": "PSYCH",
	"description": [
		"This course investigates the human relationship with the natural world, examining ways in which the natural environment is important psychologically to human beings. Integrating aspects of theoretical and empirical psychology, environmental studies and literature, we explore meanings, values, and questions such as: How are we affected by nature? What affects people's attitudes and behaviors toward the environment? How do we respond to environmental challenges? How does the field of psychology address the natural world? Prerequisite: PSYCH 125 or ENVST 137. Offered during Interim. Counts toward American studies major and environmental studies major (all tracks) and concentration."
	],
	"enrolled": 20,
	"gereqs": [
		"HBS"
	],
	"instructors": [
		"Donna K. McMillan"
	],
	"level": 200,
	"max": 20,
	"name": "Envtal Psych/Rocky Mtns",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 227,
	"pn": false,
	"prerequisites": "PSYCH 125 or ENVST 137. Offered during Interim. Counts toward American studies major and environmental studies major (all tracks) and concentration.",
	"revisions": [
		{
			"_updated": "2015-10-31T05:23:06.154207+00:00",
			"instructors": [
				"Donna McMillan"
			]
		},
		{
			"_updated": "2017-05-30T15:40:53.730409+00:00",
			"instructors": [
				"McMillan Donna K."
			]
		},
		{
			"_updated": "2018-02-02T23:58:55.703022+00:00",
			"prerequisites": "Prerequisite: PSYCH 125 or ENVST 137. Offered during Interim. Counts toward American studies major and environmental studies major (all tracks) and concentration."
		},
		{
			"_updated": "2018-07-12T16:51:22.038299+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:15.501122+00:00",
			"enroll": "20",
			"max": "20"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20142,
	"title": "Environmental Psychology at Rocky Mountain National Park",
	"type": "Research",
	"year": 2014
}
