{
	"clbid": "0000097041",
	"credits": 1.0,
	"crsid": "0000000632",
	"department": "HIST",
	"description": [
		"This seminar covers various topics in modern European history, depending upon the instructor. Recent topics have included \"Gender and the Enlightenment,\" \"The Holocaust and History,\" \"Race, Gender, and Medicine,\" and \"Nation and Empire in Russian History.\" May be repeated if topics are different. Offered most years. Prerequisites for certain offerings."
	],
	"enrolled": 17,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Anna Kuxhausen"
	],
	"level": 300,
	"max": 17,
	"name": "Sem: Nation/Emp Russ Hist",
	"notes": [
		"Especially for junior and senior history and Russian studies majors.",
		"Others need permission of instructor."
	],
	"number": 320,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "OM 140",
			"start": "09:05"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "OM 140",
			"start": "09:05"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "OM 140",
			"start": "09:05"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites for certain offerings.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:58.037799+00:00",
			"locations": [
				"OM 210"
			]
		},
		{
			"_updated": "2016-01-30T15:05:07.322217+00:00",
			"desc": "This upper-level Russian history seminar focuses on the themes of national identity, ethnicity, and imperial rule in modern Russian history. Multi-ethnic peoples have always populated the massive geographic area that comes to be known as \"Russia.\" How did the state at various times in history seek to integrate, assimilate or rule over ethnic and religious minorities? What were the strategies and practices of imperial rule under the Romanov monarchy? How and why did policies of assimilation alternate with policies of tolerance, and why were these policies unevenly applied? How did the Soviet project define national identity? We will consider these questions over a broad sweep of history with the goal of identifying analytical categories and models that are appropriate to the Russian context. The course will also introduce key theoretical texts on national identity and imperialism. We will interrogate these theories and test them against the Russian version of colonial rule - a colonialism that differed from European models yet, some would argue, has persisted to this day. Finally, we will consider (to the extent possible) the perspective of colonized peoples and what an alternative narrative history of Russian expansion might look like \"from below.\"",
			"prerequisites": false,
			"title": "Nation and Empire in Russian History"
		},
		{
			"_updated": "2018-07-12T16:51:24.188892+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.932653+00:00",
			"enroll": "17",
			"max": "17"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"title": "Seminar: Modern Europe",
	"type": "Seminar",
	"year": 2014
}
