{
	"clbid": 102216,
	"credits": 1.0,
	"crsid": 18778,
	"departments": [
		"ENVST"
	],
	"description": [
		"No creature quite captures the imagination as profoundly as the elephant -- charismatic, mysterious, the largest land mammal on earth. From deployments in war to representations in spirituality, from wild herds to circus spectacles, from complex emotional intelligence to the ivory trade, interactions with elephant life have shaped what it means to be human in intricate, wondrous, tragic, violent, and often unexamined ways. This arts and humanities emphasis course seeks to interrogate assumptions about nature and culture, humanity and animality, companionship and exploitation, intelligence and compassion, violence and ecological justice. We do so by journeying through the entangled lives of humans and elephants in biology, history, cultural representation, psychology, and contemporary conservation efforts. We might very well ask, as Caitrin Nicol Keiper does in a recent essay interrogating our \"elephantasies,\" \u0093Whether there are millions or just one, what does it mean that there is such a thing as Elephant?"
	],
	"instructors": [
		"Jacob J. Erickson"
	],
	"level": 200,
	"locations": [
		"RNS 297",
		"RNS 297"
	],
	"name": "Top: The Culture of Elephants",
	"number": 281,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.628595+00:00",
			"locations": [
				"HH 516",
				"HH 516"
			],
			"section": "A"
		},
		{
			"_updated": "2015-04-21T23:00:30.779781+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-11-12T00:01:26.725168+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.651984+00:00",
			"desc": "Students study topics related to the environment. Topics vary from year to year at the discretion of the instructor. Topics may include Environment and Theology, Environmental Justice, Ecotourism, and Literature of the Poles. Class is largely discussion-based but may include a lab/fieldwork component depending on the topic. May be repeated if topics are different. Offered annually."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Topics in Environmental Studies",
	"type": "Topic",
	"year": 2015
}
