{
	"clbid": 102955,
	"credits": 1.0,
	"crsid": 268,
	"departments": [
		"ECON"
	],
	"description": [
		"Students in this course learn and apply economic analysis, tempered by an appreciation for the political and institutional contexts of the less developed countries, to gain an understanding of these countries' economies. Using cases involving both written and oral analysis, students explore topics such as economic growth in Brazil, trade strategies in Singapore, poverty and income distribution in Taiwan, or macroeconomic performance in Mexico. Offered annually. Counts toward environmental studies major (social science emphasis) and Latin American studies major and concentration. Prerequisite: one of Economics 110-121 or permission of instructor."
	],
	"gereqs": [
		"MCG",
		"WRI"
	],
	"instructors": [
		"Seth Binder"
	],
	"level": 200,
	"locations": [
		"RNS 206"
	],
	"name": "Economic Development",
	"number": 243,
	"pn": false,
	"prerequisites": "Prerequisite: one of Economics 110-121 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.723243+00:00",
			"locations": [
				"HH 302"
			]
		},
		{
			"_updated": "2015-04-20T17:00:30.526418+00:00",
			"gereqs": [
				"MCG"
			]
		},
		{
			"_updated": "2015-04-20T23:00:31.540098+00:00",
			"locations": [
				"OM 030"
			]
		},
		{
			"_updated": "2015-05-01T05:00:44.875579+00:00",
			"locations": [
				"RNS 210"
			]
		},
		{
			"_updated": "2015-10-19T23:03:40.528868+00:00",
			"locations": [
				"RNS 208"
			]
		},
		{
			"_updated": "2015-11-12T00:01:27.228206+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.722985+00:00",
			"desc": "Students in this course learn and apply economic analysis, tempered by an appreciation for the political and institutional contexts of the less developed countries, to gain an understanding of these countries' economies. Using cases involving both written and oral analysis, students explore topics such as economic growth in Brazil, trade strategies in Singapore, poverty and income distribution in Taiwan, or macroeconomic performance in Mexico. Offered annually. Counts toward environmental studies major (social science track) and Latin American studies major and concentration. Prerequisite: one of Economics 110-121 or permission of instructor."
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2015
}
