{
	"clbid": 102798,
	"credits": 1.0,
	"crsid": 2270,
	"departments": [
		"PSCI"
	],
	"description": [
		"Students examine the antecedents and collapse of the Cold War division of Europe, the growth of the European Economic Community, and its transformation into the European Union as Western European phenomena. The course also focuses on the working of European Union institutions and consideration of theories of integration. The course ends with the post-communist transformation of 2004 and 2007 entrants and their experience following accession. Prerequisite: PSCI 220 and at least one course in the subfield or permission of instructor."
	],
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"J. Patrick Dale"
	],
	"level": 300,
	"locations": [
		"HH 514"
	],
	"name": "Sem: Becoming European",
	"notes": [
		"Only open to rising seniors during web registration.",
		"Rising juniors may add on a space available basis during the drop/add period."
	],
	"number": 385,
	"pn": false,
	"prerequisites": "Prerequisite: PSCI 220 and at least one course in the subfield or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.768545+00:00",
			"locations": [
				"OM 110"
			]
		},
		{
			"_updated": "2015-04-16T18:38:45.529511+00:00",
			"notes": null
		},
		{
			"_updated": "2016-01-30T14:55:51.501762+00:00",
			"desc": "Students examine the antecedents and collapse of the Cold War division of Europe, the growth of the European Economic Community, and its transformation into the European Union as Western European phenomena. The course also focuses on the working of European Union institutions and consideration of theories of integration. The course ends with the post-communist transformation of 2004 and 2007 entrants and their experience following accession. Prerequisite: PSCI 220 and at least one comparative politics course or permission of instructor.",
			"prerequisites": "Prerequisite: PSCI 220 and at least one comparative politics course or permission of instructor.",
			"title": "Becoming European: Central Europe's Entry into the European Union"
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20151,
	"times": [
		"MWF 0200-0255PM"
	],
	"title": "Seminar: Becoming European: Central Europe's Entry into the European U",
	"type": "Seminar",
	"year": 2015
}
