{
	"clbid": 102963,
	"credits": 1.0,
	"crsid": 280,
	"depts": [
		"ECON"
	],
	"desc": "What do workers want from work? What do employers want from workers? Pressing policy issues exist for workers competing in the global economy. Unions, unemployment insurance, welfare and the minimum wage enhance the prospects of many, while leaving others even worse off. This course utilizes microeconomic theory, statistics and institutional analysis to understand labor markets. Offered annually. Counts toward American studies major. Prerequisites: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor.",
	"gereqs": [
		"EIN",
		"WRI"
	],
	"instructors": [
		"Mark Pernecky"
	],
	"level": 300,
	"locations": [
		"OM 240"
	],
	"name": "Labor Econ & Employment Relations",
	"notes": "Open only to seniors during web registration.",
	"num": 376,
	"pf": false,
	"prerequisites": "Prerequisites: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-25T23:19:14.395993-05:00",
			"gereqs": [
				"EIN"
			],
			"name": "Labor Econ/Empl Rel"
		},
		{
			"_updated": "2015-09-30T00:01:43.105354-05:00",
			"locations": [
				"HH 302"
			]
		},
		{
			"_updated": "2016-01-30T08:55:44.746250-06:00",
			"desc": "What do workers want from work? What do employers want from workers? Pressing policy issues exist for workers competing in the global economy. Unions, unemployment insurance, welfare and the minimum wage enhance the prospects of many, while leaving others even worse off. This course utilizes microeconomic theory, statistics and institutional analysis to understand labor markets. Offered most years. Counts towards American studies major. Prerequisites: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor."
		},
		{
			"_updated": "2016-02-10T00:00:54.328291-06:00",
			"status": "O"
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0200-0255PM"
	],
	"title": "Labor Economics and Employment Relations",
	"type": "Research",
	"year": 2015
}
