{
	"clbid": 102044,
	"credits": 1.0,
	"crsid": 1158,
	"depts": [
		"PSYCH"
	],
	"desc": "This course prepares the student with tools for understanding how research studies in psychology are conceptualized, designed, carried out, interpreted, and disseminated to the public. Use of library and Internet resources, ethical guidelines in the conduct of research and the skills of good scientific writing are emphasized. Students work independently and in small groups to design and conduct their own research projects. The course includes lecture and laboratory work. Offered each semester. Counts toward environmental studies major (social science emphasis), exercise science major, and statistics concentration. Prerequisites: PSYCH 125, and STAT 110 or STAT 212 or STAT 214 or ECON 263.",
	"gereqs": [
		"WRI"
	],
	"groupid": 1158,
	"grouptype": "1",
	"instructors": [
		"Grace E. Cho"
	],
	"level": 200,
	"locations": [
		"RNS 131"
	],
	"name": "Research Methods",
	"notes": "Students in Psych 230A must also register for lab Psych 230 AL. This course has an Academic Civic Engagement Component (ACE).",
	"num": 230,
	"pf": false,
	"prerequisites": "Prerequisites: PSYCH 125, and STAT 110 or STAT 212 or STAT 214 or ECON 263.",
	"revisions": [
		{
			"_updated": "2015-03-10T17:02:49.753203-05:00",
			"notes": "Students in Psych 230 must also register for onr lab Psych 230 AL or BL."
		},
		{
			"_updated": "2015-04-07T16:54:39.423663-05:00",
			"locations": [
				"RNS 390"
			]
		},
		{
			"_updated": "2015-04-28T18:00:24.453737-05:00",
			"grouptype": null,
			"notes": "Students in Psych 230 must also register for one lab Psych 230 AL or BL."
		},
		{
			"_updated": "2015-11-06T00:01:43.896206-06:00",
			"notes": "Students in Psych 230 must also register for lab Psych 230 AL."
		},
		{
			"_updated": "2015-11-11T18:01:25.500945-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:44.459503-06:00",
			"desc": "This course prepares the student with tools for understanding how research studies in psychology are conceptualized, designed, carried out, interpreted, and disseminated to the public. Use of library and Internet resources, ethical guidelines in the conduct of research and the skills of good scientific writing are emphasized. Students work independently and in small groups to design and conduct their own research projects. The course includes lecture and laboratory work. Offered each semester. Counts toward environmental studies major (social science track) and statistics concentration. Prerequisites: PSYCH 125, and STAT 110 or STAT 212 or STAT 214 or ECON 263."
		},
		{
			"_updated": "2016-03-15T12:01:47.034968-05:00",
			"notes": "Students in Psych 230A must also register for lab Psych 230 AL."
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0905-1000"
	],
	"title": "Research Methods in Psychology",
	"type": "Research",
	"year": 2015
}
