{
	"clbid": "0000102073",
	"credits": 1.0,
	"crsid": "0000000638",
	"department": "HIST",
	"description": [
		"This seminar covers varying topics in American history, depending upon the instructor. Recent topics have included \"Lincoln and his America,\" \"The American Revolution,\" and \"19th-Century American Political Culture.\" May be repeated if topic is different. Offered most years. Counts toward American studies major."
	],
	"enrolled": 18,
	"firstyear": "0/0",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Steven C. Hahn"
	],
	"level": 300,
	"max": 17,
	"name": "Sem: American Rev",
	"notes": [
		"Especially for junior and senior history and American studies majors.",
		"Others need permission of instructor."
	],
	"number": 370,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "BMC 012",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "BMC 012",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.454966+00:00",
			"locations": [
				"HH 515",
				"HH 515"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.485310+00:00",
			"desc": "370A American Revolution: History and Historians - Professor Hahn - Many American historians would argue that the American Revolution was the defining event in United States history. Take away the colonists' rebellion and hard-fought separation from Great Britain and what is left is a country devoid of much of its political and cultural character. The problem, as John Adams recognized, is that the Revolution, then as now, meant different things to different people, making it a difficult subject about which to write. As a result, generations of historians have interpreted the origins and consequences of the Revolution in a variety of creative and contradictory ways. The aim of this course is not only to examine the American Revolution's key events, but also to explore the various interpretations of its origins and consequences. Students will read from a diverse body of literature derived from several scholarly traditions, addressing questions such as: How radical was the revolution? Who made the Revolution happen? Who benefited most? Why did some refuse to support it? Why 1776? As we will see, the debates surrounding such questions remain heated and contested to this day, proof positive of the Revolution's enduring legacy. What we may find is that the Revolution's final chapter, in some sense, has yet to be written.\n****************************************************************************************************\n370B Civil Rights - Professor Fitzgerald - From Segregation to Civil Rights, this course examines the scholarly literature on the origins and outcome of the Civil Rights movement, basically 1900 to the 1970s, from the origins of Jim Crow to its overthrow. The primary focus will be on the South, and how southern racial issues played out before the nation and the world, particularly via the media. The class will culminate with an original research paper drawing on the range of primary sources available. Relevant coursework on African-American history, the Civil War era, recent US history, or lynching is strongly recommended.",
			"title": "370 American History"
		},
		{
			"_updated": "2016-02-02T03:45:40.806185+00:00",
			"status": "O"
		},
		{
			"_updated": "2018-07-12T16:51:32.099023+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.114693+00:00",
			"enroll": "18",
			"max": "17"
		},
		{
			"_updated": "2018-11-02T04:18:32.004016+00:00",
			"firstyear": null
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"title": "American Seminar",
	"type": "Seminar",
	"year": 2015
}
