{
	"clbid": 102215,
	"credits": 1.0,
	"crsid": 20072,
	"departments": [
		"WRIT"
	],
	"description": [
		"Science in World and Word is a blended reading seminar and writing workshop that explores science, technology, and the environment. Students read and respond critically and creatively to essays and creative writing in contemporary books and magazines including Best American Science and Nature Writing and The New York Times. Daily writing practice emphasizes audience awareness, research, and text/image relationships as we work to develop clarity and style in several genres."
	],
	"enroll": 16,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Diane C. LeBlanc"
	],
	"level": 200,
	"locations": [
		"TOH 108"
	],
	"max": 15,
	"name": "Top: Sci in World & Word",
	"notes": [
		"Prerequisite: completion of FYW requirement."
	],
	"number": 211,
	"pn": false,
	"prerequisites": "completion of FYW requirement.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.626466+00:00",
			"locations": [
				"RML 421"
			]
		},
		{
			"_updated": "2015-04-28T23:00:25.752015+00:00",
			"locations": [
				"TOH 200"
			]
		},
		{
			"_updated": "2015-11-12T00:01:26.718140+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.650085+00:00",
			"desc": "Blending the reading seminar and writing workshop, this course offers advanced practice in critical reading and writing with emphasis on a particular discipline or topic. Students will read and respond critically to a range of writing that may include textbook chapters, popular feature stories, and creative literature. The course emphasizes how writers use common rhetorical strategies, such as making and supporting claims, integrating research, and narrating to communicate effectively in a variety of genres for multiple audiences. Click on course title in the class and lab for more information about the course for that term. Prequisite: successful completion of FYW."
		},
		{
			"_updated": "2018-02-03T00:01:10.027307+00:00",
			"prerequisites": "Prerequisite: completion of FYW requirement."
		},
		{
			"_updated": "2018-07-12T16:51:32.171467+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.206592+00:00",
			"enroll": "16",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Topics in Writing",
	"type": "Topic",
	"year": 2015
}
