{
	"clbid": 102040,
	"credits": 1.0,
	"crsid": 1365,
	"depts": [
		"SWRK"
	],
	"desc": "Social work majors study scientific philosophies and approaches to ethical knowledge building for social work practice. The course includes an overview of the research process using both quantitative and qualitative methods with special attention to how research knowledge informs generalist social work practice. Students apply course concepts in the field through an academic civic engagement component. Open only to social work majors. Offered annually in the spring semester. Counts toward management studies concentration.",
	"instructors": [
		"Susan E. Smalling"
	],
	"level": 200,
	"locations": [
		"OM 030",
		"OM 030"
	],
	"name": "Res Methods/Social Work",
	"notes": "This course is open only to Junior Social Work majors.",
	"num": 274,
	"pf": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-09T13:41:50.641706-05:00",
			"locations": [
				"HH 317",
				"HH 317"
			]
		},
		{
			"_updated": "2015-09-29T18:01:22.603214-05:00",
			"notes": "This course is open to Social Work majors only. This course has class-year limits."
		},
		{
			"_updated": "2015-11-19T18:01:16.873872-06:00",
			"locations": [
				"RML 420",
				"RML 420"
			]
		},
		{
			"_updated": "2016-01-30T08:55:44.448865-06:00",
			"desc": "Social work majors study scientific philosophies and approaches to ethical knowledge building for social work practice. The course includes an overview of the research process using both quantitative and qualitative methods with special attention to how research knowledge informs generalist social work practice. Students apply course concepts in the field through an academic civic engagement component. Open only to social work majors. Offered annually in the spring semester."
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"title": "Research Methods in Social Work",
	"type": "Research",
	"year": 2015
}
