{
	"clbid": 102117,
	"credits": 1.0,
	"crsid": 1363,
	"departments": [
		"SWRK"
	],
	"description": [
		"Social welfare policies exemplify how society's values and needs translate into policies and programs. Social workers create, implement, and evaluate policies in health, employment, housing, and child welfare. Students study policy formation and analysis that reflect interests and powers of diverse groups as well as economic and social realities of certain populations at risk of poverty and discriminiation. The course emphasizes policy impact on women, people in poverty, African-Americans, gay men and lesbians, and Latinos, and empowerment in policy practice. Open to non-majors by permission of instructor. Offered annually in the spring semester. Counts toward American studies major, biomedical studies concentration (for students through class of 2016), and management studies concentration."
	],
	"instructors": [
		"Mary Carlsen"
	],
	"level": 200,
	"locations": [
		"CHM 239"
	],
	"name": "Social Policy",
	"notes": [
		"This course has class year limits. Not open to First-Year Students."
	],
	"number": 258,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.498437+00:00",
			"locations": [
				"HH 307"
			]
		},
		{
			"_updated": "2015-05-01T05:00:41.253439+00:00",
			"locations": [
				"RNS 208"
			]
		},
		{
			"_updated": "2016-01-30T14:51:20.021853+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.539145+00:00",
			"desc": "Immigration policy and welfare reform exemplify how society's values and needs translate into policies and programs. Social workers create, implement, and evaluate policies in health, employment, housing, and child welfare. Students study policy formation and analysis that reflect interests and powers of diverse groups as well as economic and social realities of certain populations at risk. The course emphasizes policy impact on women, people in poverty, African-Americans, gay men and lesbians, and Latinos, and empowerment in policy practice. Open to non-majors by permission of instructor. Offered annually in the spring semester. Counts toward American studies major and biomedical studies concentration (for students through class of 2016)."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2015
}
