{
	"clbid": 102158,
	"credits": 0.5,
	"crsid": 24291,
	"departments": [
		"EDUC"
	],
	"description": [
		"Student teaching provides the best possible introduction to the teaching experience. Student teachers practice all classroom teaching skills required to assure competency to begin their first year of teaching. Students are assigned to a full-time internship in schools under the guidance of a competent cooperating teacher and supervised by faculty from both the content area department and the Education Department. Minimum of 6-12 full-time weeks teaching. Only student teachers may enroll: seniors or college graduates seeking an additional license. Offered each semester and Interim. Cannot be taken concurrently with EDUC 389 or EDUC 390. Prerequisite: completion of EDUC 389 or EDUC 390 or equivalent."
	],
	"instructors": [
		"Rosemary A. Pfarr-Baker"
	],
	"level": 300,
	"name": "Student Teach: ESL",
	"notes": [
		"Open to Seniors in the professional semester only."
	],
	"number": 391,
	"pn": false,
	"prerequisites": "Prerequisite: completion of EDUC 389 or EDUC 390 or equivalent.",
	"revisions": [
		{
			"_updated": "2015-09-23T23:00:33.207816+00:00",
			"notes": "Open to seniors only."
		},
		{
			"_updated": "2016-01-30T14:55:44.588096+00:00",
			"desc": "Student teaching provides the best possible introduction to the teaching experience. Student teachers practice all classroom teaching skills required to assure competency to begin their first year of teaching. Students are assigned to a full-time internship in schools under the guidance of a competent cooperating teacher and supervised by faculty from both the content area department and the Education Department. Minimum of 6-10 full-time weeks teaching. Only student teachers can enroll: seniors or college graduates seeking an additional license. Offered each semester and Interim. Cannot be taken concurrently with EDUC 389 or EDUC 390. Prerequisite: completion of EDUC 389 or EDUC 390 or equivalent."
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20153,
	"title": "Student Teaching: Additional License",
	"type": "Research",
	"year": 2015
}
