{
	"clbid": 102067,
	"credits": 1.0,
	"crsid": 26501,
	"departments": [
		"PHIL"
	],
	"description": [
		"Modern science raises important challenges for ethics and religion. Some are theoretical: can evolutionary and cognitive science be fully accommodated by religious persons and moral realists? Are the arguments for God's existence helped or hurt by modern science? Scientific developments also give rise to practical challenges for ethics. Should we radically enhance human nature? Does neuroscience show that we can't be morally responsible? Should we worry about global catastrophes? Students explore these or related questions. Offered annually. Counts toward neuroscience concentration. Prerequisite: completion of BTS-T or permission of instructor."
	],
	"gereqs": [
		"EIN",
		"WRI"
	],
	"instructors": [
		"Jason Marsh"
	],
	"level": 200,
	"locations": [
		"OM 140"
	],
	"name": "Science, Ethics, Religion",
	"notes": [
		"Prerequisite: completion of BTS-T or permission of instructor.",
		"Open only to seniors and a limited number of juniors during web registration."
	],
	"number": 251,
	"pn": false,
	"prerequisites": "completion of BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.444193+00:00",
			"locations": [
				"HH 516"
			]
		},
		{
			"_updated": "2015-11-12T00:01:25.593909+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.476427+00:00",
			"desc": "Modern science raises important challenges for ethics and religion. Some are theoretical: can evolutionary and cognitive science be fully accommodated by religious persons and moral realists? Are the arguments for God's existence helped or hurt by modern science? Scientific developments also give rise to practical challenges for ethics. Should we radically enhance human nature? Does neuroscience show that we can't be morally responsible? Should we worry about global catastrophes? Students explore these or related questions. Offered annually. Prerequisite: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-02-03T00:01:09.949397+00:00",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor."
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0200-0255PM"
	],
	"title": "Science, Ethics, and Religion",
	"type": "Research",
	"year": 2015
}
