{
	"clbid": 102920,
	"credits": 1.0,
	"crsid": 159,
	"departments": [
		"BIO"
	],
	"description": [
		"Molecular biology techniques are bringing about a revolution in understanding living organisms. Students study the structure and function of macromolecules, methods currently used to clone and analyze genes, and new insights into basic biological processes which these methods provide. The course uses lecture and discussion topics with one project-oriented three-hour laboratory per week. Counts toward biomolecular science and neuroscience concentrations. Prerequisite: BIO 233."
	],
	"groupid": 159,
	"instructors": [
		"Kimberly A. Kandl"
	],
	"level": 300,
	"locations": [
		"RNS 390",
		"RNS 390"
	],
	"name": "Molecular Biology",
	"notes": [
		"Students in Bio 364 must also register for Bio 364 lab. Open to Juniors and",
		"Seniors only. This course has class-year limits."
	],
	"number": 364,
	"pn": false,
	"prerequisites": "Prerequisite: BIO 233.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.362967+00:00",
			"instructors": [
				"Staff"
			],
			"notes": "Students in Bio 364 must also register for one lab Bio 364 AL or BL."
		},
		{
			"_updated": "2015-08-26T23:00:27.009665+00:00",
			"locations": null,
			"notes": "Students in Bio 364 must also register for Bio 364 lab.",
			"times": null
		},
		{
			"_updated": "2015-11-12T00:01:27.057260+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.694862+00:00",
			"desc": "Molecular biology techniques are bringing about a revolution in understanding living organisms. Students study the structure and function of macromolecules, methods currently used to clone and analyze genes, and new insights into basic biological processes which these methods provide. The course uses lecture and discussion topics with one project-oriented three-hour laboratory per week. Prerequisite: BIO 233."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"type": "Research",
	"year": 2015
}
