{
	"clbid": 102853,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"Food Writing: Adventures in Gastronomy - French writer Brillat-Savarin declares in The Physiology of Taste of 1848, “Tell me what you eat, and I will tell you what you are.” American writer Mark Kurlansky insists in his 2002 Choice Cuts: A Savory Selection of Food Writing from around the World and throughout History, “Food is about agriculture, about ecology, about man’s relationship with nature, about the climate, about nation-building, cultural struggles, friends and enemies, alliances, wars, religion. It is about memory and tradition and, at times, even about sex.” Cooking, eating, and the representation of food as a topic of academic inquiry as well as one of enormous import in popular culture are the focus of this writing seminar. Through a number of formal and informal writing assignments students will explore the role of food in a variety of contexts such as literature, art, history, film, journalism and television. Texts and films may include Michael Pollan’s recent work of nonfiction Cooked: A Natural History of Transformation, Emile Zola’s nineteenth-century novel, The Belly of Paris, articles and essays by Roland Barthes, Wendell Berry, Michelle Obama, Margaret Mead, Barbarba Kingsolver, and Anthony Bourdain, as well as Gabriel Axel’s 1987 Danish movie, Babette’s Feast."
	],
	"enroll": 17,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Lise R. Hoy"
	],
	"level": 100,
	"locations": [
		"TOH 316"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Description: Food Writing: Adventures in Gastronomy"
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.834768+00:00",
			"locations": [
				"TOH 214"
			]
		},
		{
			"_updated": "2015-06-08T23:00:30.399605+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-23T17:00:25.670635+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:51.569343+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:27.804462+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.704914+00:00",
			"enroll": "17",
			"max": "18"
		}
	],
	"section": "H",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2015
}
