{
	"clbid": "0000102835",
	"credits": 1.0,
	"crsid": "0000001161",
	"department": "PSYCH",
	"description": [
		"How do psychologists characterize the most basic aspects of the learning process? While some emphasis is on analysis of the behavioral viewpoint (Pavlov, Skinner), students also examine the ways current investigators apply these basic principles to problems in other fields. These include behavioral therapy for a variety of psychological disturbances, research on the neurobiology of drug reward, and analysis of consumer behavior. The course includes lecture and laboratory work with nonhuman animals. Counts toward educational studies, management studies, and educational studies concentrations. Prerequisite: PSYCH 125. Offered annually."
	],
	"enrolled": 31,
	"gereqs": [
		"SED"
	],
	"groupid": "0000001161",
	"instructors": [
		"Shelly D. Dickinson"
	],
	"level": 200,
	"locations": [
		"RNS 208",
		"RNS 208"
	],
	"max": 32,
	"name": "Condition & Learning",
	"notes": [
		"Students in Psych 236 must also register for one lab Psych 236 AL or BL."
	],
	"number": 236,
	"pn": false,
	"prerequisites": "PSYCH 125. Offered annually.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.810443+00:00",
			"locations": [
				"RNS 210",
				"RNS 210"
			]
		},
		{
			"_updated": "2015-04-28T23:00:25.227089+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:51.545193+00:00",
			"desc": "How do psychologists characterize the most basic aspects of the learning process? While some emphasis is on analysis of the behavioral viewpoint (Pavlov, Skinner), students also examine the ways current investigators apply these basic principles to problems in other fields. These include behavioral therapy for a variety of psychological disturbances, research on the neurobiology of drug reward, and analysis of consumer behavior. The course includes lecture and laboratory work with nonhuman animals. Counts toward neuroscience concentration. Prerequisite: PSYCH 125 or BIO 125. Offered annually.",
			"prerequisites": "Prerequisite: PSYCH 125 or BIO 125. Offered annually."
		},
		{
			"_updated": "2018-02-03T00:00:24.857309+00:00",
			"prerequisites": "Prerequisite: PSYCH 125. Offered annually."
		},
		{
			"_updated": "2018-07-12T16:51:27.791301+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.689310+00:00",
			"enroll": "31",
			"max": "32"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Conditioning and Learning",
	"type": "Research",
	"year": 2015
}
