{
	"clbid": 102072,
	"credits": 1.0,
	"crsid": 1143,
	"departments": [
		"PSCI"
	],
	"description": "This seminar introduces the core questions, concepts, and theories of the field of American politics. With topics varying from term to term, students read both \"cutting edge\" research and the classic articles of the field. The methodology employed in the research is a central topic. Students ask whether the methods are appropriate and helpful for answering the central questions of American politics. The course also includes a major research project. Counts toward American studies major. Prerequisites: PSCI 220 and one course in the subfield, or permission of instructor.",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Christopher B. Chapp"
	],
	"level": 300,
	"locations": [
		"BMC 012",
		"BMC 012"
	],
	"name": "Sem: American Politics",
	"notes": "Open only to seniors during web registration. Juniors may add on a space- available basis during the drop/add period.",
	"number": 311,
	"pn": false,
	"prerequisites": "Prerequisites: PSCI 220 and one course in the subfield, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-07T16:54:39.452725-05:00",
			"locations": [
				"HH 515",
				"HH 515"
			]
		},
		{
			"_updated": "2015-06-04T18:00:27.919197-05:00",
			"locations": [
				"DC 204",
				"DC 204"
			]
		},
		{
			"_updated": "2015-07-02T18:00:19.907057-05:00",
			"name": "Sem: Am Politics"
		},
		{
			"_updated": "2015-11-11T18:01:25.637948-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:44.482950-06:00",
			"desc": "This seminar introduces the core questions, concepts, and theories of the field of American politics. With topics varying from term to term, students read both \"cutting edge\" research and the classic articles of the field. The methodology employed in the research is a central topic. Students ask whether the methods are appropriate and helpful for answering the central questions of American politics. The course also includes a major research project. Counts towards American studies major. Prerequisites: PSCI 220 and one course in the subfield, or permission of instructor."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"title": "Seminar in American Politics",
	"type": "Seminar",
	"year": 2015
}
