{
	"clbid": 102211,
	"credits": 0.25,
	"crsid": 152,
	"departments": [
		"BIO"
	],
	"description": [
		"For science majors, learning to read the primary literature and other professional sources is an important transition from classroom learning to post-graduate endeavors. Students read, present, and discuss scientific literature in a field selected by participating faculty. The goal is to garner sufficient expertise to allow critical analysis of the particular field. Requires permission of instructor. May be repeated if topic is different."
	],
	"instructors": [
		"Kevin M. Crisp"
	],
	"level": 200,
	"locations": [
		"RNS 190"
	],
	"name": "Top: Medical Terminology",
	"notes": "Closed during web registration. Registration by permission only; see Professor Kevin Crisp. This course is intended only for for students who need it as a prerequisite for specific graduate programs.",
	"number": 291,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.309098+00:00",
			"instructors": [
				"Staff"
			],
			"notes": "Closed during web registration. Registration by permission only; see Professor Jean Porterfield. This course is intended only for for students who need it as a prerequisite for specific graduate programs.",
			"status": "O"
		},
		{
			"_updated": "2015-12-10T06:00:59.961748+00:00",
			"locations": null
		},
		{
			"_updated": "2016-01-30T14:55:44.642744+00:00",
			"desc": "For science majors, learning to read the primary literature and other professional sources is an important transition from classroom learning to post-graduate endeavors. Students read, present, and discuss scientific literature in a field selected by participating faculty. The goal is to garner sufficient expertise to allow critical analysis of the particular field. Requires permission of instructor. May be repeated if topics are different."
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"Th 0700-0900PM"
	],
	"title": "Topics in Biological Research",
	"type": "Topic",
	"year": 2015
}
