{
	"clbid": "0000102370",
	"credits": 1.0,
	"crsid": "0000000728",
	"department": "MATH",
	"description": [
		"This course explores the nature of mathematics and its role in contemporary society. The content and format of the course vary depending on the instructor's interests. In particular, the course may focus on one or two mathematical topics in depth or survey a wider range of topics. Recent topics have included mathematics of voting, probability, game theory, finance, and connections between mathematics and the arts. Offered annually. Prerequisites: high school algebra and geometry."
	],
	"enrolled": 23,
	"gereqs": [
		"AQR"
	],
	"instructors": [
		"Kristina Garrett"
	],
	"learningmode": "S",
	"level": 100,
	"max": 24,
	"name": "Gateways/Mathematics",
	"number": 117,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "RNS 206",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "RNS 206",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: high school algebra and geometry.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.624166+00:00",
			"desc": "This course explores the nature of mathematics and its role in contemporary society. The content and format of the course vary depending on the instructor's interests. In particular, the course may focus on one or two mathematical topics in depth or survey a wider range of topics. Recent topics have included mathematics of voting, probability, game theory, finance, and connections between mathematics and the arts. Prerequisites: high school algebra and geometry. Offered annually.",
			"prerequisites": "Prerequisites: high school algebra and geometry. Offered annually."
		},
		{
			"_updated": "2018-07-12T16:51:24.347699+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.115061+00:00",
			"enroll": "23",
			"max": "24"
		},
		{
			"_updated": "2020-10-15T15:23:54.540986+00:00",
			"learningmode": null
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"title": "Gateways to Mathematics",
	"type": "Research",
	"year": 2014
}
