{
	"clbid": "0000102744",
	"credits": 1.0,
	"crsid": "0000000083",
	"department": "ASIAN",
	"description": [
		"This course examines contemporary China through Chinese language cinema across different eras, genres, filmmakers, and geographic regions. Students will explore the art of film and how visual narratives represent, reinterpret, and redefine Chinese society and culture both at home and abroad. Discussion topics include modernity and tradition, nationalism and globalization, class and race, gender and sexuality, independent and commercial films. All readings are in English. Counts toward film studies concentration. FLAC component available."
	],
	"enrolled": 38,
	"gereqs": [
		"ALS-A",
		"MCG"
	],
	"instructors": [
		"Ka F. Wong"
	],
	"level": 100,
	"max": 25,
	"name": "Contemporary China Thru Film",
	"number": 156,
	"offerings": [
		{
			"day": "Mo",
			"end": "21:00",
			"location": "RNS 210",
			"start": "18:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.696742+00:00",
			"name": "Cont China Thru Film"
		},
		{
			"_updated": "2015-04-28T23:00:24.325587+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-05-07T23:00:22.701599+00:00",
			"locations": [
				"TOH 114"
			]
		},
		{
			"_updated": "2016-01-30T14:55:51.416651+00:00",
			"desc": "Students study basic concepts and approaches of film analysis, while examining aesthetics, themes and techniques of masterworks directed by Chinese Fifth Generation directors. Through readings of cinema theory and criticism and class discussions, students explore artistic merits in these films and aspects of Chinese society and culture in contemporary China, particularly the changes that have occurred since 1978 with China's Four Modernizations. All readings are in English. Counts toward film studies concentration."
		},
		{
			"_updated": "2018-07-12T16:51:27.736547+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.624410+00:00",
			"enroll": "38",
			"max": "25"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"title": "Contemporary China Through Film",
	"type": "Research",
	"year": 2015
}
