{
	"clbid": 102931,
	"credits": 1.0,
	"crsid": 261,
	"departments": [
		"ECON"
	],
	"description": [
		"This course tracks economic development in China with emphasis on Shanghai. The course examines the emergence and evolution of markets in rural, urban, commercial, and financial centers and how the changes affect culture, attitudes, customs, and life of the people. Shanghai will be compared with other Chinese cities, including Nanjing, Suzhou, Hangzhou and Hong Kong. The role of Hong Kong in China's reform and its integration since 1997 is also discussed. Offered alternate Interims. Counts toward Asian studies major and concentration. Prerequisites: one of Economics 110-121 or permission of instructor."
	],
	"enroll": 24,
	"gereqs": [
		"HBS",
		"MCG"
	],
	"instructors": [
		"Xun Pomponio"
	],
	"level": 200,
	"max": 24,
	"name": "Econ Progress China",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 218,
	"pn": false,
	"prerequisites": "Prerequisites: one of Economics 110-121 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-11-06T00:01:54.544976+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.500155+00:00",
			"desc": "This course tracks economic development in China with emphasis on Shanghai. The course examines the emergence and evolution of markets in rural, urban, commercial, and financial centers and how the changes affect culture, attitudes, customs, and life of the people. Shanghai will be compared with other Chinese cities, including Nanjing, Suzhou, Hangzhou and Hong Kong. The role of Hong Kong in China's reform and its integration since 1997 is also discussed. Offered alternate Interims. Counts toward Asian studies major andconcentration. Prerequisites: one of Economics 110-121 or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:30.091072+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.053546+00:00",
			"enroll": "24",
			"max": "24"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"title": "Economic Progress in China",
	"type": "Research",
	"year": 2015
}
