{
	"clbid": 102890,
	"credits": 1.0,
	"crsid": 48,
	"departments": [
		"ART"
	],
	"description": [
		"This course provides intensive exposure to career opportunities in architecture, painting, sculpture, printmaking, ceramics, photography, illustration, video, digital media, and design of all kinds (from toys to exhibitions at the Metropolitan Museum of Art). Working five to seven hours a day, students interview over 25 artist professionals during the month, visit more than 100 galleries and museums, and write extensively about artists and artwork.This course does not count toward the major in studio art or art history. Offered in alternate years during Interim. Counts toward management studies concentration. Prerequisite: none, but completion of the following courses is highly recommended: ART 253 (preferred), ART 252, and ART 280."
	],
	"instructors": [
		"Ron Gallas"
	],
	"level": 200,
	"name": "New York Art Interim",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 246,
	"pn": false,
	"prerequisites": "none, but completion of the following courses is highly recommended: ART 253 (preferred), ART 252, and ART 280.",
	"revisions": [
		{
			"_updated": "2015-11-06T00:01:54.323405+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.486748+00:00",
			"desc": "This course provides intensive exposure to career opportunities in architecture, painting,sculpture, printmaking, ceramics, photography, illustration, video, digital media,anddesign ofall kinds (from toys to exhibitions at the Metropolitan Museum of Art). Workingfivetosevenhours a day, students interview over 25 artist professionals during the month,visitmorethan100 galleries and museums, and write extensively about artists and artwork.Thiscoursedoesnot count toward the major in studio art or art history. Prerequisite: none, but completion of the following courses is highly recommended: ART 253(preferred), ART 252, and ART 280. Offered in alternate years during Interim.",
			"prerequisites": "Prerequisite: none, but completion of the following courses is highly recommended: ART 253(preferred), ART 252, and ART 280. Offered in alternate years during Interim."
		},
		{
			"_updated": "2018-02-03T00:00:25.832440+00:00",
			"prerequisites": "Prerequisite: none, but completion of the following courses is highly recommended: ART 253 (preferred), ART 252, and ART 280."
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"type": "Research",
	"year": 2015
}
