{
	"clbid": 102737,
	"credits": 1.0,
	"crsid": 1234,
	"departments": [
		"ASIAN",
		"REL"
	],
	"description": [
		"Students examine contemporary Buddhist moral teachings on social issues such as violence and peacemaking, human rights and social justice, and humanity and the environment. Coursework focuses on the writings of Vietnamese monk and peace activist Thich Nhat Hanh, Tibetan leader-in-exile Tenzin Gyatso (Fourteenth Dalai Lama), American ecologist Joanna Macy, and others. Students consider the moral paradigms of Christianity and Buddhism: Christ and the Bodhisattva. Prerequisite: BTS-T or permission of instructor."
	],
	"enroll": 25,
	"gereqs": [
		"EIN"
	],
	"instructors": [
		"Barbara Reed"
	],
	"level": 200,
	"locations": [
		"OM 240"
	],
	"max": 24,
	"name": "Buddhism, Peace, Justice",
	"notes": [
		"Prerequisite: Completion of BTS-T or permission of instructor. Open only to",
		"rising seniors and a limited number of rising juniors during web registration."
	],
	"number": 289,
	"pn": false,
	"prerequisites": "BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-24T05:00:47.276325+00:00",
			"notes": null
		},
		{
			"_updated": "2015-04-28T23:00:24.262421+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:51.408043+00:00",
			"desc": "Students examine contemporary Buddhist moral teachings on social issues such as violence and peacemaking, human rights and social justice, and humanity and the environment. Coursework focuses on the writings of Vietnamese monk and peace activist Thich Nhat Hanh, Tibetan leader-in-exile Tenzin Gyatso (Fourteenth Dalai Lama), American ecologist Joanna Macy, and others. Students consider the moral paradigms of Christianity and Buddhism: Christ and the Bodhisattva. Prerequisite: completion of BTS-T or permission of instructor.",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-02-03T00:00:24.799338+00:00",
			"prerequisites": "Prerequisite: BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:27.732493+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.619634+00:00",
			"enroll": "25",
			"max": "24"
		}
	],
	"section": "B",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"MWF 0200-0255PM"
	],
	"title": "Buddhism, Peace and Justice",
	"type": "Research",
	"year": 2015
}
