{
	"clbid": 102206,
	"credits": 1.0,
	"crsid": 18782,
	"departments": [
		"ENVST"
	],
	"description": [
		"This Arts and Humanities emphasis seminar takes an integral ecology approach in considering the value of trees, forests and woods. While we’ll constantly dip into scientific information about woods and forests as well as policy-related concerns, our focus will be on what trees and woods do for the human spirit and the development of an ecological ethos. This will involve meditating on a woods at hand, Norway Valley, with special emphasis on what thinkers in the arts and humanities such as Thoreau in Walden and poets and photographers teach us about trees, woods and valuing nature. Would it be a loss if St. Olaf cut down the Norway Valley trees and used the land for other purposes? Who, if anyone would mourn or worry about such a loss and why? Those will be the seminar’s bottom line questions."
	],
	"enroll": "8",
	"instructors": [
		"Matthew Rohn"
	],
	"level": 300,
	"locations": [
		"CAD 202",
		"CAD 202"
	],
	"max": "16",
	"name": "Top: Contested Spaces",
	"number": 381,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.305595+00:00",
			"times": [
				"T 0800-0925",
				"Th 0800-0920"
			]
		},
		{
			"_updated": "2016-01-30T14:51:20.207455+00:00",
			"locations": [
				"DC 204",
				"DC 204"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.641225+00:00",
			"desc": "Students study topics related to the environment. Topics vary from year to year at the discretionof the instructor. Recent topics offered include Ecosystem Research, Landscape Art, ImagingEnvironmentalism, and Landscape and Regional Change in the Arctic."
		},
		{
			"_updated": "2017-05-30T15:52:43.891131+00:00",
			"locations": [
				"DC 202",
				"DC 202"
			]
		},
		{
			"_updated": "2018-07-12T16:51:32.168838+00:00",
			"enroll": null,
			"max": null
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Advanced Research Topics in Environmental Studies",
	"type": "Topic",
	"year": 2015
}
