{
	"clbid": 102891,
	"credits": 1.0,
	"crsid": 37,
	"departments": [
		"ART"
	],
	"description": "Through a sequence of architectural design projects, students learn drawing (hand drafting and computer-aided drawing and design) and architectural design processes that require the integration of social, artistic, technical, and environmental issues typical of real projects. Visiting architects are involved. Field trips to experience spaces/places augment the studio work. Materials fee. Offered alternate years. Prerequisite: ART 102 and ART 103 or permission of instructor.",
	"instructors": [
		"Kurt Gough"
	],
	"level": 200,
	"locations": [
		"CAD 116",
		"CAD 116",
		"CAD 116"
	],
	"name": "Architectural Drawing and Design I",
	"notes": "Open to all students who meet the prerequisites.",
	"number": 225,
	"pn": false,
	"prerequisites": "Prerequisite: ART 102 and ART 103 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.854079+00:00",
			"name": "Arch Drawing/Design I",
			"title": "Architectural Drawing and Design I"
		},
		{
			"_updated": "2015-10-12T17:00:47.713032+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-11-06T00:01:54.339822+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-10T00:00:39.928917+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.488600+00:00",
			"desc": "Through a sequence of architectural design projects, students learn drawing (hand draftingand computer-aided drawing and design) and architectural design processes that require theintegration of social, artistic, technical, and environmental issues typical of real projects.Visiting architects are involved. Field trips to experience spaces/places augment the studiowork. Materials fee. Offered alternate years. Prerequisite: ART 102 and ART 103 or permission of instructor.",
			"title": null
		},
		{
			"_updated": "2017-05-30T15:31:40.842744+00:00",
			"locations": [
				"DC 116",
				"DC 116",
				"DC 116"
			]
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-F 0900-1000",
		"M-F 1040-1200PM",
		"M-F 0100-0300PM"
	],
	"title": "Architectural Design I",
	"type": "Research",
	"year": 2015
}
