{
	"clbid": 102989,
	"credits": 1.0,
	"crsid": 450,
	"departments": [
		"ENGL"
	],
	"description": [
		"Students analyze from a broadly cultural view the political, religious, and intellectual debates of Chaucer's day as reflected in his greatest work, the Canterbury Tales. Students examine the Canterbury Tales through the lens of ethics, using readings in ethical theory to better understand moral questions, Chaucer's poetry, and ourselves -- as interpreters of literature and moral agents. Counts toward medieval studies major. Prerequisites: ENGL 185 plus at least two English courses at level II; completion of BTS-T; or permission of the instructor."
	],
	"enroll": "16",
	"gereqs": [
		"EIN"
	],
	"instructors": [
		"Karen Cherewatuk"
	],
	"level": 300,
	"locations": [
		"OM 210"
	],
	"max": "15",
	"name": "Chaucer and Ethics",
	"notes": [
		"Prerequisites: completion of BTS-T or permission of instructor. Open only to",
		"juniors and seniors during web registration."
	],
	"number": 395,
	"pn": false,
	"prerequisites": "Prerequisites: ENGL 185 plus at least two English courses at level II; completion of BTS-T; or permission of the instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T22:02:50.009461+00:00",
			"notes": null
		},
		{
			"_updated": "2015-03-26T04:19:14.414065+00:00",
			"notes": "Prereuisites: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2015-11-06T06:01:47.683028+00:00",
			"notes": "Prerequisites: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2015-11-12T00:01:27.363285+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:51:20.306811+00:00",
			"locations": [
				"RML 520"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.761207+00:00",
			"desc": "Students analyze from a broadly cultural view the political, religious, and intellectual debates of Chaucer's day as reflected in his greatest work, the Canterbury Tales. Students examine the Canterbury Tales through the lens of ethics, using readings in ethical theory to better understand moral questions, Chaucer's poetry, and ourselves -- as interpreters of literature and moral agents. Prerequisites: ENGL 185 plus at least two English courses at level II; completion of BTS-T; or permission of the instructor."
		},
		{
			"_updated": "2018-07-12T16:51:32.215526+00:00",
			"enroll": null,
			"max": null
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0800-0855"
	],
	"title": "Chaucer from an Ethical Perspective",
	"type": "Research",
	"year": 2015
}
