{
	"clbid": 102094,
	"credits": 1.0,
	"crsid": 13,
	"departments": [
		"AMST"
	],
	"description": [
		"This seminar draws from historical and contemporary concepts of gender as students explore and respond to the changing myths and realities of American masculinities. Students consider why, for example, men occupy close to 95% of CEO positions in U.S. Fortune 500 Companies while the number of fathers at home caring for children has doubled since 1989. In either case, what does it mean to “be a man?” The course explores how gender, race, sexual orientation, age, and other identity categories affect individual perception and performance of masculinities in context of work, intimate relationships, popular culture, sports, gaming, and men’s movements. Texts may include The Mask You Live In, Masculinities in Theory, Performing American Masculinities, Talk Thai: The Adventures of Buddhist Boy, New Black Man, Rebel Without a Cause, and The Laramie Project. Participants are invited to bring additional interests to the writing and research components of this seminar."
	],
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Diane C. LeBlanc"
	],
	"level": 300,
	"locations": [
		"RNS 435"
	],
	"name": "Sem: American Masculinities",
	"notes": [
		"Open to seniors and juniors only."
	],
	"number": 301,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.483093+00:00",
			"locations": [
				"RML 420"
			]
		},
		{
			"_updated": "2015-11-05T14:26:34.372131+00:00",
			"gereqs": null
		},
		{
			"_updated": "2015-11-12T00:01:25.834033+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-12-19T00:00:36.768406+00:00",
			"locations": [
				"TOH 200"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.520915+00:00",
			"desc": "\"Ya say you want a revolution? Well...\" Students in this class will not be examining Chevrolet's ad campaign ad campaign for its new line of cars, but will be immersing themselves in one transformative year: 1968. We will look at the Tet offensive and its impact on the Vietnam War, which affected the presidential campaigns; we'll examine the protesting of the Miss America pageant, where feminists crowned a sheep; we'll try to understand why two greatly influential American leaders who could bring people together - Martin Luther King and Bobby Kennedy - were assassinated; we'll read about the Columbia University protests, where black students threw the white protesters out of \"their\" occupied building. We'll learn more about Black Power, the summer Olympics, George Wallace's segregationist \"law and order\" campaign and how that helped Richard Nixon win election. We'll listen to songs, watch films, read essays. 1968 is a year in a time period that is mythologized history, and we'll think hard about how and why the era is mythologized, as we do our own exploration about that year. All students will do a final project in the last few weeks of the term, taking up some issue after 1968 to see the continuities and differences.",
			"title": "Seminar: \"1968: New American Revolutions\""
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1150-1245PM"
	],
	"title": "Seminar in American Studies",
	"type": "Seminar",
	"year": 2015
}
