{
	"clbid": "0000102159",
	"credits": 3.0,
	"crsid": "0000000343",
	"department": "EDUC",
	"description": [
		"Students are assigned to a full-time internship in schools under the guidance of a competent cooperating teacher and supervised by faculty from both the content area department and the Education Department. Student teaching provides the best possible introduction to the teaching experience. Student teachers practice all classroom teaching skills required to assure competency to begin their first-year of teaching. Minimum of 14 full-time weeks teaching, including orientation sessions and required seminars. Only student teachers may enroll: seniors or college graduates. Offered each semester."
	],
	"enrolled": 20,
	"firstyear": "0/0",
	"instructors": [
		"Rosemary A. Pfarr-Baker"
	],
	"junior": "0/0",
	"level": 300,
	"max": 30,
	"name": "Student Teaching",
	"notes": [
		"Open to Seniors in the professional semester only."
	],
	"number": 389,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-07-17T23:00:22.157196+00:00",
			"instructors": [
				"Rosemary A. Pfarr-Baker"
			]
		},
		{
			"_updated": "2015-08-12T21:37:25.431421+00:00",
			"instructors": [
				"Anthony Taylor"
			]
		},
		{
			"_updated": "2015-09-23T23:00:33.212310+00:00",
			"notes": "Open to Seniors only."
		},
		{
			"_updated": "2016-01-30T14:55:44.589502+00:00",
			"desc": "Students are assigned to a full-time internship in schools under the guidance of a competent cooperating teacher and supervised by faculty from both the content area department and the Education Department. Student teaching provides the best possible introduction to the teaching experience. Student teachers practice all classroom teaching skills required to assure competency to begin their first-year of teaching. Minimum of 14 full-time weeks teaching, including orientation sessions and required seminars. Student teachers only -- seniors or college graduates. Offered each semester."
		},
		{
			"_updated": "2018-07-12T16:51:32.137738+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.166821+00:00",
			"enroll": "20",
			"max": "30"
		},
		{
			"_updated": "2018-11-02T04:18:32.048075+00:00",
			"firstyear": null,
			"junior": null,
			"sophomore": null
		}
	],
	"semester": 3,
	"sophomore": "0/0",
	"status": "O",
	"term": 20153,
	"type": "Research",
	"year": 2015
}
