{
	"clbid": "0000102116",
	"credits": 1.0,
	"crsid": "0000001371",
	"department": "SWRK",
	"description": [
		"This capstone course is for senior majors. Students begin a professional web presence to illustrate their readiness to begin practice as a generalist social worker. Classes emphasize auxiliary knowledge and skills in leadership. Students discuss emerging social work issues and provide peer assistance with professional development strategies. Evaluation includes oral presentation, ethics case analysis, professional development reflection assignments, and self-evaluation of achievement of program competencies. Counts toward management studies concentration. Prerequisite: SWRK 380."
	],
	"enrolled": 15,
	"instructors": [
		"Mary Carlsen"
	],
	"level": 300,
	"locations": [
		"TOH 300"
	],
	"max": 18,
	"name": "Social Worker as Professional",
	"notes": [
		"This course is open to Senior Social Work majors only."
	],
	"number": 381,
	"pn": false,
	"prerequisites": "SWRK 380.",
	"revisions": [
		{
			"_updated": "2015-06-23T23:00:26.312065+00:00",
			"name": "Soc Worker Professional",
			"title": "Social Worker as Professional"
		},
		{
			"_updated": "2016-01-30T14:55:44.537274+00:00",
			"desc": "This capstone course is for senior majors. Students begin a professional web presence to illustrate their readiness to begin practice as a generalist social worker. Classes emphasize auxiliary knowledge and skills in leadership. Students discuss emerging social work issues and provide peer assistance with professional development strategies. Evaluation includes oral presentation, ethics case analysis, professional development reflection assignments, and self-evaluation of achievement of program competencies. Prerequisite: SWRK 380."
		},
		{
			"_updated": "2018-02-03T00:01:09.970545+00:00",
			"prerequisites": "Prerequisite: SWRK 380."
		},
		{
			"_updated": "2018-07-12T16:51:32.117138+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.138031+00:00",
			"enroll": "15",
			"max": "18"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"M 0700-1000PM"
	],
	"type": "Research",
	"year": 2015
}
