{
	"clbid": 102902,
	"credits": 1.0,
	"crsid": 20057,
	"departments": [
		"ART"
	],
	"description": "This course focuses on the creative use of digital video as a tool to generate experimental films and video art. Students study all aspects of production from concept to screening, including idea generation, pre-production planning, storyboarding, lighting, shooting, editing, and sound design. Students regularly screen, analyze, and discuss contemporary and historic examples of time-based media. During the semester students produce a variety of short videos and films, exploring experimental, narrative, and documentary approaches. Materials fee. Offered alternate years. Counts toward film studies and media studies concentrations. Prerequisite: ART 104 or permission of instructor.",
	"gereqs": [
		"ALS-A"
	],
	"instructors": [
		"Peter B. Nelson"
	],
	"level": 200,
	"locations": [
		"CAD 116",
		"CAD 116"
	],
	"name": "Digital Filmmaking",
	"notes": "Prerequisite: ART 104 or permission of instructor.",
	"number": 229,
	"pn": false,
	"prerequisites": "Prerequisite: ART 104 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.351946+00:00",
			"grouptype": "R"
		},
		{
			"_updated": "2015-09-28T23:00:47.861823+00:00",
			"locations": [
				"DC 100",
				"DC 100"
			]
		},
		{
			"_updated": "2015-11-03T17:38:16.480987+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-12T00:01:27.018003+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.692200+00:00",
			"desc": "This course focuses on the creative use of digital video as a tool to generate experimentalfilmsand video art. Students study all aspects of production from concept to screening,includingidea generation, pre-production planning, storyboarding, lighting, shooting, editing,andsound design. Students regularly screen, analyze, and discuss contemporary and historicexamples of time-based media. During the semester students produce a variety of shortvideosand films, exploring experimental, narrative, and documentary approaches. Materials fee. Offered alternate years. Counts toward film studies concentration. Prerequisite: ART 104 or permission of instructor."
		},
		{
			"_updated": "2017-05-30T15:52:43.906988+00:00",
			"locations": [
				"DC 116",
				"DC 116"
			]
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0800-1100",
		"Th 0800-1050"
	],
	"type": "Research",
	"year": 2015
}
