{
	"clbid": "0000102032",
	"credits": 1.0,
	"crsid": "0000000179",
	"department": "AMCON",
	"description": [
		"Students in this course examine technology, the mass market and consumerism, and the increasingly complex relations between identity and material goods. They also explore the images, institutions, and stories of environmental, feminist, and Civil Rights activists in the context of Cold War America. Topics and texts range from Yosemite National Park and Japanese internment camps to Adrienne Rich's poetry and prose, Freedom Summer, Las Vegas, and the Mall of America. Offered annually in the spring semester. Counts toward American studies, race and ethnic studies, and women's and gender studies majors and and management studies, race and ethnic studies, and women's and gender studies concentrations. Prerequisite: AMCON 101, AMCON 102, and AMCON 201."
	],
	"enrolled": 16,
	"gereqs": [
		"ALS-A",
		"HBS",
		"ORC",
		"WRI"
	],
	"instructors": [
		"Jeanne I. Willcoxon"
	],
	"level": 200,
	"max": 19,
	"name": "Pursuits of Happiness: 1920-Present",
	"notes": [
		"Open to American Conversations students only.",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 202,
	"offerings": [
		{
			"day": "Mo",
			"end": "12:45",
			"location": "OM 010",
			"start": "11:50"
		},
		{
			"day": "We",
			"end": "12:45",
			"location": "OM 010",
			"start": "11:50"
		},
		{
			"day": "Fr",
			"end": "12:45",
			"location": "OM 010",
			"start": "11:50"
		}
	],
	"pn": false,
	"prerequisites": "AMCON 101, AMCON 102, and AMCON 201.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.146478+00:00",
			"name": "Pur/Happiness: 1920-Pres."
		},
		{
			"_updated": "2015-04-07T21:54:39.400707+00:00",
			"locations": [
				"HH 319"
			]
		},
		{
			"_updated": "2015-10-23T23:01:27.184415+00:00",
			"notes": "Open to American Conversations students only."
		},
		{
			"_updated": "2015-11-06T00:02:29.033174+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.421009+00:00",
			"desc": "Students in this course examine technology, the mass market and consumerism, and the increasingly complex relations between identity and material goods. They also explore theimages, institutions, and stories of environmental, feminist, and Civil Rights activists in thecontext of Cold War America. Topics and texts range from Yosemite National Park and Japaneseinternment camps to Adrienne Rich's poetry and prose, Freedom Summer, Las Vegas, and the Mallof America. Prerequisite: AMCON 101, AMCON 102, and AMCON 201. Offered annually in the spring semester. Counts toward American studies major and women's and gender studies major and concentration.",
			"prerequisites": "Prerequisite: AMCON 101, AMCON 102, and AMCON 201. Offered annually in the spring semester. Counts toward American studies major and women's and gender studies major and concentration."
		},
		{
			"_updated": "2018-02-03T00:01:09.930888+00:00",
			"prerequisites": "Prerequisite: AMCON 101, AMCON 102, and AMCON 201."
		},
		{
			"_updated": "2018-07-12T16:51:32.077168+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.085974+00:00",
			"enroll": "16",
			"max": "19"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"title": "Pursuits of Happiness, 1920-Present",
	"type": "Research",
	"year": 2015
}
