{
	"clbid": "0000102900",
	"credits": 1.0,
	"crsid": "0000000171",
	"departments": [
		"BIO"
	],
	"description": [
		"This course approaches the study of animal behavior from the blended viewpoints of evolutionary behavioral ecology and comparative psychology. Mechanisms of learning, cognition and development, as well as aggression, territoriality, and mating are examined at the organismic and cellular level. A deeper understanding of the neural and environmental determinants of behavior in a wide variety of species helps students better understand themselves and their place in nature. Laboratory work reinforces class material. Counts toward neuroscience concentration. Prerequisite: progress toward a major in any of the natural sciences."
	],
	"enroll": 16,
	"gereqs": [
		"IST",
		"SED"
	],
	"groupid": "0000000171",
	"instructors": [
		"Nicole Son"
	],
	"level": 300,
	"locations": [
		"RNS 124",
		"RNS 124"
	],
	"max": 14,
	"name": "Animal Behavior",
	"notes": [
		"Students in BIO 386 must also register for BIO 386 lab.",
		"Open only to Seniors and Juniors."
	],
	"number": 386,
	"pn": false,
	"prerequisites": "progress toward a major in any of the natural sciences.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.859722+00:00",
			"groupid": null,
			"notes": null
		},
		{
			"_updated": "2015-04-30T23:00:10.536954+00:00",
			"instructors": [
				"Diane K. Angell"
			]
		},
		{
			"_updated": "2015-06-04T17:00:18.662239+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-08-25T17:00:16.123126+00:00",
			"locations": null,
			"notes": "Students in BIO 386 must also register for BIO 386 lab.",
			"times": null
		},
		{
			"_updated": "2015-09-23T04:32:59.744783+00:00",
			"locations": [
				"TBA",
				"TBA"
			]
		},
		{
			"_updated": "2015-09-29T17:00:39.565079+00:00",
			"notes": "Students in BIO 386 must also register for BIO 386 lab. Not open to first-year students."
		},
		{
			"_updated": "2015-11-10T00:00:39.958318+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.493407+00:00",
			"desc": "This seminar course approaches the study of animal behavior from the blended viewpoints of evolutionary behavioral ecology and comparative psychology. Mechanisms of learning, cognition and development, as well as aggression, territoriality, and mating are examined at the organismic and cellular level. A deeper understanding of the neural and environmental determinants of behavior in a wide variety of species helps students better understand themselves and their place in nature. Counts toward neuroscience concentration. Prerequisite: progress toward a major in any of the natural sciences."
		},
		{
			"_updated": "2018-02-03T00:00:25.835712+00:00",
			"prerequisites": "Prerequisite: progress toward a major in any of the natural sciences."
		},
		{
			"_updated": "2018-07-12T16:51:30.082323+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.049365+00:00",
			"enroll": "16",
			"max": "14"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-Th 0900-1000",
		"M-Th 1040-1200PM"
	],
	"type": "Research",
	"year": 2015
}
