{
	"clbid": "0000102977",
	"credits": 1.0,
	"crsid": "0000000976",
	"departments": [
		"PHIL"
	],
	"description": [
		"Students examine feminist critiques of aspects of contemporary culture that shape women's lives, such as conventional morality, science, education, art, medicine, law, religion, and marriage. Students critically examine philosophical views that underlie these institutions, including views of human nature, gender, rationality, knowledge, morality, justice, and the value of autonomy. Alternative feminist views that promote feminist aims are explored and evaluated. Offered periodically. Counts toward women's and gender studies major and concentration."
	],
	"enroll": 20,
	"gereqs": [
		"MCD"
	],
	"instructors": [
		"Corliss Swain"
	],
	"level": 200,
	"locations": [
		"TOH 312"
	],
	"max": 20,
	"name": "Philosophy & Feminism",
	"notes": [
		"Open to all students. This course has class limits."
	],
	"number": 245,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.894607+00:00",
			"locations": null
		},
		{
			"_updated": "2015-11-10T00:00:40.087923+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-12-24T00:00:52.370347+00:00",
			"locations": [
				"OM 305"
			]
		},
		{
			"_updated": "2016-01-30T14:54:41.518595+00:00",
			"desc": "Students examine feminist critiques of aspects of contemporary culture that shape women's lives, such as conventional morality, science, education, art, medicine, law, religion, and marriage. Students critically examine philosophical views that underlie these institutions, including views of human nature, gender, rationality, knowledge, morality, justice, and the value of autonomy. Alternative feminist views that promote feminist aims are explored and evaluated. Offered most years. Counts toward women's and gender studies major and concentration."
		},
		{
			"_updated": "2018-07-12T16:51:30.120937+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.063351+00:00",
			"enroll": "20",
			"max": "20"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-F 1040-1240PM"
	],
	"title": "Philosophy and Feminism",
	"type": "Research",
	"year": 2015
}
