{
	"clbid": "0000102023",
	"credits": 1.0,
	"crsid": "0000000259",
	"departments": [
		"ECON"
	],
	"description": [
		"This course takes an analytical approach to economic reasoning and contemporary issues. The course introduces microeconomic and macroeconomic theories with applications to relevant topics, such as employment, growth, environmental protection, affirmative action, exchange rate fluctuations, taxes, and welfare reform. Students explore economics as an intelligent approach to understanding our daily lives as citizens, workers, managers and consumers. Offered each semester. Counts toward environmental studies major (social science emphasis) and management studies concentration."
	],
	"enroll": 22,
	"gereqs": [
		"HBS"
	],
	"instructors": [
		"Rebecca Judge"
	],
	"level": 100,
	"locations": [
		"RNS 208",
		"RNS 208"
	],
	"max": 25,
	"name": "Principles of Econ",
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.133302+00:00",
			"section": "F"
		},
		{
			"_updated": "2015-04-07T21:54:39.352940+00:00",
			"locations": [
				"HH 413",
				"HH 413"
			]
		},
		{
			"_updated": "2016-01-30T14:51:19.867282+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.397116+00:00",
			"desc": "This course takes an analytical approach to economic reasoning and contemporary issues. The course introduces microeconomic and macroeconomic theories with applications to relevant topics, such as employment, growth, environmental protection, affirmative action, exchange rate fluctuations, taxes, and welfare reform. Students explore economics as an intelligent approach to understanding our daily lives as citizens, workers, managers and consumers. Offered each semester. Counts toward environmental studies major (social science track)."
		},
		{
			"_updated": "2018-07-12T16:51:32.070272+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.077186+00:00",
			"enroll": "22",
			"max": "25"
		}
	],
	"section": "E",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Principles of Economics",
	"type": "Research",
	"year": 2015
}
