{
	"clbid": "0000102988",
	"credits": 1.0,
	"crsid": "0000001111",
	"departments": [
		"PSCI"
	],
	"description": [
		"Since its inception in 1916, the New Hampshire primary has attained a preeminent place in American presidential politics. This course will provide students with a broad overview of the presidential nominating process through a detailed examination of the New Hampshire primary. Students read academic analyses of the New Hampshire primary and intern with a presidential candidate Offered periodically during Interim. Counts toward political science major. Prerequisite: one course in political science or permission of instructor."
	],
	"enroll": 20,
	"instructors": [
		"Daniel Hofrenning"
	],
	"level": 200,
	"max": 20,
	"name": "New Hampshire Primary",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title.",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 204,
	"pn": false,
	"prerequisites": "one course in political science or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-10-22T17:00:40.795706+00:00",
			"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title."
		},
		{
			"_updated": "2015-11-06T00:01:54.965105+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.522989+00:00",
			"desc": "Since its inception in 1916, the New Hampshire primary has attained a preeminent place in American presidential politics. This course will provide students with a broad overview of the presidential nominating process through a detailed examination of the New Hampshire primary. Students read academic analyses of the New Hampshire primary and internwith a presidential candidate Prerequisite: one course in political science or permission of instructor. Offered during Interim every four years. Counts toward political science major.",
			"prerequisites": "Prerequisite: one course in political science or permission of instructor. Offered during Interim every four years. Counts toward political science major."
		},
		{
			"_updated": "2018-02-03T00:00:25.849055+00:00",
			"prerequisites": "Prerequisite: one course in political science or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:30.127649+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.066339+00:00",
			"enroll": "20",
			"max": "20"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"title": "The New Hampshire Primary and U.S. Presidential Politics",
	"type": "Research",
	"year": 2015
}
