{
	"clbid": 102569,
	"credits": 1.0,
	"crsid": 27679,
	"departments": [
		"PHIL"
	],
	"description": "This course analyzes issues concerning race and social justice from the perspective of normative ethical frameworks and various theories of value. Students investigate, interpret, and critique both intellectual foundations and reasons for endorsement of the various approaches to study in grace and social justice. Students pay critical attention tohow the black intellectual tradition understands the meanings and moral implications of such ideas. Offered occasionally during Interim. Counts toward race and ethnic studies concentration. Prerequisite: BTS-T or permission of instructor.",
	"gereqs": [
		"EIN"
	],
	"grouptype": "R",
	"instructors": [
		"Charles H. III. Watson"
	],
	"level": 200,
	"name": "Race and Social Justice",
	"notes": "This course has been cancelled.",
	"number": 255,
	"pn": false,
	"prerequisites": "Prerequisite: BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-16T19:44:15.216816+00:00",
			"locations": [
				"TBA"
			]
		},
		{
			"_updated": "2015-10-31T05:22:56.177888+00:00",
			"locations": [
				"OM 140"
			],
			"notes": null,
			"status": "O"
		},
		{
			"_updated": "2016-01-30T15:03:07.046593+00:00",
			"desc": "This course analyzes issues concerning race and social justice from the perspective of normative ethical frameworks and various theories of value. Students investigate, interpret, and critique both intellectual foundations and reasons for endorsement of the various approaches to studying race and social justice. Students pay critical attention to how the black intellectual tradition understands the meanings and moral implications of such ideas. Prerequisite: BTS-T or permission of instructor. Offered occasionally during Interim. Counts toward race and ethnic studies concentration.",
			"prerequisites": "Prerequisite: BTS-T or permission of instructor. Offered occasionally during Interim. Counts toward race and ethnic studies concentration."
		}
	],
	"semester": 4,
	"status": "X",
	"term": 20144,
	"times": [
		"M-F 1000-1130"
	],
	"type": "Research",
	"year": 2014
}
