{
	"clbid": 102932,
	"credits": 1.0,
	"crsid": 338,
	"depts": [
		"EDUC"
	],
	"desc": "Students examine the influence of race, class and multiculturalism in American schools by participating as teachers' assistants and tutors in two distinctly different K-12 schools. Students discover the challenges and benefits associated with teaching in a diverse racial, cultural and socio-economic environments. Through guest lectures, readings, field trips and seminars, students learn about the truly unique geographic and cultural setting of the Hawaiian islands. This environment makes an excellent framework to examine diversity on the mainland. Fulfills EDUC 382: Human Relations requirement. P/N only. Offered alternate Interims. Counts toward race and ethnic studies and American studies majors and race and ethnic studies concentration. Prerequisite: EDUC 260 or EDUC 330.",
	"gereqs": [
		"MCD"
	],
	"instructors": [
		"Elizabeth A. Leer"
	],
	"level": 300,
	"name": "Multicultural Education in Hawaii",
	"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title. Admission by application. Prerequisite: EDUC 260 or EDUC 330. This course is not open to first-year students.",
	"num": 378,
	"pf": true,
	"prerequisites": "Prerequisite: EDUC 260 or EDUC 330.",
	"revisions": [
		{
			"_updated": "2015-03-25T23:18:01.867822-05:00",
			"name": "Multi-Cultural Ed Hawaii"
		},
		{
			"_updated": "2015-09-29T12:00:39.606951-05:00",
			"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title. Admission by application. Prerequisite: EDUC 260 or EDUC 330."
		},
		{
			"_updated": "2015-11-05T18:01:54.567232-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:54:41.502819-06:00",
			"desc": "Students examine the influence of race, class and multiculturalism in American schools by participating as teachers' assistants and tutors in two distinctly different K-12 schools. Students discover the challenges and benefits associated with teaching in a diverse racial, cultural and socio-economic environments. Through guest lectures, readings, field trips and seminars, students learn about the truly unique geographic and cultural setting of the Hawaiian islands. This environment makes an excellent framework to examine diversity on the mainland. Fulfills EDUC 382: Human Relations requirement. P/N only. Offered alternate Interims. Counts towards race and ethnic studies and American studies majors and race and ethnic studies concentration. Prerequisite: EDUC 260 or EDUC 330, or permission of instructor.",
			"prerequisites": "Prerequisite: EDUC 260 or EDUC 330, or permission of instructor."
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"title": "Multicultural Education in Hawaii: Seminar and Practicum",
	"type": "Research",
	"year": 2015
}
