{
	"clbid": 102765,
	"credits": 1.0,
	"crsid": 18793,
	"departments": [
		"BIO",
		"ENVST"
	],
	"description": "The study of global change and human environmental impacts requires students to link concepts from biology, chemistry, and physics. Students investigate these links by exploring current theories in biogeochemistry, with an emphasis on understanding the feedback between physical and ecological processes and the coupling of multiple element cycles. Laboratory activities focus on a practical exploration of the methods biogeochemists use, including experience with a variety of instruments. Counts toward mathematical biology concentration. Prerequisite: any level II biology, chemistry, or physics course or permission of instructor.",
	"groupid": 18793,
	"instructors": [
		"John D. Schade"
	],
	"level": 300,
	"locations": [
		"RNS 208",
		"RNS 208"
	],
	"name": "Biogeochemistry",
	"notes": "Students in BI/ES 350 must also register for one lab BI/ES 350 AL or BL. Not open to first-year students.",
	"number": 350,
	"pn": false,
	"prerequisites": "Prerequisite: any level II biology, chemistry, or physics course or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-25T23:19:11.719959-05:00",
			"locations": [
				"HH 403",
				"HH 403"
			]
		},
		{
			"_updated": "2015-08-25T18:00:28.898773-05:00",
			"notes": "Students in BI/ES 350 must also register for one lab BI/ES 350 AL or BL."
		},
		{
			"_updated": "2016-01-30T08:55:51.446232-06:00",
			"desc": "The study of global change and human environmental impacts requires students to link concepts from biology, chemistry, and physics. Students investigate these links by exploring current theories in biogeochemistry, with an emphasis on understanding the feedback between physical and ecological processes and the coupling of multiple element cycles. Laboratory activities focus on a practical exploration of the methods biogeochemists use, including experience with a variety of instruments. Prerequisite: Any level II biology, chemistry, or physics course or permission of instructor.",
			"prerequisites": "Prerequisite: Any level II biology, chemistry, or physics course or permission of instructor."
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20151,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Biogeochemistry: Theory and Application",
	"type": "Research",
	"year": 2015
}
