{
	"clbid": 89705,
	"credits": 1.0,
	"crsid": 338,
	"departments": [
		"EDUC"
	],
	"description": [
		"Students examine the influence of race, class and multiculturalism in American schools by participating as teachers' assistants and tutors in two distinctly different K-12 schools. Students discover the challenges and benefits associated with teaching in a diverse racial, cultural and socio-economic environments. Through guest lectures, readings, field trips and seminars, students learn about the truly unique geographic and cultural setting of the Hawaiian islands. This environment makes an excellent framework to examine diversity on the mainland. Fulfills Education 382: Human Relations requirement. Prerequisite: Education 260 or 330, or permission of instructor. Offered during Interim. Counts towards race and ethnic studies and American studies majors and race and ethnic studies concentration."
	],
	"enroll": 18,
	"gereqs": [
		"MCD"
	],
	"instructors": [
		"Elizabeth A. Leer"
	],
	"level": 300,
	"max": 24,
	"name": "Multi-Cultural Ed Hawaii",
	"notes": [
		"This is an off-campus course. Admission by interview.",
		"You will find this course listed in Studio Abroad under its course title."
	],
	"number": 378,
	"pn": true,
	"prerequisites": "Education 260 or 330, or permission of instructor. Offered during Interim. Counts towards race and ethnic studies and American studies majors and race and ethnic studies concentration.",
	"revisions": [
		{
			"_updated": "2018-02-02T23:57:19.029591+00:00",
			"prerequisites": "Prerequisite: Education 260 or 330, or permission of instructor. Offered during Interim. Counts towards race and ethnic studies and American studies majors and race and ethnic studies concentration."
		},
		{
			"_updated": "2018-07-12T16:51:13.642701+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:07.458066+00:00",
			"enroll": "18",
			"max": "24"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20132,
	"title": "Multicultural Education in Hawaii: Seminar and Practicum",
	"type": "Research",
	"year": 2013
}
