{
	"clbid": "0000110279",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Fandom, Entertainment, and the Shaping of Fan Identity. Often, the things we like aid us in forming new connections with others who have similar interests. Does this mean the entertainment we consume informs who we become, or that it reflects who we already are? Fan practices, objects of fan devotion, and fans themselves are incredibly varied, yet they are the seeds that form subcultures and unite thousands. In this seminar, we will examine the history of fan culture as well as the current state of fandom. Students are welcome to introduce their own fandoms and fan experiences to written assignments and class discussions. Major assignments will include an investigative essay, a review, and a research paper. In addition to real-world examples of participatory culture, we will also consider depictions of fandom within fictional narratives that both critique and cater to fans, such as Ready Player One, Supernatural, and Galaxy Quest."
	],
	"enrolled": 17,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Nicolette Bucciaglia"
	],
	"junior": "0/0",
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Title: Fandom, Entertainment, and the Shaping of Fan Identity"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "BMC 012",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "BMC 012",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-09-03T11:31:26.207600+00:00",
			"status": "O"
		},
		{
			"_updated": "2018-07-12T16:51:36.987416+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:30.407940+00:00",
			"enroll": "17",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:36.965440+00:00",
			"junior": null,
			"senior": null
		}
	],
	"section": "O",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20161,
	"type": "Research",
	"year": 2016
}
