{
	"clbid": 110064,
	"credits": 1.0,
	"crsid": 432,
	"departments": [
		"ENGL"
	],
	"description": [
		"Is there life after total war? The obvious answer is yes, of course, we are here, but the preposition’s italics serve a purpose, gesture toward an argument: for some, the world wars did not end in 1945. They have been felt viscerally and thought about rigorously for the last half-century, influencing the ways people live together. \u0093The past is never dead,\u0094 Faulkner once wrote. \u0093It’s not even past.\u0094 This course investigates the continued presence of the world wars in modern and contemporary fiction. Reading works by three major authors\u0097Virginia Woolf, Michael Ondaatje, and W.G. Sebald\u0097we will study the interplay between the social, political, and environmental catastrophes of total war and the formal and stylistic moves that writers make as they attempt to provide an account of the unaccountable. We will consider how race, ethnicity, and gender have impacted \u0093post\u0094-war experience and its literary depictions, as well as how \u0093past\u0094 strife has structured more recent conflicts like the Cold War and the so-called war on terror. Prerequisite: FYW."
	],
	"gereqs": [
		"ALS-L"
	],
	"instructors": [
		"Sean F. Ward"
	],
	"level": 200,
	"locations": [
		"TOH 214"
	],
	"name": "Top: Life After Total War",
	"number": 253,
	"pn": false,
	"prerequisites": "Prerequisite: FYW.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:36.572394+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:42.556657+00:00",
			"locations": [
				"TBA"
			]
		},
		{
			"_updated": "2016-08-06T17:21:42.948258+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2016-09-15T11:31:28.920349+00:00",
			"name": "Authors in English",
			"title": null
		},
		{
			"_updated": "2017-05-30T17:11:30.852220+00:00",
			"description": "Students explore the works of major authors writing in English from around the globe, as well as their historical, social, and geographic contexts. Click on course title in the class and lab for more information about the course for that term. Prerequisite: FYW."
		}
	],
	"semester": 2,
	"status": "O",
	"term": 20162,
	"times": [
		"M-F 1040-1240PM"
	],
	"title": "Authors in English",
	"type": "Topic",
	"year": 2016
}
