{
	"clbid": "0000110791",
	"credits": 0.5,
	"crsid": "0000030523",
	"departments": [
		"NURS"
	],
	"description": [
		"Nursing is a complex, evolving profession responding to an ever-changing healthcare environment. Students discuss emerging nursing/healthcare issues and are guided in the development of strategies to prepare for the NCLEX-RN and for successful transition to baccalaureate generalist nursing practice. This course focuses on professional development, including personal philosophies of nursing, professional ethics, and portfolio development. Counts toward the nursing major. Offered annually in the spring semester. Prerequisites: open to senior nursing majors only; NURS 315 and NURS 316; concurrent registration in NURS 317, NURS 318, and NURS 319."
	],
	"enroll": 24,
	"instructors": [
		"Mary Kuehn"
	],
	"level": 300,
	"locations": [
		"YTT 050B"
	],
	"max": 24,
	"name": "Senior Nursing Seminar",
	"number": 399,
	"pn": false,
	"prerequisites": "Prerequisites: open to senior nursing majors only; NURS 315 and NURS 316; concurrent registration in NURS 317, NURS 318, and NURS 319.",
	"revisions": [
		{
			"_updated": "2016-11-12T11:32:05.433637+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:38.179928+00:00",
			"description": "Nursing is a complex, evolving profession responding to an ever-changing healthcare environment. Students discuss emerging nursing/healthcare issues and are guided in the development of strategies to prepare for the NCLEX-RN and for successful transition to baccalaureate generalist nursing practice. This course focuses on professional development, including personal philosophies of nursing, professional ethics, and portfolio development and guided preparation for the NCLEX-RN (licensure) examination.",
			"prerequisites": false
		},
		{
			"_updated": "2018-07-12T16:51:41.295557+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.834950+00:00",
			"enroll": "24",
			"max": "24"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2016
}
