{
	"clbid": 110260,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": "\"Nature\" and the Biblical Traditions This section, focused on ecological themes and experiences, considers how different interpretations of the Bible have influenced (positively and negatively) conceptions of responsibility to and for the natural world. What is the relationship between \u0093human nature\u0094 and the \"natural\" world? How do encounters with wildness and wilderness shape dispositions of gratitude, joy, and wonder? What is the value or significance of the more-than-human world? How should we deliberate about questions of wildlife management, endangered species, wilderness conservation, or climate policies? We will pair close readings of the Bible with selections from the tradition of nature writing, an interdisciplinary exercise which will allow us to address these questions of historical and on-going significance.",
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Nathaniel J. Van Yperen"
	],
	"level": 100,
	"locations": [
		"OM 305",
		"OM 305"
	],
	"name": "Bible/Culture/Commun",
	"notes": "Section Title: \"Nature\" and the Biblical Tradition",
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-08-14T11:57:35.465617+00:00",
			"instructors": [
				"Staff"
			],
			"locations": null,
			"notes": "Section Title: TBA",
			"status": "O",
			"times": null
		},
		{
			"_updated": "2017-05-30T17:12:29.374307+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "U",
	"semester": 1,
	"status": "C",
	"term": 20161,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
