{
	"clbid": "0000151870",
	"credits": 1.0,
	"crsid": "0000036173",
	"department": "FYS",
	"description": [
		"Tens of millions of people have taken the test. They've spit into a tube and mailed a sample to a direct-to-consumer (DTC) DNA testing facility such as 23andMe or Ancestry in the hopes of learning more about who they are. But what do these tests really do and what can we learn from our DNA? In this course we use case studies, popular-science works, interviews, essays and videos to learn what the information in our DNA can (or cannot) tell us about who we are. Students explore questions such as who gets tested and why? Can the DTC companies deliver on their promises of determining our ancestry, helping us find family members or assigning our risk for certain diseases? What happens to our data and what are some of the unanticipated surprises - both good and bad - that can result from testing? Students grapple with the ethical and societal implications of DTC DNA testing including the Eurocentric bias in reference databases, the use of DNA to solve crimes, and the right to privacy. Students work individually and collaboratively to develop research questions, investigate resources, and complete a group project to develop, promote and truthfully advertise a fictional DTC DNA testing company."
	],
	"enrolled": 0,
	"gereqs": [
		"FYS"
	],
	"groupid": "0000036173",
	"grouptype": "C",
	"instructors": [
		"Kim A. Kandl"
	],
	"learningmode": "S",
	"level": 100,
	"max": 17,
	"name": "Top: The Stories in Our DNA",
	"notes": [
		"Section topic: The Stories in Our DNA"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "OM 340",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "OM 340",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "OM 340",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2023-08-09T02:32:01.181615+00:00",
			"instructors": [
				"Kimberly A. Kandl"
			]
		},
		{
			"_updated": "2023-10-04T02:21:28.051295+00:00",
			"max": 20,
			"section": "D"
		},
		{
			"_updated": "2023-10-11T02:20:16.678801+00:00",
			"grouptype": "D"
		}
	],
	"section": "C",
	"semester": 3,
	"status": "O",
	"term": 20233,
	"title": "First-Year Seminar",
	"type": "Topic",
	"year": 2023
}
