{
	"clbid": "0000151837",
	"credits": 1.0,
	"crsid": "0000036173",
	"department": "FYS",
	"description": [
		"In this course we will explore the world of ancient Greek myth as it appears in the remains of 5th-century BCE satyr plays. These tragi-comic musicals were designed for performance in the late afternoon, after the Athenian spectators had just watched three tragedies in a row and were in the mood for a less serious way to end the festival day. To help us understand what made satyr plays so popular, we will also take on the challenge of staging a live performance of one of them, in collaboration with students and teachers from K-12 schools in the Northfield area. The first part of the semester will be spent reading, writing, and talking about Greek satyr plays, searching for links between them and modern forms of entertainment. After that, we will pool our talents to adapt and perform Sophocles' Ichneutae (\"The Trackers\"), which focuses on Apollo's search for his missing herd of cows but wittily interweaves that plot with Hermes' invention of the lyre. Although experience with theater, skill in music, knowledge of ancient Greek, and familiarity with cows would all be helpful, only a sense of humor is required."
	],
	"enrolled": 7,
	"gereqs": [
		"FYS"
	],
	"groupid": "0000036173",
	"grouptype": "G",
	"instructors": [
		"Anne Groton"
	],
	"learningmode": "S",
	"level": 100,
	"max": 17,
	"name": "Top: Old Play in a New Neighborhood",
	"notes": [
		"Section topic: An Old Play in a New Neighborhood",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 120,
	"offerings": [
		{
			"day": "Tu",
			"end": "09:25",
			"location": "CAD 202",
			"start": "08:00"
		},
		{
			"day": "Th",
			"end": "09:20",
			"location": "CAD 202",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2023-10-04T02:21:28.040048+00:00",
			"max": 20,
			"section": "K"
		},
		{
			"_updated": "2023-10-11T02:20:16.667071+00:00",
			"grouptype": "H"
		},
		{
			"_updated": "2023-11-04T02:19:29.052746+00:00",
			"enrolled": 0
		}
	],
	"section": "G",
	"semester": 3,
	"status": "O",
	"term": 20233,
	"title": "First-Year Seminar",
	"type": "Topic",
	"year": 2023
}
