{
	"clbid": "0000153285",
	"credits": 1.0,
	"crsid": "0000036257",
	"department": "WRIT",
	"description": [
		"This seminar explores the use of writing as a way of engendering the body and its multiple identities: that is, the body as a sex, raced, queer, and non-normative matter. We will practice close reading through class discussions, personal essays, reflections, and short audio-visual responses while engaging in a relational examination of how contemporary memoirs, essays, short fictions, and other narratives show what it means to have a body, what it means to have a disfigured, dying, or diseased body, and how these different conditions are formally and thematically represented across genres and media. It centers how writers narrate embodied experiences, craft alternative spaces of kinship and belonging, love and acceptance, against crushing normative social values. To develop as writers, students will be expected to engage in close reading, to write critically, and to develop their skills by engaging in regular peer review of each other's writing (understanding writing as a process that improves through collaboration), and finally by composing a final paper or creative project on a course theme that inspires you. We'll read writing by Lucy Grealy, Jamaica Kincaid, James Baldwin, and Gloria Anzaldúa. This seminar is ideal for students interested in feminism, queer and queer-of-color thinking, and comparative race studies."
	],
	"enrolled": 0,
	"gereqs": [
		"WRR"
	],
	"groupid": "0000036257",
	"grouptype": "Q",
	"instructors": [
		"Fremio Sepulveda Ortiz"
	],
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Top: Writing the Self/Body",
	"notes": [
		"Section topic: Writing the Self, Writing the Body"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "RML 520",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "RML 520",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": false,
	"section": "Q",
	"semester": 1,
	"status": "O",
	"term": 20231,
	"title": "Writing and Rhetoric",
	"type": "Topic",
	"year": 2023
}
