{
	"clbid": 104940,
	"credits": 1.0,
	"crsid": 19405,
	"departments": [
		"MGMT"
	],
	"description": "The Soul of Stuff: Arts, Culture, and Ethics ­ Artifacts, dolls, souls, trash. This team­ taught course combines perspectives from history, literature, and management to ask why do we collect stuff? Why does stuff matter? Does it possess its own soul, or does culture endow it with meaning? Why does some stuff remain valuable while much becomes garbage? Explore these questions and others through active learning practices such as making artifacts, collecting them for a museum, and reflecting through analytical and creative writing opportunities.",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Sian E. Muir"
	],
	"level": 300,
	"locations": [
		"DC Studio 3"
	],
	"name": "Research: Arts, Culture, and Ethics",
	"notes": "Full title: Research: The Soul of Stuff: Arts, Culture, and Ethics. Registration by permission of instructor. This is one of three linked 396 courses (ENGL, HIST, MGMT).",
	"number": 396,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-10-19T23:03:42.058826+00:00",
			"locations": null,
			"times": null
		},
		{
			"_updated": "2015-10-27T05:01:40.228357+00:00",
			"notes": "Formal title of course is Research: The Soul of Stuff: Arts, Culture, and Ethics Registration by permission of instructor."
		},
		{
			"_updated": "2015-10-29T23:00:58.754820+00:00",
			"notes": "Formal title of course is Research: The Soul of Stuff: Arts, Culture, and Ethics Registration by permission of instructor. WRI is pending committee approval.",
			"prerequisites": false
		},
		{
			"_updated": "2015-11-06T00:02:39.577727+00:00",
			"gereqs": null,
			"notes": "Full title: Research: The Soul of Stuff: Arts, Culture, and Ethics. Prereq: Art 240 (taken during Interim). Registration by permission of instructor. This is one of three linked 396 courses (ENGL, HIST, MGMT). WRI pending approval.",
			"prerequisites": "Prereq: Art 240 (taken during Interim). Registration by permission of instructor. This is one of three linked 396 courses (ENGL, HIST, MGMT). WRI pending approval."
		},
		{
			"_updated": "2015-12-12T00:01:02.138206+00:00",
			"status": "O"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Directed Undergraduate Research",
	"type": "Research",
	"year": 2015
}
