{
	"clbid": 104877,
	"credits": 1.0,
	"crsid": 30091,
	"departments": [
		"ART"
	],
	"description": "Explore Japan through the mass production, distribution, and consumption of Japanese art and popular culture. Students will learn how to analyze a diverse array of visual material\u0097architecture, advertising, animation (anime), art, comics (manga), digital idols, film, graphic design, mascot culture, music, and video games. In discovering the popular construction of \"Japaneseness,\" the course will proceed thematically to address issues of nationalism, race, gender, domesticity, consumer culture, subculture, environment, and Japan's relationship with its minorities from 1945 to 2015. Using methodologies from art history, visual studies, media studies, film studies, environmental studies, and anthropology, the goal of this course will be to rethink Japan as a site of local and global pop culture flows.",
	"gereqs": [
		"ALS-A",
		"MCG"
	],
	"instructors": [
		"Christina Spiker"
	],
	"level": 200,
	"locations": [
		"DC 202",
		"DC 202"
	],
	"name": "Top: Visual Culture in Modern Japan",
	"number": 276,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-12-09T00:00:47.094690+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:51:20.493538+00:00",
			"locations": [
				"DC 204",
				"DC 204"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.933207+00:00",
			"desc": "This seminar-style course focuses on a specific art-historical topic, and students learn how to pursue art-historical practice beyond the introductory level. Topics change with each offering. Offered periodically. Prerequisite: at least one art history course or permission of the instructor.",
			"prerequisites": "Prerequisite: at least one art history course or permission of the instructor."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"title": "Topics with ALS-A and MCG",
	"type": "Topic",
	"year": 2015
}
