{
	"clbid": "0000156020",
	"credits": 1.0,
	"crsid": "0000000128",
	"department": "BIO",
	"description": [
		"How do animals do what they need to do to survive in all sorts of environments? Why are others able to exist in only very particular conditions? These are the sorts of questions students explore as they navigate the basic systems that provide circulation, ventilation, movement, digestion, and waste removal. Students look at how these processes are coordinated by the nervous and endocrine systems and how they vary across the animal kingdom to help organisms survive in dry, hot deserts, in dark, deep oceans, and places in between. Students attend lectures plus one three-hour laboratory per week. In laboratory, they conduct quantitative physiological measurements to assess functions such as temperature control, respiration rates, and salt and water balance. Counts as \"comparative organismal biology\" core category. Offered periodically. Also counts toward mathematical biology and neuroscience concentrations. Prerequisites: BIO 150; BIO 227 or CH/BI 227 recommended."
	],
	"enrolled": 32,
	"firstyear": "0/0",
	"groupid": "0000000128",
	"instructors": [
		"Takashi Maie"
	],
	"learningmode": "S",
	"level": 200,
	"max": 32,
	"name": "Animal Physiology",
	"notes": [
		"Students enrolled in BIO 247 must also enroll in lab BIO 247 AL or BL.",
		"Not open to first-year students"
	],
	"number": 247,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "RNS 410",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "RNS 410",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: BIO 150; BIO 227 or CH/BI 227 recommended.",
	"revisions": [
		{
			"_updated": "2024-02-14T02:19:20.739032+00:00",
			"max": 40
		},
		{
			"_updated": "2024-04-17T02:21:45.111825+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2024-04-18T02:20:15.570052+00:00",
			"enrolled": 21,
			"status": "O"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20241,
	"type": "Research",
	"year": 2024
}
