{
	"clbid": "0000156266",
	"credits": 0.25,
	"crsid": "0000037325",
	"department": "ID",
	"description": [
		"This .25 credit online course supports the curriculum of study abroad and away semester and year-long programs with Smith Center for Global Engagement-approved providers. It is not for students who are going on faculty-led study abroad and away programs. Students read articles and chapters exploring intercultural communication, globalization, and identity. Students reflect on their experiences in their study abroad or away location, discuss global systems that connect learning, and also engage in discussions of identity across borders. Course topics include identity, globalization, intercultural communication, adjusting to a new environment, defining culture, and understanding through intercultural practices. Offered fall and spring semesters. Prerequisite: registration in study abroad or away semester or year-long program."
	],
	"enrolled": 13,
	"gereqs": [
		"OEP"
	],
	"instructors": [
		"Theresa A. Heath"
	],
	"learningmode": "S",
	"level": 200,
	"max": 20,
	"name": "Global Engagement Seminar",
	"notes": [
		"Prerequisite: concurrent registration in a study abroad/away semester or year-",
		"long program. Please email the Registrar's Office to be added to this course."
	],
	"number": 296,
	"pn": true,
	"prerequisites": "registration in study abroad or away semester or year-long program.",
	"revisions": [
		{
			"_updated": "2024-04-12T02:22:57.822440+00:00",
			"max": 10,
			"notes": [
				"Prerequisite: registration in study abroad/away semester or year-long program."
			],
			"status": "O"
		},
		{
			"_updated": "2024-04-13T02:10:58.525257+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2024-04-17T02:21:45.173032+00:00",
			"enrolled": 1
		},
		{
			"_updated": "2024-04-18T02:20:15.632986+00:00",
			"enrolled": 4
		},
		{
			"_updated": "2024-04-23T02:22:53.740544+00:00",
			"enrolled": 9
		},
		{
			"_updated": "2024-05-17T02:24:53.500355+00:00",
			"enrolled": 12
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20241,
	"type": "Research",
	"year": 2024
}
