{
	"clbid": 95795,
	"credits": 0.5,
	"crsid": 335,
	"departments": [
		"EDUC"
	],
	"description": "Prospective teachers learn strategies to use when communicating with students who are experiencing personal difficulties. Communication with parents, family members and other professionals who have a vested interest in the student's well-being is emphasized. Professional ethics and liability are major components of the course. The course uses role playing to help students develop communication expertise. Topics include confidentiality, professional liability and boundaries, crisis intervention, abuse and neglect, mental health, and reporting and making referrals. Recommended junior year. Offered each semester. Prerequisite: EDUC 260, EDUC 290, or permission of instructor.",
	"instructors": [
		"Rosemary A. Pfarr-Baker"
	],
	"level": 300,
	"locations": [
		"TOH 212"
	],
	"name": "Counsel/Comm Schools",
	"notes": "Closed to First-Year Students.",
	"number": 372,
	"pn": false,
	"prerequisites": "Prerequisite: EDUC 260, EDUC 290, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T09:05:06.572580-06:00",
			"desc": "Prospective teachers learn strategies to use when communicating with students who are experiencing personal difficulties. Communication with parents, family members and other professionals who have a vested interest in the student's well-being is emphasized. Professional ethics and liability are major components of the course. The course uses role playing to help students develop communication expertise. Topics include confidentiality, professional liability and boundaries, crisis intervention, abuse and neglect, mental health, and reporting and making referrals. Recommended junior year. Prerequisite: EDUC 260, EDUC 290, or permission of instructor. Offered each semester.",
			"prerequisites": "Prerequisite: EDUC 260, EDUC 290, or permission of instructor. Offered each semester."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"Th 1245-0205PM"
	],
	"title": "Counseling and Communication in Schools",
	"type": "Research",
	"year": 2014
}
