{
	"clbid": "0000095665",
	"credits": 1.0,
	"crsid": "0000026896",
	"department": "ECON",
	"description": [
		"Classic economics assumes that people make decisions rationally. Behaviorial economics weakens that assumption, incorporating the findings of psychology into economic models. Students learn to apply behaviorial economics theories to improve their understanding of business, marketing, public policy, and other domains of economics. Students utilize skills they have learned from microeconomic theory and statistics orally and in writing. Offered most years. Prerequisites: ECON 262 and either ECON 263 or STAT 272, or permission of instructor."
	],
	"enrolled": 16,
	"firstyear": "0/0",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Ashley Hodgson"
	],
	"junior": "3/0",
	"learningmode": "S",
	"level": 300,
	"max": 17,
	"name": "Behavioral Economics",
	"notes": [
		"Open only to seniors during web registration."
	],
	"number": 372,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "HH 302",
			"start": "09:05"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "HH 302",
			"start": "09:05"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "HH 302",
			"start": "09:05"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: ECON 262 and either ECON 263 or STAT 272, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.458914+00:00",
			"desc": "Classic economics assumes that people make decisions rationally. Behaviorial economics weakens that assumption, incorporating the findings of psychology into economic models. Students learn to apply behaviorial economics theories to improve their understanding of business, marketing, public policy, and other domains of economics. Students utilize skills they have learned from microeconomic theory and statistics orally and in writing. Prerequisites: ECON 262 and either ECON 263 or STAT 272, or permission of instructor. Offered most years.",
			"prerequisites": "Prerequisites: ECON 262 and either ECON 263 or STAT 272, or permission of instructor. Offered most years."
		},
		{
			"_updated": "2018-07-12T16:51:23.537031+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.365257+00:00",
			"enroll": "16",
			"max": "15"
		},
		{
			"_updated": "2018-11-02T04:18:24.201814+00:00",
			"firstyear": null,
			"junior": null,
			"sophomore": null
		},
		{
			"_updated": "2020-09-18T15:03:50.226329+00:00",
			"max": 15
		},
		{
			"_updated": "2020-10-15T15:23:54.149657+00:00",
			"learningmode": null
		}
	],
	"semester": 3,
	"sophomore": "0/0",
	"status": "C",
	"term": 20143,
	"type": "Research",
	"year": 2014
}
