{
	"clbid": "0000095475",
	"credits": 1.0,
	"crsid": "0000000747",
	"department": "MATH",
	"description": [
		"Algebra is concerned with sets of objects and operations that satisfy a few basic properties. Using the properties we study axiomatic systems such as groups, rings, and fields, covering topics such as homomorphisms, cosets, quotient structures, polynomial rings,and finite fields. Emphasis is on theory and on developing the ability to write proofs. Offered each semester. Prerequisite: MATH 220. Permission of instructor required for first-year students."
	],
	"enroll": 10,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Kosmas Diveris"
	],
	"level": 200,
	"locations": [
		"RNS 204"
	],
	"max": 20,
	"name": "Abstract Algebra I",
	"number": 252,
	"pn": false,
	"prerequisites": "MATH 220. Permission of instructor required for first-year students.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.281287+00:00",
			"desc": "Algebra is concerned with sets of objects and operations that satisfy a few basic properties. Using the properties we study axiomatic systems such as groups, rings, and fields, covering topics such as homomorphisms, cosets, quotient structures, polynomial rings, and finite fields. Emphasis is on theory and on developing the ability to write proofs. Prerequisite: MATH 220. Permission of instructor required for first-year students. Offered each semester.",
			"prerequisites": "Prerequisite: MATH 220. Permission of instructor required for first-year students. Offered each semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.024948+00:00",
			"prerequisites": "Prerequisite: MATH 220. Permission of instructor required for first-year students."
		},
		{
			"_updated": "2018-07-12T16:51:23.421543+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.211835+00:00",
			"enroll": "10",
			"max": "20"
		}
	],
	"section": "B",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MWF 1045-1140"
	],
	"type": "Research",
	"year": 2014
}
