{
	"clbid": 95895,
	"credits": 1.0,
	"crsid": 1330,
	"departments": [
		"SPAN"
	],
	"description": "Students explore the topic of family and society in the Spanish-speaking world and develop critical reading skills by analyzing cultural documents (literary and non-literary texts, including at least one substantive literary work). This cultural analysis provides for extensive writing (e.g., description, narration, exposition, and argumentation). Taught in Spanish. Offered each semester. Counts toward women's and gender studies major and family studies and women's and gender studies concentrations. Prerequisite: SPAN 232 or placement into SPAN 250.",
	"gereqs": [
		"FOL-S",
		"WRI"
	],
	"instructors": [
		"Sylvia Carullo"
	],
	"level": 200,
	"locations": [
		"TOH 312",
		"TOH 312"
	],
	"name": "Gateway Sp-Spkng Wrld",
	"notes": "Prerequisite: completion of Spanish placement test or preceding course.",
	"number": 250,
	"pn": false,
	"prerequisites": "Prerequisite: SPAN 232 or placement into SPAN 250.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.688443+00:00",
			"desc": "Students explore the topic of family and society in the Spanish-speaking world and develop critical reading skills by analyzing cultural documents (literary and non-literary texts, including at least one substantive literary work). This cultural analysis provides for extensive writing (e.g., description, narration, exposition, and argumentation). Taught in Spanish. Prerequisite: SPAN 232 or placement into SPAN 250. Offered each semester. Counts toward women's and gender studies major and family studies and women's and gender studies concentrations.",
			"prerequisites": "Prerequisite: SPAN 232 or placement into SPAN 250. Offered each semester. Counts toward women's and gender studies major and family studies and women's and gender studies concentrations."
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Gateway to the Spanish-Speaking World",
	"type": "Research",
	"year": 2014
}
