{
	"clbid": "0000095829",
	"credits": 1.0,
	"crsid": "0000000278",
	"department": "ECON",
	"description": [
		"Government action affects us all. We pay taxes; we use public roads, schools, and parks. Some prices we pay are lower due to government subsidies; others are higher due to taxes. Government actions influence both the efficiency of our economy and the equity and equality within our society. Students learn valuable analytical tools for evaluating public projects, tax policies, entitlement programs and voting behavior. Offered most years. Counts toward American studies major. Prerequisite: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor."
	],
	"enrolled": 13,
	"firstyear": "0/0",
	"instructors": [
		"Rebecca Judge"
	],
	"junior": "5/0",
	"learningmode": "S",
	"level": 300,
	"max": 15,
	"name": "Econ of Public Policy",
	"notes": [
		"Prerequisite: Completion of BTS-T or permission of instructor.",
		"Open only to seniors during web registration."
	],
	"number": 371,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "HH 302",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "HH 302",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": "ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:57.333667+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T15:05:06.618155+00:00",
			"desc": "Government action affects us all. We pay taxes; we use public roads, schools, and parks. Some prices we pay are lower due to government subsidies; others are higher due to taxes. Government actions influence both the efficiency of our economy and the equity and equality within our society. Students learn valuable analytical tools for evaluating public projects, tax policies, entitlement programs and voting behavior. Prerequisite: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor. Offered most years. Counts toward American studies major.",
			"prerequisites": "Prerequisite: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor. Offered most years. Counts toward American studies major."
		},
		{
			"_updated": "2018-02-02T23:59:39.257544+00:00",
			"prerequisites": "Prerequisite: ECON 262 and either ECON 263 or STAT 272, completion of BTS-T, or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.668820+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.467055+00:00",
			"enroll": "13",
			"max": "15"
		},
		{
			"_updated": "2018-11-02T04:18:24.345085+00:00",
			"firstyear": null,
			"junior": null,
			"sophomore": null
		},
		{
			"_updated": "2020-09-18T15:03:50.279389+00:00",
			"max": 15
		},
		{
			"_updated": "2020-10-15T15:23:54.203477+00:00",
			"learningmode": null
		},
		{
			"_updated": "2021-03-02T16:51:31.750754+00:00",
			"max": 17
		},
		{
			"_updated": "2025-10-11T21:36:17.239287+00:00",
			"gereqs": [
				"EIN",
				"WRI"
			]
		}
	],
	"semester": 3,
	"sophomore": "0/0",
	"status": "C",
	"term": 20143,
	"title": "Economics of Public Policy",
	"type": "Research",
	"year": 2014
}
