{
	"clbid": "0000095789",
	"credits": 1.0,
	"crsid": "0000000454",
	"department": "BI/ES",
	"description": [
		"Conservation biology focuses on the study of biological diversity. Students examine why people should be concerned about the number and types of species on earth, what factors threaten the survival of species, and how people can conserve them. Using principles of ecology and evolution, with input from other disciplines, students gain a better understanding of the impact of humans on biodiversity and the importance of responsible environmental decision-making. Offered annually. Prerequisite: one natural science course."
	],
	"enrolled": 25,
	"gereqs": [
		"IST"
	],
	"instructors": [
		"Diane K. Angell"
	],
	"level": 200,
	"locations": [
		"RNS 208"
	],
	"max": 24,
	"name": "Conservation Biology",
	"notes": [
		"Prerequisite: one natural science course."
	],
	"number": 226,
	"pn": false,
	"prerequisites": "one natural science course.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.571067+00:00",
			"desc": "Conservation biology focuses on the study of biological diversity. Students examine why people should be concerned about the number and types of species on earth, what factors threaten the survival of species, and how people can conserve them. Using principles of ecology and evolution, with input from other disciplines, students gain a better understanding of the impact of humans on biodiversity and the importance of responsible environmental decision-making. Prerequisite: one natural science course. Offered annually.",
			"prerequisites": "Prerequisite: one natural science course. Offered annually."
		},
		{
			"_updated": "2018-02-02T23:59:39.224529+00:00",
			"prerequisites": "Prerequisite: one natural science course."
		},
		{
			"_updated": "2018-07-12T16:51:23.648608+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.442456+00:00",
			"enroll": "25",
			"max": "24"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2014
}
