{
	"clbid": "0000095842",
	"credits": 1.0,
	"crsid": "0000000295",
	"department": "CSCI",
	"description": [
		"The software we design has real effects in people's lives. This course explores the ethical and social considerations inherent in computer-based systems, develops skills in thinking about those considerations and in collecting data to determine their effects, and expands students' abilities to integrate these issues and skills into software development procedures, largely through an extensive team analysis of a \"live\" software project. Coursework uses extended case studies and surveys topics such as professional and ethical responsibilities, risk, liability, intellectual property, privacy, and computer crime. Offered annually. Prerequisites: CSCI 251 and completion of BTS-T, or permission of instructor."
	],
	"enrolled": 20,
	"firstyear": "0/0",
	"gereqs": [
		"EIN",
		"ORC"
	],
	"instructors": [
		"Charles Huff"
	],
	"learningmode": "S",
	"level": 200,
	"max": 19,
	"name": "Ethical Iss: Software",
	"notes": [
		"Prerequisite: Completion of BTS-T or permission of instructor."
	],
	"number": 263,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "RNS 204",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "RNS 204",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: CSCI 251 and completion of BTS-T, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.634601+00:00",
			"desc": "The software we design has real effects in people's lives. This course explores the ethical and social considerations inherent in computer-based systems, develops skills in thinking about those considerations and in collecting data to determine their effects, and expands students' abilities to integrate these issues and skills into software development procedures, largely through an extensive team analysis of a \"live\" software project. Coursework uses extended case studies and surveys topics such as professional and ethical responsibilities, risk, liability, intellectual property, privacy, and computer crime. Prerequisites: CSCI 251 and completion of BTS-T, or permission of instructor. Offered annually.",
			"prerequisites": "Prerequisites: CSCI 251 and completion of BTS-T, or permission of instructor. Offered annually."
		},
		{
			"_updated": "2018-07-12T16:51:23.677125+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.477409+00:00",
			"enroll": "20",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:24.360004+00:00",
			"firstyear": null
		},
		{
			"_updated": "2020-09-18T15:03:50.285241+00:00",
			"max": 18
		},
		{
			"_updated": "2020-10-15T15:23:54.208961+00:00",
			"learningmode": null
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"title": "Ethical Issues in Software Design",
	"type": "Research",
	"year": 2014
}
