{
	"clbid": 95990,
	"credits": 1.0,
	"crsid": 46,
	"departments": [
		"ART"
	],
	"description": [
		"In this intermediate photography course, students explore a variety of techniques and topics. Techniques include historic processes such as cyanotype and salted paper printing, digital photography, large-scale color printing, and traditional black and white photography. Students investigate experimental approaches and non-traditional forms for presentation, and they investigate photography from broad historical, aesthetic, and social perspectives. This course includes field trips, readings, discussion, and slide presentations. Materials fee. Offered annually. Counts toward media studies concentration. Prerequisite: ART 104 or ART 205, or permission of instructor."
	],
	"enroll": 11,
	"instructors": [
		"Margaret Ojala"
	],
	"level": 200,
	"locations": [
		"CAD 102",
		"CAD 102"
	],
	"max": 12,
	"name": "Intermed Photography",
	"number": 238,
	"pn": false,
	"prerequisites": "ART 104 or ART 205, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:57.484879+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T15:05:06.771021+00:00",
			"desc": "In this intermediate photography course, students explore a variety of techniques and topics. Techniques include historic processes such as cyanotype and salted paper printing, digital photography, large-scale color printing, and traditional black and white photography. Students investigate experimental approaches and nontraditional forms for presentation, and they investigate photography from broad historical, aesthetic, and social perspectives. This course includes field trips, readings, discussion, and slide presentations. Prerequisite: ART 104 or ART 205, or permission of instructor. Materials fee. Offered annually. Counts toward media studies concentration.",
			"prerequisites": "Prerequisite: ART 104 or ART 205, or permission of instructor. Materials fee. Offered annually. Counts toward media studies concentration."
		},
		{
			"_updated": "2017-05-30T15:51:49.568726+00:00",
			"locations": [
				"DC 102",
				"DC 102"
			]
		},
		{
			"_updated": "2018-02-02T23:59:39.407060+00:00",
			"prerequisites": "Prerequisite: ART 104 or ART 205, or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.748472+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.565241+00:00",
			"enroll": "11",
			"max": "12"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"T 1145-0245PM",
		"Th 1245-0345PM"
	],
	"title": "Intermediate Photography",
	"type": "Research",
	"year": 2014
}
