{
	"clbid": "0000095605",
	"credits": 1.0,
	"crsid": "0000001113",
	"department": "PSCI",
	"description": [
		"This course explores the diverse modes of inquiry in the discipline of political science. Broadly centered around the question, \"How do you know?,\" students focus on different methods of locating and collecting data, reviewing political texts and contested concepts, and constructing theoretical explanations of political phenomena. Offered each semester. Counts toward environmental studies major (social science track). Prerequisite: one previous course in department. Non-majors may register with permission of instructor."
	],
	"enrolled": 22,
	"instructors": [
		"Christopher B. Chapp"
	],
	"learningmode": "S",
	"level": 200,
	"max": 22,
	"name": "Analyzing Politics",
	"number": 220,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "OM 020",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "OM 020",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "OM 020",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": "one previous course in department. Non-majors may register with permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.395247+00:00",
			"desc": "This course explores the diverse modes of inquiry in the discipline of political science. Broadly centered around the question, \"How do you know?,\" students focus on different methods of locating and collecting data, reviewing political texts and contested concepts, and constructing theoretical explanations of political phenomena. Prerequisite: one previous course in department. Offered each semester. Counts toward environmental studies major (social science track). Non-majors may register with permission of instructor.",
			"prerequisites": "Prerequisite: one previous course in department. Offered each semester. Counts toward environmental studies major (social science track). Non-majors may register with permission of instructor."
		},
		{
			"_updated": "2018-02-02T23:59:39.107327+00:00",
			"prerequisites": "Prerequisite: one previous course in department. Non-majors may register with permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.505111+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.327072+00:00",
			"enroll": "22",
			"max": "19"
		},
		{
			"_updated": "2020-09-18T15:03:50.205883+00:00",
			"max": 19
		},
		{
			"_updated": "2020-10-15T15:23:54.129074+00:00",
			"learningmode": null
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"title": "Analyzing Politics and Policies",
	"type": "Research",
	"year": 2014
}
