{
	"clbid": "0000095739",
	"credits": 1.0,
	"crsid": "0000000194",
	"department": "CHEM",
	"description": [
		"This course provides a sequential introduction to physical chemistry. Beginning with an introduction to statistical aspects of chemical equilibria, it explores the relationships between energy, entropy and equilibria (thermodynamics); oxidation-reduction reactions and electrochemistry; transitions between phases; and rates of reactions. Students attend three classes and one three-hour laboratory per week. Offered annually in the spring semester. Prerequisite: CHEM 125, or CHEM 121 and CHEM 123 and MATH 119 or MATH 120 or permission of instructor."
	],
	"enrolled": 26,
	"groupid": "0000000194",
	"instructors": [
		"Mary Walczak"
	],
	"learningmode": "S",
	"level": 100,
	"max": 46,
	"name": "Chemical Reactions",
	"notes": [
		"Students in Chem 126A, B, C, D, or E must also register for one Chem 126 lab"
	],
	"number": 126,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "RNS 390",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "RNS 390",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": "CHEM 125, or CHEM 121 and CHEM 123 and MATH 119 or MATH 120 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.532720+00:00",
			"desc": "This course provides a sequential introduction to physical chemistry. Beginning with an introduction to statistical aspects of chemical equilibria, it explores the relationships between energy, entropy and equilibria (thermodynamics); oxidation-reduction reactions and electrochemistry; transitions between phases; and rates of reactions. Students attend three classes and one three-hour laboratory per week. Prerequisite: CHEM 125, or CEHM 121 and CHEM 123 and MATH 119 or MATH 120 or permission of instructor. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: CHEM 125, or CEHM 121 and CHEM 123 and MATH 119 or MATH 120 or permission of instructor. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.194633+00:00",
			"prerequisites": "Prerequisite: CHEM 125, or CHEM 121 and CHEM 123 and MATH 119 or MATH 120 or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.627561+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.412285+00:00",
			"enroll": "26",
			"max": "46"
		},
		{
			"_updated": "2020-09-18T15:03:50.252898+00:00",
			"max": 46
		},
		{
			"_updated": "2020-10-15T15:23:54.176253+00:00",
			"learningmode": null
		},
		{
			"_updated": "2021-03-02T16:51:31.722816+00:00",
			"max": 56
		},
		{
			"_updated": "2025-10-11T21:36:17.216529+00:00",
			"gereqs": [
				"SED"
			]
		}
	],
	"section": "B",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"title": "Energies and Rates of Chemical Reactions",
	"type": "Research",
	"year": 2014
}
