{
	"clbid": "0000095655",
	"credits": 1.0,
	"crsid": "0000000712",
	"department": "LATIN",
	"description": [
		"In this two-course sequence students learn the basics of classical Latin. By studying the language's vocabulary, grammar, and syntax, they not only gain appreciation for its intricacies and nuances but also learn more about their own language and about language in general. Completion of both semesters equips students to translate almost any classical Latin text with the aid of a dictionary. Offered annually in the spring semester. Prerequisite: LATIN 111 or equivalent."
	],
	"enrolled": 14,
	"instructors": [
		"James May"
	],
	"level": 100,
	"max": 30,
	"name": "Beginning Latin II",
	"number": 112,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "TOH 312",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "TOH 312",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "TOH 312",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "LATIN 111 or equivalent.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.445563+00:00",
			"desc": "In this two-course sequence students learn the basics of classical Latin. By studying the language's vocabulary, grammar, and syntax, they not only gain appreciation for its intricacies and nuances but also learn more about their own language and about language in general. Completion of both semesters equips students to translate almost any classical Latin text with the aid of a dictionary. Prerequisite: LATIN 111 or equivalent. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: LATIN 111 or equivalent. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.134970+00:00",
			"prerequisites": "Prerequisite: LATIN 111 or equivalent."
		},
		{
			"_updated": "2018-07-12T16:51:23.530142+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.357045+00:00",
			"enroll": "14",
			"max": "30"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"type": "Research",
	"year": 2014
}
