{
	"clbid": 95802,
	"credits": 1.0,
	"crsid": 371,
	"departments": [
		"DANCE"
	],
	"description": "Students trace and integrate the African-American and Euro-American dance traditions of the late 19th, 20th, and early 21st centuries, paying attention to their similarities and differences.The focus is on the theatrical dance genres of ballet, modern, and jazz (includes social dance, tap, and some musical theatre dance). At the same time, the course attends to the economic, religious, political, and social forces that have affected the development of dance in the United States. No dance experience required. Ticket/transportation fee required. Offered annually in the spring semester. Counts toward race and ethnic studies, American studies, and women's and gender studies majors and race and ethnic studies and women'sand gender studies concentrations.",
	"gereqs": [
		"ALS-A",
		"MCD",
		"WRI"
	],
	"instructors": [
		"Gabriel R. Anderson"
	],
	"level": 200,
	"locations": [
		"CAD 305"
	],
	"name": "Dance in United States",
	"number": 246,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.580668+00:00",
			"desc": "Students trace and integrate the African-American and Euro-American dance traditions of the late 19th, 20th, and early 21st centuries, paying attention to their similarities and differences. The focus is on the theatrical dance genres of ballet, modern, and jazz (includes social dance, tap, and some musical theatre dance). At the same time, the course attends to the economic, religious, political, and social forces that have affected the development of dance in the United States. No dance experience required. Ticket/transportation fee required. Offered annually in the spring semester. Counts towards race and ethnic studies, American studies, and women's and gender studies majors and race and ethnic studies and women's and gender studies concentrations."
		},
		{
			"_updated": "2017-05-30T15:51:49.514178+00:00",
			"locations": [
				"DC 305"
			]
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 0905-1000"
	],
	"title": "Dance in the United States",
	"type": "Research",
	"year": 2014
}
