{
	"clbid": "0000095840",
	"credits": 1.0,
	"crsid": "0000000982",
	"department": "PHIL",
	"description": [
		"Valuing nature raises significant philosophical and ethical issues. This course considers the nature of animal life, the character and control of pollution, the conflict between preservationism and conservationism, corporate and governmental responsibility for the eco-crisis, the use of economic categories to assess wilderness areas and endangered species, the conflict between eco-holism and individualism, and the philosophy of wilderness management. Offered annually. Counts toward environmental studies major (all tracks) and concentration. Prerequisite: completion of BTS-T or permission of instructor."
	],
	"enrolled": 52,
	"firstyear": "34/24",
	"gereqs": [
		"EIN",
		"WRI"
	],
	"instructors": [
		"Charles Taliaferro"
	],
	"level": 200,
	"max": 35,
	"name": "Environmental Ethics",
	"notes": [
		"Prerequisite: Completion of BTS-T or permission of instructor.",
		"Open only to seniors and a limited number of juniors during web registration."
	],
	"number": 257,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "HH 307",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "HH 307",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": "completion of BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.631261+00:00",
			"desc": "Valuing nature raises significant philosophical and ethical issues. This course considers the nature of animal life, the character and control of pollution, the conflict between preservationism and conservationism, corporate and governmental responsibility for the eco-crisis, the use of economic categories to assess wilderness areas and endangered species, the conflict between eco-holism and individualism, and the philosophy of wilderness management. Prerequisite: completion of BTS-T or permission of instructor. Offered annually. Counts toward environmental studies major (all tracks) and concentration.",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor. Offered annually. Counts toward environmental studies major (all tracks) and concentration."
		},
		{
			"_updated": "2018-02-02T23:59:39.268542+00:00",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.675307+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.475217+00:00",
			"enroll": "52",
			"max": "35"
		},
		{
			"_updated": "2018-10-19T04:12:25.728651+00:00",
			"firstyear": null,
			"sophomore": null
		}
	],
	"section": "B",
	"semester": 3,
	"sophomore": "14/11",
	"status": "C",
	"term": 20143,
	"type": "Research",
	"year": 2014
}
