{
	"clbid": "0000095751",
	"credits": 1.0,
	"crsid": "0000000952",
	"department": "NURS",
	"description": [
		"This course explores health problems of children requiring medical or surgical care. Students integrate knowledge of developmental, transcultural, and communication theories in the care of children from infancy through adolescence. Trends and issues related to family-centered health care are explored. Students further develop the roles of educator, collaborator, advocate, and caregiver. A variety of pediatric clinical settings, as well as simulation, are utilized. Offered annually in the spring semester. Prerequisite: NURS 336 or concurrent registration."
	],
	"enroll": 24,
	"instructors": [
		"Nicole B. Beckmann"
	],
	"level": 300,
	"locations": [
		"HH 301"
	],
	"max": 24,
	"name": "Child Health",
	"notes": [
		"Open to Nursing majors only.",
		"Will also meet T/Th 7:00 a.m. - 3:00 p.m. in HH 215 or HH 204."
	],
	"number": 338,
	"pn": false,
	"prerequisites": "NURS 336 or concurrent registration.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.543963+00:00",
			"desc": "This course explores health problems of children requiring medical or surgical care. Students integrate knowledge of developmental, transcultural, and communication theories in the care of children from infancy through adolescence. Trends and issues related to family-centered health care are explored. Students further develop the roles of educator, collaborator, advocate, and caregiver. A variety of pediatric clinical settings, as well as simulation, are utilized. Prerequisite: NURS 336 or concurrent registration. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: NURS 336 or concurrent registration. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.201743+00:00",
			"prerequisites": "Prerequisite: NURS 336 or concurrent registration."
		},
		{
			"_updated": "2018-07-12T16:51:23.633729+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.420893+00:00",
			"enroll": "24",
			"max": "24"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1045-1140"
	],
	"type": "Research",
	"year": 2014
}
