{
	"clbid": "0000095756",
	"credits": 0.5,
	"crsid": "0000000844",
	"department": "MUSIC",
	"description": [
		"This course is a study of the smaller forms of choral music from the Renaissance to the present with an emphasis on music suitable for junior and senior high school and church choirs. Students study scores and recordings and discuss representative style features and characteristics, interpretation, and conducting problems. Offered annually in the spring semester. Prerequisites: MUSIC 214, MUSIC 241, and MUSIC 242 and junior standing."
	],
	"enrolled": 12,
	"instructors": [
		"Christopher P. Aspaas"
	],
	"level": 200,
	"max": 15,
	"name": "Choral Lit I",
	"number": 287,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "CHM 233",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "CHM 233",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "CHM 233",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: MUSIC 214, MUSIC 241, and MUSIC 242 and junior standing.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.546629+00:00",
			"desc": "This course is a study of the smaller forms of choral music from the Renaissance to the present with an emphasis on music suitable for junior and senior high school and church choirs. Students study scores and recordings and discuss representative style features and characteristics, interpretation, and conducting problems. Prerequisites: MUSIC 214, MUSIC 241, and MUSIC 242 and junior standing. Offered annually in the spring semester.",
			"prerequisites": "Prerequisites: MUSIC 214, MUSIC 241, and MUSIC 242 and junior standing. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-07-12T16:51:23.635364+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.424107+00:00",
			"enroll": "12",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"title": "Choral Literature I",
	"type": "Research",
	"year": 2014
}
