{
	"clbid": 95815,
	"credits": 0.5,
	"crsid": 336,
	"departments": [
		"EDUC"
	],
	"description": [
		"Future teachers identify and acquire skills to serve exceptional students more effectively in the regular classroom. Students read and discuss to expand their knowledge of the broad spectrum of resources available for students with disabilities, second language learners, and those labeled \"at-risk.\" Historical perspectives as well as inclusion, collaboration, curriculum development, and other current topics are included. Offered each semester. Prerequisite: EDUC 290 or permission of instructor."
	],
	"enroll": 27,
	"instructors": [
		"Heather Campbell"
	],
	"level": 300,
	"locations": [
		"TOH 214"
	],
	"max": 30,
	"name": "Differentiated Instruct",
	"number": 375,
	"pn": false,
	"prerequisites": "EDUC 290 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.596618+00:00",
			"desc": "Future teachers identify and acquire skills to serve exceptional students more effectively in the regular classroom. Students read and discuss to expand their knowledge of the broad spectrum of resources available for students with disabilities, second language learners, and those labeled \"at-risk.\" Historical perspectives as well as inclusion, collaboration, curriculum development, and other current topics are included. Prerequisite: EDUC 290 or permission of instructor. Offered each semester.",
			"prerequisites": "Prerequisite: EDUC 290 or permission of instructor. Offered each semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.241809+00:00",
			"prerequisites": "Prerequisite: EDUC 290 or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.659262+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.455278+00:00",
			"enroll": "27",
			"max": "30"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"Th 0800-0920"
	],
	"title": "Differentiated Instruction for Exceptional Learners",
	"type": "Research",
	"year": 2014
}
