{
	"clbid": "0000103313",
	"credits": 1.0,
	"crsid": "0000027929",
	"department": "AS/ES",
	"description": [
		"Students investigate community-based approaches to environmental sustainability during this Interim course taught at the Asian Rural Institute (ARI) in northern Japan. Students explore how ARI builds on local Japanese resources to support its mission of training rural leaders from developing countries in organic agricultural practices. Activities include field trips, discussions, and symposia with Japanese students, as well as hands-on participation in the daily food life at ARI. Counts toward Asian studies and Environmental studies majors and concentrations and Japan studies concentration. Offered during Interim. Prerequisites: preference given to students with prior coursework in either Asian Studies or Environmental Studies."
	],
	"enrolled": 21,
	"instructors": [
		"Katherine S. Tegtmeyer Pak"
	],
	"learningmode": "S",
	"level": 200,
	"max": 20,
	"name": "Environmental Sustainability Japan",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 277,
	"pn": false,
	"prerequisites": "Prerequisites: preference given to students with prior coursework in either Asian Studies or Environmental Studies.",
	"revisions": [
		{
			"_updated": "2015-10-13T17:00:23.926172+00:00",
			"grouptype": "R",
			"status": "O"
		},
		{
			"_updated": "2015-10-22T17:00:40.947823+00:00",
			"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title."
		},
		{
			"_updated": "2015-11-03T17:38:12.127118+00:00",
			"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title. This course includes an academic civic engagement (ACE) component."
		},
		{
			"_updated": "2016-01-30T14:54:41.559557+00:00",
			"desc": "Students investigate community-based approaches to environmental sustainability during this Interim course taught at the Asian Rural Institute (ARI) in northern Japan. Students explore how ARI builds on local Japanese resources to support its mission of training ruralleaders from developing countries in organic agricultural practices. Activities include fieldtrips, discussions, and symposia with Japanese students, as well as hands-on participation in thedaily food life at ARI. Prerequisites: preference given to students with prior coursework in eitherAsian studies or environmental studies. Counts toward Asian studies and environmental studiesmajors and concentrations and Japan studies concentration. Offered during Interim.",
			"prerequisites": "Prerequisites: preference given to students with prior coursework in eitherAsian studies or environmental studies. Counts toward Asian studies and environmental studiesmajors and concentrations and Japan studies concentration. Offered during Interim."
		},
		{
			"_updated": "2018-07-12T16:51:30.187383+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.090557+00:00",
			"enroll": "21",
			"max": "20"
		},
		{
			"_updated": "2020-10-15T15:23:56.933626+00:00",
			"learningmode": null
		},
		{
			"_updated": "2023-08-09T02:31:16.717587+00:00",
			"instructors": [
				"Katherine S. Tegtmeyer Pak"
			]
		},
		{
			"_updated": "2023-12-20T02:11:44.666721+00:00",
			"instructors": [
				"Kathy S. Tegtmeyer Pak"
			]
		},
		{
			"_updated": "2025-10-11T21:36:19.676113+00:00",
			"gereqs": [
				"MCG"
			]
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"title": "Environmental Sustainability in Japan",
	"type": "Research",
	"year": 2015
}
