{
	"clbid": "0000103116",
	"credits": 1.0,
	"crsid": "0000027945",
	"department": "SOAN",
	"description": [
		"Urban sociology investigates the complex interactions of human beings in cities. Among the topics include neighborhood formation, social stratification along lines of religion, class, and race/ethnicity, and city governance. Chicago will serve as an important case study for considering these urban dynamics. Students interested in public policy, social work, and economics will be particularly welcome in the course, along with anyone else interested in city life. Counts toward race and ethnic studies major and concentration."
	],
	"enrolled": 19,
	"instructors": [
		"David C. Schalliol"
	],
	"level": 200,
	"max": 18,
	"name": "Top: Urban Sociology",
	"number": 296,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "TOH 108",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "TOH 108",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "TOH 108",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.842129+00:00",
			"grouptype": "R",
			"locations": null
		},
		{
			"_updated": "2015-04-28T23:00:25.471082+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:51.577805+00:00",
			"desc": "This course explores the relationship between thought and society and examines how \"reality\" and \"truth\" develop from social practices, including the position from which sociology itself speaks. This relation is central to the meaning of sociology and its implicit critique of other disciplines' claims to truth, such as philosophy and the physical sciences. Students examine how sociology challenges the very idea of what knowledge is. It challenges the hypothesis that knowledge is not ultimately a transcendental thing that exists independently of social practice, but it is something produced in and by such practice. Prerequisite: SOAN 291.",
			"prerequisites": "Prerequisite: SOAN 291.",
			"title": "Top: Soc of Knowledge"
		},
		{
			"_updated": "2018-07-12T16:51:27.807652+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.715848+00:00",
			"enroll": "19",
			"max": "18"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"type": "Research",
	"year": 2015
}
