{
	"clbid": "0000103278",
	"credits": 1.0,
	"crsid": "0000000626",
	"department": "HIST",
	"description": [
		"From its beginnings in Mediterranean antiquity, the city has been a marker of civilization to the extent that urban life was equated with what it meant to be fully human. Medieval Cities of Europe explores what it meant to be \"fully human\" in urban environments from the autumn of the Roman Empire to the dawn of the early modern global economy. Along the way, students will analyze the opportunities and challenges that urban dwellers faced in revived Roman cities and new towns that arose ad hoc. Readings and exercises will be aimed at looking at cities through the eyes of a wide variety of inhabitants, from administrator-bishops to prostitutes, guild merchants to hucksters. Students will also be introduced to town planning thorough digital mapping exercises, the organization of cities through group role-playing, and modern-day portrayals of medieval environments through film criticism."
	],
	"enrolled": 14,
	"instructors": [
		"Kevin Mummey"
	],
	"learningmode": "S",
	"level": 200,
	"max": 30,
	"name": "Top: Medieval Cities",
	"number": 299,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "OM 030",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "OM 030",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-07-17T23:00:24.048909+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-10-01T17:01:01.215966+00:00",
			"locations": null,
			"times": null
		},
		{
			"_updated": "2016-01-30T14:55:44.871316+00:00",
			"desc": "This course offers selected surveys in historical studies. Topics depend on instructor. Recent topics have included \"Women in Early America,\" \"U.S.-Latin American Relations,\" and \"Doing Public History.\" May be repeated if topics are different. Offered periodically."
		},
		{
			"_updated": "2018-07-12T16:51:32.265341+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.341155+00:00",
			"enroll": "14",
			"max": "30"
		},
		{
			"_updated": "2020-10-15T15:23:58.090210+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:20.677771+00:00",
			"gereqs": [
				"HWC"
			]
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20153,
	"title": "Topics in History",
	"type": "Topic",
	"year": 2015
}
