{
	"clbid": "0000103081",
	"credits": 1.0,
	"crsid": "0000027698",
	"department": "STAT",
	"description": [
		"This course engages students with the material in STAT 212 in greater depth and breadth. Topics such as bootstrapping and multiple regression will be introduced in addition to core material from STAT 212. No previous experiences with statistics is assumed; this course provides an introduction to statistics, but it can also be taken by students coming from STAT 110, ECON 263, or AP Statistics who would like a transition into the statistics concentration. Counts toward environmental studies major (social science emphasis), exercise science major, and mathematical biology concentration. Prerequisites: MATH 119 or MATH 120 or equivalent, or CSCI 125, or some previous statistics (e.g., AP Statistics or STAT 110 or ECON 263)."
	],
	"enrolled": 24,
	"gereqs": [
		"AQR"
	],
	"instructors": [
		"Paul J. Roback"
	],
	"level": 200,
	"locations": [
		"TOH 182"
	],
	"max": 24,
	"name": "Honors Stats for Science",
	"notes": [
		"This course has class-year limits."
	],
	"number": 214,
	"pn": false,
	"prerequisites": "Prerequisites: MATH 119 or MATH 120 or equivalent, or CSCI 125, or some previous statistics (e.g., AP Statistics or STAT 110 or ECON 263).",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.484807+00:00",
			"grouptype": "R"
		},
		{
			"_updated": "2015-08-27T23:00:22.210927+00:00",
			"section": "A",
			"times": [
				"MWF 1150-1245PM"
			]
		},
		{
			"_updated": "2015-11-17T00:00:44.328113+00:00",
			"section": null,
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.827246+00:00",
			"desc": "This course engages students with the material in STAT 212 in greater depth and breadth. Topics such as bootstrapping and multiple regression will be introduced in addition to core material from STAT 212. No previous experiences with statistics is assumed; this course provides an introduction to statistics, but it can also be taken by students coming from STAT 110, ECON 263, or AP Statistics who would like a transition into the statistics concentration. Counts toward mathematical biology concentration. Prerequisites: MATH 119 or MATH 120 or equivalent, or CSCI125, or some previous statistics (e.g., AP Statistics or STAT 110 or ECON 263).",
			"prerequisites": "Prerequisites: MATH 119 or MATH 120 or equivalent, or CSCI125, or some previous statistics (e.g., AP Statistics or STAT 110 or ECON 263)."
		},
		{
			"_updated": "2018-07-12T16:51:32.245776+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.314875+00:00",
			"enroll": "24",
			"max": "24"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0905-1000"
	],
	"title": "Honors Statistics for the Sciences",
	"type": "Research",
	"year": 2015
}
