{
	"clbid": "0000103361",
	"credits": 1.0,
	"crsid": "0000000641",
	"department": "HIST",
	"description": [
		"How do societies collectively remember, and how do they forget? Why do some events and figures from the past loom large in the collective imagination and are memorialized in museums, monuments, literature, film and song, while others of equal importance slip into oblivion? This seminar focuses both on the why of collective remembering and forgetting, as well on the mechanisms by which memories are transmitted over the generations. While some of the literature and specific case studies refer to Latin America, the topics and theoretical literature are broad in scope and can be applied to any geographical region. This course is suitable for students specializing in any of the sub-fields offered by the History Department."
	],
	"enrolled": 11,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Jeane DeLaney"
	],
	"level": 300,
	"locations": [
		"RML 420",
		"RML 420"
	],
	"max": 17,
	"name": "Sem: History and Memory",
	"notes": [
		"Especially for junior and senior history majors and Latin American studies major",
		"majors. Others need permission of instructor."
	],
	"number": 397,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-20T23:00:32.305817+00:00",
			"locations": null
		},
		{
			"_updated": "2015-08-07T17:00:28.689593+00:00",
			"gereqs": null
		},
		{
			"_updated": "2015-09-25T05:01:07.085713+00:00",
			"locations": [
				"TOH 200",
				"TOH 200"
			]
		},
		{
			"_updated": "2015-10-28T23:00:51.692769+00:00",
			"notes": null
		},
		{
			"_updated": "2016-01-30T14:55:44.892054+00:00",
			"desc": "Rather than focus on a region or period of time, we will look at how historians from many different fields explore and understand \"everyday life.\" What do historians have to say about eating, work, rumors, fear, night, noise, bingo, and more? What sources do they use for this research? What significance do we find in these histories of everyday life? Much of this study is defined by changes in social and cultural history, with an emphasis on local and micro-histories. Students will produce a substantial research paper, based on primary sources and focused on a theme or problem related to histories of everyday life. Seniors are welcome. Juniors especially are encouraged to consider this course, especially those considering academic internships, participation in the summer undergraduate research program, or distinction. Not offered in 2014-15."
		},
		{
			"_updated": "2018-07-12T16:51:32.273571+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.352530+00:00",
			"enroll": "11",
			"max": "17"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"title": "History Research Workshop",
	"type": "Seminar",
	"year": 2015
}
