{
	"clbid": 103247,
	"credits": 1.0,
	"crsid": 130,
	"departments": [
		"BIO"
	],
	"description": [
		"This course traces the path of invertebrate evolution from single-celled protozoans to the most primitive chordates. Emphasis is placed upon major breakthroughs in design that enable organisms to exploit new ecological habitats. Laboratories are designed to introduce students to the major invertebrate groups via observation of living animals and through dissection. Students attend lectures plus one three-hour laboratory per week. Counts as \"comparative organismal biology\" core category. Counts toward neuroscience concentration. Prerequisites: BIO 150 or BIO 126."
	],
	"groupid": 130,
	"instructors": [
		"Emily Mohl"
	],
	"level": 200,
	"locations": [
		"RNS 206",
		"RNS 206"
	],
	"name": "Invertebrate Biology",
	"notes": [
		"Students in BIO 248 must also register for 248 lab. This course has class-year",
		"limits. FY students may register after web registration with the permission of",
		"instructor. This course has field trips. This course includes an ACE component."
	],
	"number": 248,
	"pn": false,
	"prerequisites": "Prerequisites: BIO 150 or BIO 126.",
	"revisions": [
		{
			"_updated": "2015-08-25T17:00:16.662132+00:00",
			"locations": null,
			"notes": "Students in BIO 248 must also register for BIO 248 lab.",
			"times": null
		},
		{
			"_updated": "2015-09-29T17:00:39.777612+00:00",
			"notes": "Students in BIO 248 must also register for BIO 248 lab. Not open to first-year students. This course has field trips."
		},
		{
			"_updated": "2015-09-29T23:01:04.820330+00:00",
			"locations": [
				"TBA",
				"TBA"
			],
			"notes": "Students in BIO 248 must also register for BIO 248 lab. Not open to first-year students. This course has class-year limits. This course has field trips."
		},
		{
			"_updated": "2015-10-22T17:00:40.908736+00:00",
			"notes": "Students in BIO 248 must also register for BIO 248 lab. This course has class-year limits. First-year students may register after web registration with the permission of instructor. This course has field trips."
		},
		{
			"_updated": "2015-11-10T00:00:40.263005+00:00",
			"status": "O"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-Th 0900-1000",
		"M-Th 1040-1200PM"
	],
	"type": "Research",
	"year": 2015
}
