{
	"clbid": 103170,
	"credits": 1.0,
	"crsid": 297,
	"depts": [
		"CSCI"
	],
	"desc": "Students study features commonly found in computer programming languages and construct their own interpreters for an example programming language incorporating various language features they study throughout the course. Topics include programming language semantics, programming language translation, parsing, implementation of control structures and memory structures, abstraction mechanisms, and language translation systems and types. Offered alternate years. Counts toward linguistic studies and management studies concentrations. Prerequisites: CSCI 241 and CSCI 251, or permission of instructor.",
	"instructors": [
		"Richard Allen"
	],
	"level": 200,
	"locations": [
		"RNS 203",
		"RNS 203"
	],
	"name": "Programming Languages",
	"notes": "Open only to declared Computer Science majors.",
	"num": 276,
	"pf": false,
	"prerequisites": "Prerequisites: CSCI 241 and CSCI 251, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-14T00:40:53.587873-05:00",
			"times": [
				"T 0935-1100",
				"Th 0930-1050"
			]
		},
		{
			"_updated": "2015-11-06T18:01:31.305349-06:00",
			"notes": null
		},
		{
			"_updated": "2015-11-11T18:01:28.154345-06:00",
			"status": "O"
		},
		{
			"_updated": "2015-11-16T18:00:44.500274-06:00",
			"section": null
		},
		{
			"_updated": "2015-12-15T00:01:54.836734-06:00",
			"status": "C"
		},
		{
			"_updated": "2016-01-30T08:55:44.852671-06:00",
			"desc": "Students study features commonly found in computer programming languages and construct their own interpreters for an example programming language incorporating various language features they study throughout the course. Topics include programming language semantics, programming language translation, parsing, implementation of control structures and memory structures, abstraction mechanisms, and language translation systems and types. Offered alternate years. Counts toward linguistic studies concentration. Prerequisites: CSCI 241 and CSCI 251, or permission of instructor."
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"type": "Research",
	"year": 2015
}
