{
	"clbid": 103154,
	"credits": 1.0,
	"crsid": 29234,
	"departments": [
		"ART"
	],
	"description": "Through the study of Gothic art and architecture in 12-14th-century Europe and in 19th-century Europe and America, students explore how cultures devise and give meaning to artistic styles. Students also investigate the origins of the term Gothic and its meanings in popular culture. This course is taught by a St. Olaf and a Carleton professor and is offered to students on both campuses. Class meetings alternate between campuses, and enrolled students receive transportation stipends. Counts toward art history, medieval studies, and studio art majors Offered periodically in the fall semester.",
	"gereqs": [
		"ALS-A",
		"HWC"
	],
	"instructors": [
		"Nancy M. Thompson"
	],
	"level": 200,
	"locations": [
		"DC 305"
	],
	"name": "The Gothic and Gothic Revival",
	"notes": "This course meets from September 14 - November 18. Team taught with Prof. Jarman from Carleton College.",
	"number": 273,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-25T23:19:11.857337-05:00",
			"grouptype": "R"
		},
		{
			"_updated": "2015-05-06T18:00:23.617760-05:00",
			"status": "O"
		},
		{
			"_updated": "2015-08-06T18:00:30.078420-05:00",
			"status": "C"
		},
		{
			"_updated": "2015-09-22T23:33:20.346974-05:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:51.594600-06:00",
			"desc": "Through the study of Gothic art and architecture in 12-14th-century Europe and in 19th-century Europe and America, students explore how cultures devise and give meaning to artistic styles. Students also investigate the origins of the term Gothic and its meanings in popular culture. This course is taught by a St. Olaf and a Carleton professor and is offered to students on both campuses. Class meetings alternate between campuses, and enrolled students receive transportation stipends. Counts toward art history and studio art majors. Offered intermittenly during fall."
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"TTh 0900-1050"
	],
	"title": "Religion, Royalty & Romantics: The Gothic and Gothic Revival",
	"type": "Research",
	"year": 2015
}
