{
	"clbid": 103438,
	"credits": 1.0,
	"crsid": 17594,
	"departments": [
		"PSYCH"
	],
	"description": "This seminar investigates \"the good life,\" exploring what psychology can tell us about human flourishing and psychological well-being. Empirical evidence is examined to understand some of the best aspects of life, such as the function of positive emotions, the role of traits in well-being, sources of meaning and life satisfaction, and character strength and virtue. Personality and sociocultural factors are emphasized in this exploration of the positive potentials of human life. Offered periodically. Counts toward management studies concentration. Prerequisites: PSYCH 230, plus PSYCH 244 or PSYCH 249.",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"McMillan Donna K."
	],
	"level": 300,
	"locations": [
		"RNS 124",
		"RNS 124"
	],
	"name": "Positive Psychology",
	"number": 342,
	"pn": false,
	"prerequisites": "Prerequisites: PSYCH 230, plus PSYCH 244 or PSYCH 249.",
	"revisions": [
		{
			"_updated": "2015-05-12T12:00:25.453855-05:00",
			"gereqs": null,
			"locations": [
				"RNS 190",
				"RNS 190"
			]
		},
		{
			"_updated": "2015-09-22T23:33:15.712764-05:00",
			"instructors": [
				"Donna McMillan"
			]
		},
		{
			"_updated": "2015-11-11T18:01:28.366144-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:44.899660-06:00",
			"desc": "This seminar investigates \"the good life,\" exploring what psychology can tell us about human flourishing and psychological well-being. Empirical evidence is examined to understand some of the best aspects of life, such as the function of positive emotions, the role of traits in well-being, sources of meaning and life satisfaction, and character strength and virtue. Personality and sociocultural factors are emphasized in this exploration of the positive potentials of human life. Offered periodically. Prerequisites: PSYCH 230, plus PSYCH 244 or PSYCH 249."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"title": "Positive Psychology: The Science of Optimal Human Experience",
	"type": "Research",
	"year": 2015
}
