{
	"clbid": "0000103037",
	"credits": 1.0,
	"crsid": "0000018522",
	"department": "PHIL",
	"description": [
		"An advanced introduction to moral philosophy emphasizing normative theories, the foundations of morality (metaethics), and moral reasoning. Normative theories (e.g. virtue ethics, deontologica lethics, theological ethics, and utilitarianism) explore the nature of the good and the difference between right and wrong. Metaethics concerns the origins and objectivity of moral judgments, studying moral relativism, moral subjectivism, divine command theory, and ideal observe rtheories. Students explore moral reasoning in theory and practice using contemporary moral issues as examples. Offered periodically. Prerequisites: one course in philosophy and completion of BTS-T or permission of instructor."
	],
	"enroll": 18,
	"gereqs": [
		"EIN",
		"WRI"
	],
	"instructors": [
		"Michael Fuerstein"
	],
	"level": 200,
	"locations": [
		"TOH 316"
	],
	"max": 19,
	"name": "Moral Theory",
	"notes": [
		"Prerequisites: one course in philosophy and completion of BTS-T or permission",
		"of the instructor. Open only to juniors and seniors during web registration."
	],
	"number": 278,
	"pn": false,
	"prerequisites": "Prerequisites: one course in philosophy and completion of BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.795874+00:00",
			"locations": [
				"HH 516"
			]
		},
		{
			"_updated": "2015-09-28T23:00:48.197797+00:00",
			"locations": [
				"OM 030"
			]
		},
		{
			"_updated": "2015-11-07T06:02:16.635411+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-12T00:01:27.536025+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.789573+00:00",
			"desc": "An advanced introduction to moral philosophy emphasizing normative theories, the foundations of morality (metaethics), and moral reasoning. Normative theories (e.g. virtue ethics, deontologica lethics, theological ethics, and utilitarianism) explore the nature of the good and the difference between right and wrong. Metaethics concerns the origins and objectivity of moral judgments, studying moral relativism, moral subjectivism, divine command theory, and ideal observe rtheories. Students explore moral reasoning in theory and practice using contemporary moral issues as examples. Offered most years. Prerequisites: one course in philosophy and completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:32.227229+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.289680+00:00",
			"enroll": "18",
			"max": "19"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2015
}
