{
	"clbid": 103011,
	"credits": 1.0,
	"crsid": 516,
	"departments": [
		"GERM"
	],
	"description": [
		"Students examine expository texts such as (auto)biographical writings, journalistic articles, German websites, and critical essays, with an eye to understanding the strategic organization of the text, the information presented, and the various layers of critical voices in a text. Coursework includes weekly writing assignments on the analysis of structure, style, argumentation, evidence, and perspective in a text. The course is designed to teach students writing strategies and the final project is a short paper written in German. Taught in German. Counts toward German major, German studies concentration, and management studies concentration. Prerequisite: GERM 232 or equivalent."
	],
	"enroll": 3,
	"gereqs": [
		"FOL-G"
	],
	"instructors": [
		"Karen R. Achberger"
	],
	"level": 200,
	"locations": [
		"TOH 308"
	],
	"max": 18,
	"name": "Exploring Non-Fiction",
	"number": 252,
	"pn": false,
	"prerequisites": "GERM 232 or equivalent.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.758514+00:00",
			"locations": [
				"TOH 212"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.764910+00:00",
			"desc": "Students examine expository texts such as (auto)biographical writings, journalistic articles, German websites, and critical essays, with an eye to understanding the strategic organization of the text, the information presented, and the various layers of critical voices in a text. Coursework includes weekly writing assignments on the analysis of structure, style, argumentation, evidence, and perspective in a text. The course is designed to teach students writing strategies and the final project is a short paper written in German. Taught in German. May be counted toward German major or German studies concentration. Prerequisite: GERM 232 or equivalent."
		},
		{
			"_updated": "2018-02-03T00:01:10.146499+00:00",
			"prerequisites": "Prerequisite: GERM 232 or equivalent."
		},
		{
			"_updated": "2018-07-12T16:51:32.217208+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.269670+00:00",
			"enroll": "3",
			"max": "18"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"MWF 0200-0255PM"
	],
	"type": "Research",
	"year": 2015
}
