{
	"clbid": 103314,
	"credits": 1.0,
	"crsid": 18523,
	"departments": [
		"ASIAN",
		"PSCI"
	],
	"description": "Currents of nationalism, regionalism and globalization organize political life around the world.What trends and policies promote regional integration? What forces frustrate integration? Toanswer these questions this course investigates security, economic, and cultural relations at thebeginning of the 21st century within Asia and between Asia and Russia and the U.S. This courselooks at the historical interaction of national, regional, and global forces for additional answers.Prerequisite: previous course in Asian studies or political science, or permission of instructor.",
	"gereqs": [
		"HBS",
		"MCG"
	],
	"instructors": [
		"Katherine S. Tegtmeyer Pak"
	],
	"level": 200,
	"locations": [
		"TOH 308",
		"TOH 308"
	],
	"name": "Asian Regionalism",
	"number": 245,
	"pn": false,
	"prerequisites": "Prerequisite: previous course in Asian studies or political science, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-09T13:41:51.286309-05:00",
			"name": "Nation/Region/Globe/Asia"
		},
		{
			"_updated": "2015-06-30T12:00:25.686380-05:00",
			"locations": [
				"TOH 312",
				"TOH 312"
			]
		},
		{
			"_updated": "2016-01-30T08:55:44.882531-06:00",
			"desc": "Currents of nationalism, regionalism and globalization organize political life around the world. What trends and policies promote regional integration? What forces frustrate integration? To answer these questions this course investigates security, economic, and cultural relations at the beginning of the 21st century within Asia and between Asia and Russia and the U.S. This course looks at the historical interaction of national, regional, and global forces for additional answers. Prerequisite: previous course in Asian studies or political science, or permission of instructor.",
			"title": "Nationalism, Regionalism, Globalization in Asia"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"type": "Research",
	"year": 2015
}
