{
	"clbid": 103329,
	"credits": 1.0,
	"crsid": 21545,
	"depts": [
		"HIST"
	],
	"desc": "Age of Revolution - This course examines some of the major political, economic, social, and ideological changes that swept over a large geographic region that historians commonly refer to as the\" Atlantic World\" -- Europe, Africa, and the Americas, which were connected together across the Atlantic Ocean by the exchange of goods, ideas, and people. Topics include popular sovereignty, liberalism, abolitionism, religion and science, familial relations, and the significance of the Haitian Revolution. Although the course focuses mostly on the American, Haitian, and Latin American revolutions, gaining a global understanding of the importance of the Age of Revolution is a primary goal of this course.",
	"gereqs": [
		"MCG",
		"WRI"
	],
	"instructors": [
		"Edward P. Pompeian"
	],
	"level": 200,
	"locations": [
		"HH 302"
	],
	"name": "Top: Age of Revolution",
	"num": 289,
	"pf": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-24T00:00:50.107227-05:00",
			"grouptype": "R"
		},
		{
			"_updated": "2015-05-01T18:00:25.462436-05:00",
			"notes": "MCG and WRI pending committee approval."
		},
		{
			"_updated": "2015-05-07T00:00:36.726490-05:00",
			"locations": [
				"HH 301"
			]
		},
		{
			"_updated": "2016-01-30T08:55:51.627096-06:00",
			"desc": "Gender in Africa - This seminar examines the contradictory images on gender in Africa promoted by colonial notions of man as the breadwinner and the woman jettisoned to a dependent position that defined metropolitan career trajectories. It examines differing gender norms and the resulting tensions as we interrogate the social, economic, and historical roles of women in Africa. Through lectures, discussions, films, and a varied list of intriguing sources and readings the course introduces students to \"doing history,\" as students appreciate and reconstruct the lived experiences of African women and explore themes such as slavery, religious and political roles, production, distribution and reproduction, domesticity, marriage and kingship, social change, and motherhood. The course pays particular attention to how women in Africa coped with society and not how society coped with them. No prior study of African history required."
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20151,
	"times": [
		"MWF 0200-0255PM"
	],
	"title": "Topics in History",
	"type": "Topic",
	"year": 2015
}
