{
	"clbid": 103158,
	"credits": 1.0,
	"crsid": 323,
	"departments": [
		"EDUC"
	],
	"description": "This course provides practical information specifically relevant to the field of visual arts and art education. Students learn basic concepts about child growth, developmental stages, learning styles, and varied classroom approaches. They participate in classroom observations and practical applications of classroom activities, prepare units of instruction, and microteach. Topics include arts advocacy, interdisciplinary instruction, assessment, and teaching art history. Required field experience component. Offered periodically in the spring semester. Prerequisite: EDUC 330.",
	"instructors": [
		"Karna E. Hauck"
	],
	"level": 300,
	"locations": [
		"DC 204A",
		"DC 204A"
	],
	"name": "Teaching of Art, K-12",
	"notes": "Open to Juniors and Seniors only. Prerequisite: EDUC 330.",
	"number": 341,
	"pn": false,
	"prerequisites": "Prerequisite: EDUC 330.",
	"revisions": [
		{
			"_updated": "2015-09-23T18:00:34.506306-05:00",
			"notes": null
		},
		{
			"_updated": "2016-01-30T08:55:44.843858-06:00",
			"desc": "This course provides practical information specifically relevant to the field of visual arts and art education. Students learn basic concepts about child growth, developmental stages, learning styles, and varied classroom approaches. They participate in classroom observations and practical applications of classroom activities, prepare units of instruction, and microteach. Topics include arts advocacy, interdisciplinary instruction, assessment, and teaching art history. Required field experience component. Offered in the spring semester. Prerequisite: EDUC 330."
		},
		{
			"_updated": "2016-02-11T00:01:32.357566-06:00",
			"locations": null,
			"times": null
		},
		{
			"_updated": "2016-04-01T00:27:56.575186-05:00",
			"locations": [
				"TBA",
				"TBA"
			]
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"W 0230-0430PM",
		"Th 0400-0530PM"
	],
	"title": "Teaching of Visual Art, K-12",
	"type": "Research",
	"year": 2015
}
