{
	"clbid": "0000103018",
	"credits": 1.0,
	"crsid": "0000029176",
	"department": "BIO",
	"description": [
		"This course explores the natural history of our planet through the fossil record. Students learn from professional paleontologists and museum curators about how fossils are used in scientific research prior to embarking on a 10-day vertebrate fossil expedition in central Florida. The students then curate, catalog and interpret their data, using a large museum reference collection. Open only to sophomores, juniors, and seniors. Offered occasionally during Interim. Counts toward biology major."
	],
	"enrolled": 15,
	"instructors": [
		"Steven Freedberg"
	],
	"learningmode": "S",
	"level": 100,
	"max": 15,
	"name": "Field Paleontology",
	"notes": [
		"This is an off-campus course. You will find this course listed in Studio Abroad",
		"under its course title."
	],
	"number": 131,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.917032+00:00",
			"grouptype": "R",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-11-06T00:01:55.361916+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.534618+00:00",
			"desc": "This course explores the natural history of our planet through the fossil record. Studentslearnfrom professional paleontologists and museum curators about how fossils are used in scientific research prior to embarking on a 10-day vertebrate fossil expeditionincentral Florida. The students then curate, catalog and interpret their data, using a large museum reference collection. Open only to sophomores, juniors, and seniors. Offered occasionally during Interim. Counts toward biology major."
		},
		{
			"_updated": "2018-07-12T16:51:30.153452+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.077366+00:00",
			"enroll": "15",
			"max": "15"
		},
		{
			"_updated": "2020-10-15T15:23:56.927315+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:19.670885+00:00",
			"gereqs": [
				"IST",
				"SED"
			]
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"type": "Research",
	"year": 2015
}
