{
	"clbid": 103012,
	"credits": 1.0,
	"crsid": 506,
	"departments": [
		"GERM"
	],
	"description": [
		"This course provides an introduction to the study of folklore and presents a spectrum of approaches to the interpretation of fairy tales. Students read and discuss writings stemming from oral traditions such as the Nibelungenlied, and chapbooks including Till Eulenspiegel, and Faust; eighteenth-century fables created on models from antiquity; fairy tales collected by the Brothers Grimm; and Kunstmärchen (literary fairy tales by known writers). Students explore the literary aspects of the works and their historical contexts. Counts toward German studies concentration."
	],
	"enroll": 32,
	"gereqs": [
		"ALS-L",
		"HWC"
	],
	"instructors": [
		"Lavern Rippley"
	],
	"level": 100,
	"locations": [
		"TOH 308",
		"TOH 308"
	],
	"max": 30,
	"name": "Grimm Fairy Tales and Folklore",
	"notes": [
		"Taught in English."
	],
	"number": 147,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.419025+00:00",
			"name": "Grimm Fairy Tales/Folklor",
			"notes": null
		},
		{
			"_updated": "2015-04-07T21:54:39.760865+00:00",
			"locations": [
				"TOH 212",
				"TOH 212"
			]
		},
		{
			"_updated": "2015-11-12T00:01:27.394061+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.767392+00:00",
			"desc": "This course provides an introduction to the study of folklore and presents a spectrum of approaches to the interpretation of fairy tales. Students read and discuss writings stemming from oral traditions such as the Nibelungenlied, and chapbooks including Till Eulenspiegel, and Faust; eighteenth-century fables created on models from antiquity; fairy tales collected by the Brothers Grimm; and Kunstmärchen (literary fairy tales by known writers). Students explore the literary aspects of the works and their historical contexts."
		},
		{
			"_updated": "2018-07-12T16:51:32.218052+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.270765+00:00",
			"enroll": "32",
			"max": "30"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "The Grimm Fairy Tales and Folklore",
	"type": "Research",
	"year": 2015
}
