{
	"clbid": "0000146838",
	"credits": 1.0,
	"crsid": "0000036257",
	"department": "WRIT",
	"description": [
		"Ishmael Reed coined the phrase, \"Writin' is fightin'.\" Talib Kweli spits, \"They ask me what I'm writing for / I'm writing to show you what we're fighting for.\" Taking inspiration from the Black literary tradition where writing is indeed fighting -- fighting against racism, (hetero)sexism, classism, colonialism, and other systems of oppression -- this seminar will ground you in critical race theory, women of color feminism, and cultural criticism in order to write your way towards freedom, liberation, and social transformation. These methods and methodologies will help you develop a critical framework to analyze and examine difference (e.g., racial, gendered, class, sexual, religious, national) in American society and culture, as we engage in readings that illuminate structures of power and expose the contradictions of concepts such as equality, democracy, citizenship, and the American dream. By the end of this seminar, you will leave equipped with the reading, thinking, and writing skills to a) help you succeed academically; b) aid you in challenging white supremacist/Eurocentric understandings of history, culture, and society; and c) write/dream a new world."
	],
	"enrolled": 15,
	"gereqs": [
		"WRR"
	],
	"groupid": "0000036257",
	"grouptype": "M",
	"instructors": [
		"SooJin Pate"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 19,
	"name": "Top: Writin' is Fightin'",
	"notes": [
		"Section topic: Writin' is Fightin': Representation, Power, and Social Change"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "RML 520",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "RML 520",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2025-10-11T21:36:43.533323+00:00",
			"gereqs": [
				"FYW",
				"WRR"
			]
		}
	],
	"section": "M",
	"semester": 3,
	"senior": "0/0",
	"status": "O",
	"term": 20223,
	"title": "Writing and Rhetoric",
	"type": "Topic",
	"year": 2022
}
