{
	"clbid": "0000146383",
	"credits": 1.0,
	"crsid": "0000000620",
	"department": "HIST",
	"description": [
		"The Cherokees called it Nunna daul Tsuny, \"The Trail Where We Cried,\" and it is now often referred to as the \"Trail of Tears,\" the forced expulsion in the 1830s of indigenous people from their ancestral homes principally in the southeastern United States. That such an unjust event ever occurred calls us to question many assumptions about U.S. history: Why did this happen and how? How did it affect the people involved? What were the after-effects of the forced expulsion to Indian Territory in what is now the state of Oklahoma? This course will explore these and many more questions in an attempt to paint a comprehensive portrait of the era of Removal, broadly construed. Topics covered include Native American culture change, the development of U.S. Indian policy, Native American accommodation and resistance to Removal, and Andrew Jackson’s legacy as the architect of this policy. Most importantly, this course will challenge us to see the Removal process from the Native Americans’ perspective by introducing students to ethnohistory, a methodology developed to write the histories of people long thought not to have had one. In the end, we will see U.S. history in a new light and reflect upon the moral ambiguities of the U.S. republic’s expansion and growth."
	],
	"enrolled": 15,
	"gereqs": [
		"MCD",
		"PAR"
	],
	"instructors": [
		"Steven C. Hahn"
	],
	"learningmode": "S",
	"level": 200,
	"max": 25,
	"name": "Top: The Trail of Tears",
	"number": 282,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "HH 501",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "HH 501",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "HH 501",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"semester": 1,
	"status": "O",
	"term": 20221,
	"title": "Topics in Native American History",
	"type": "Topic",
	"year": 2022
}
