{
	"clbid": "0000146992",
	"credits": 1.0,
	"crsid": "0000000572",
	"department": "HIST",
	"description": [
		"This course offers students an introductory history of the media landscape they currently inhabit--where news, entertainment, fact, and fiction are everywhere we look yet are often indistinguishable from each other. We will cover the history of the modern media, beginning with the transnational networks of communication built in the 19th century, the social transformations of broadcast media in the 20th century, and rapid and global spread of social media in the 21st. This course will not only explore the histories of the technologies involved in these transformations (the telegraph, the television, and the internet), but also the the institutions that have made these technologies so powerful (The New York Times, the BBC, News Corp, and Twitter), as well as the questions they have raised about objectivity, free speech, polarization, and the future of democracy. We will learn that to understand the social, cultural, and political power of the modern media in the present, we first need to know its past."
	],
	"enrolled": 17,
	"gereqs": [
		"GHS"
	],
	"instructors": [
		"Patrick Wilz"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 19,
	"name": "Top: Mod Media-Telegraph to Twitter",
	"notes": [
		"Open only to incoming first-year students.",
		"Full topic title: Modern Media from the Telegraph to Twitter"
	],
	"number": 188,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "OM 240",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "OM 240",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "OM 240",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2025-10-11T21:36:42.002317+00:00",
			"gereqs": [
				"HWC",
				"GHS"
			]
		}
	],
	"section": "C",
	"semester": 1,
	"senior": "0/0",
	"sophomore": "0/0",
	"status": "O",
	"term": 20221,
	"title": "Topical Seminar",
	"type": "Topic",
	"year": 2022
}
