{
	"clbid": "0000108101",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"THE BIBLE AND THE IDEA OF NATURE: In this section we are studying whether the Bible has anything to say about the modern politics of “environmentalism.” Some argue the Bible offers timeless spiritual lessons unrelated to specific political concerns, like environmentalism. But others argue the Bible testifies to God’s loving care for creation, and consequently lays down a religious obligation for modern people to protect the environment. What does the Bible say about the natural world? Using the imagery of gardens and wilderness as a way of thinking about the natural world, we are trying to determine what Biblical authors thought about nature. And we are trying to understand how modern people employ the Bible in arguments about the environment."
	],
	"enrolled": 18,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"David Booth"
	],
	"level": 100,
	"locations": [
		"OM 240",
		"OM 240"
	],
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Open to Environmental Conversations students only.",
		"Section Topic: The Bible and the Idea of Nature."
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.107204+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-01T11:31:39.231708+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-10-06T11:31:16.335352+00:00",
			"locations": [
				"OM 210",
				"OM 210"
			]
		},
		{
			"_updated": "2016-10-13T11:31:26.521289+00:00",
			"notes": "Open to Environmental Conversations students only."
		},
		{
			"_updated": "2017-05-30T17:11:22.934845+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:40.210688+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.359411+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "M",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
