{
	"clbid": "0000108968",
	"credits": 1.0,
	"crsid": "0000000172",
	"department": "BIO",
	"description": [
		"Bio 391: in this seminar course we will examine how animal vision has evolved to meet ecological needs and enable specific behavioral tasks such as prey capture, predator avoidance, navigation, mate selection, and communication. Topics will include the visual environment, biological optics, structure and function of photoreceptors, color vision, polarization vision, motion detection, stereovision, decision making, development of the visual system, and \"the dress.\" The course will be grounded in the primary literature, and class time will consist of discussion and group work. Prerequisite: BIO 227 or NEURO 239 or permission of instructor."
	],
	"enrolled": 11,
	"instructors": [
		"James Demas"
	],
	"level": 300,
	"locations": [
		"RNS 124"
	],
	"max": 12,
	"name": "Top: Vision",
	"notes": [
		"Open to seniors and juniors only."
	],
	"number": 391,
	"pn": false,
	"prerequisites": "BIO 227 or NEURO 239 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.170871+00:00",
			"locations": []
		},
		{
			"_updated": "2016-09-24T11:31:57.025306+00:00",
			"notes": "Open to juniors and seniors only."
		},
		{
			"_updated": "2016-10-05T11:32:19.877581+00:00",
			"locations": [
				"RNS 435"
			]
		},
		{
			"_updated": "2016-11-30T11:32:04.283222+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:25.854609+00:00",
			"description": "Specific topics announced prior to each term are based on student interests and available staff. Class work includes comprehensive review of literature on the specific topic. Class meetings present topics in discussion format. May be repeated if topic is different. Counts toward environmental studies major (all emphases) and concentration when taught with environmental science focus and approved by chair. Prerequisites: vary.",
			"prerequisites": "Prerequisites: vary."
		},
		{
			"_updated": "2018-02-03T00:02:43.976037+00:00",
			"prerequisites": "Prerequisite: BIO 227 or NEURO 239 or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:41.130476+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.734654+00:00",
			"enroll": "11",
			"max": "12"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"M 0100-0400PM"
	],
	"title": "Selected Topics",
	"type": "Topic",
	"year": 2016
}
