{
	"clbid": 108093,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": [
		"WOMEN AND/IN THE BIBLE. We will study the Bible and the way in which women are portrayed in and have responded to it. You will know your way around the Bible by the time we are through, knowing when, why, where, how and from which perspective biblical texts were written. You will strive for biblical literacy. We will know the classic “proof texts\u0094 for and against women. In addition, we will look at the use of these selections in religious traditions to shape attitudes toward and treatment of women, focusing especially on women in different social locations; as harlots and manipulators; as victims of violence through rape, torture, silencing, marginalizing, and exclusion; and as active religious leaders as mothers, queens, judges, and ministers."
	],
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Patricia Beckman"
	],
	"level": 100,
	"locations": [
		"OM 210"
	],
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Topic: Women and/in the Bible.",
		"Supplemental Instruction (SI) is available for this course."
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.092915+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-06T11:31:16.325357+00:00",
			"locations": [
				"OM 305"
			]
		},
		{
			"_updated": "2016-10-13T11:31:26.506308+00:00",
			"notes": null
		},
		{
			"_updated": "2016-10-27T11:31:17.725838+00:00",
			"notes": "Section Topic: Women and/in the Bible."
		},
		{
			"_updated": "2016-11-11T11:31:31.812070+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:21.296992+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "E",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 1045-1140"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
