{
	"clbid": "0000108959",
	"credits": 1.0,
	"crsid": "0000021527",
	"department": "ENGL",
	"description": [
		"This course examines the history of nineteenth-century American literature by focusing on the topic of freedom. Students read works by writers who embraced America’s literary independence from Britain, the liberation of individuals from traditional institutions, and the freedom of women and people of color from various forms of oppression. Developments in such genres as the novel, the short story, the autobiographical narrative, and poetry will be considered. Writers studied include Emerson, Thoreau, Hawthorne, Melville, Whitman, Fern, Fuller, Jacobs, Douglass, Dickinson, Twain, James, Chesnutt, Crane, and Chopin. Prerequsite: FYW."
	],
	"enrolled": 19,
	"gereqs": [
		"ALS-L",
		"WRI"
	],
	"instructors": [
		"Carol Holly"
	],
	"level": 200,
	"locations": [
		"RML 520",
		"RML 520"
	],
	"max": 18,
	"name": "Top: Declar of Independence",
	"number": 220,
	"pn": false,
	"prerequisites": "Prerequsite: FYW.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.162750+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-05T11:32:19.868848+00:00",
			"locations": [
				"RML 515",
				"RML 515"
			]
		},
		{
			"_updated": "2016-11-18T11:31:45.492597+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:25.437937+00:00",
			"description": "These courses trace the process of literary change during a selected period of approximately one hundred years, providing an experience of chronological breadth and textual variety. Students examine the development of styles, conventions, and forms within a particular national literature or across two or more national literatures. Examples of possible topics include Declarations of Independence in American Literature; Literature of the Atlantic Triangle, 1650-1800; 20th-century British and Irish Modernism. May be repeated if topic is different. Click on course title in the class and lab for more information about the course for that term. Prerequisite: FYW.",
			"prerequisites": "Prerequisite: FYW."
		},
		{
			"_updated": "2018-07-12T16:51:41.122717+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.730930+00:00",
			"enroll": "19",
			"max": "18"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Topics in Literary History",
	"type": "Topic",
	"year": 2016
}
