{
	"clbid": 108188,
	"credits": 1.0,
	"crsid": 1181,
	"departments": [
		"PSYCH"
	],
	"description": [
		"This course examines several major theoretical perspectives on psychotherapy. Students review empirically supported treatments for specific clinical disorders, as well as \"nonspecific\" factors that affect the therapeutic process. Students explore ethical and legal challenges related to psychotherapy delivery, as well as multicultural and other diversity issues. Course format is primarily discussion-based. Offered annually. Counts toward management studies concentration. Prerequisites: junior or senior standing and PSYCH 230, plus PSYCH 244 or PSYCH 247."
	],
	"enroll": 16,
	"instructors": [
		"Mark Sundby"
	],
	"level": 300,
	"locations": [
		"RNS 124",
		"RNS 124"
	],
	"max": 15,
	"name": "Clinical/Counseling Psych",
	"number": 375,
	"pn": false,
	"prerequisites": "Prerequisites: junior or senior standing and PSYCH 230, plus PSYCH 244 or PSYCH 247.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.208253+00:00",
			"locations": []
		},
		{
			"_updated": "2016-06-25T06:18:52.882823+00:00",
			"locations": [
				"RNS 124"
			],
			"times": [
				"Th 0700-1000PM"
			]
		},
		{
			"_updated": "2016-11-11T11:31:31.887293+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:30.316892+00:00",
			"description": "This course examines several major theoretical perspectives on psychotherapy. Students review empirically supported treatments for specific clinical disorders, as well as \"nonspecific\" factors that affect the therapeutic process. Students explore ethical and legal challenges related to psychotherapy delivery, as well as multicultural and other diversity issues. Course format is primarily discussion-based. Offered annually. Counts toward management studies concentration and biomedical studies concentration (for students through class of 2016). Prerequisites: junior or senior standing and PSYCH 230, plus PSYCH 244 or PSYCH 247."
		},
		{
			"_updated": "2018-07-12T16:51:40.259138+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.396697+00:00",
			"enroll": "16",
			"max": "15"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Clinical and Counseling Psychology",
	"type": "Research",
	"year": 2016
}
