{
	"clbid": 108995,
	"credits": 1.0,
	"crsid": 124,
	"departments": [
		"BIO"
	],
	"description": "Students focus on the natural history of Upper Midwest vertebrates and phylogenetic, morphological, and functional relationships of these animals. Laboratories include identification,and morphology. During field trips, students document bird migrations, amphibian chorusing, and other animal activities. Independent projects explore topics ranging from blue bird nesting behavior to thermal conductivity and insulation in animals. Students attend lectures plus one three-hour laboratory per week. Counts as \"comparative organismal biology\" core category. Prerequisites: BIO 150.",
	"gereqs": [
		"SED"
	],
	"groupid": 124,
	"instructors": [
		"Steven Freedberg"
	],
	"level": 200,
	"locations": [
		"RNS 310",
		"RNS 310"
	],
	"name": "Vertebrate Biology",
	"notes": "Students in Bio 242 must also register for one lab Bio 242 AL or BL.",
	"number": 242,
	"pn": false,
	"prerequisites": "Prerequisites: BIO 150.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.177556+00:00",
			"locations": []
		},
		{
			"_updated": "2016-11-11T11:31:32.418182+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:26.188070+00:00",
			"description": "Students focus on the natural history of Upper Midwest vertebrates and phylogenetic, morphological, and functional relationships of these animals. Laboratories include identification,and morphology. During field trips, students document bird migrations, amphibian chorusing, and other animal activities. Independent projects explore topics ranging from blue bird nesting behavior to thermal conductivity and insulation in animals. Students attend lectures plus one three-hour laboratory per week. Counts as \"comparative organismal biology\" core category. Prerequisites: BIO 150 or BIO 126.",
			"prerequisites": "Prerequisites: BIO 150 or BIO 126."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"type": "Research",
	"year": 2016
}
