{
	"clbid": 108295,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": "SCIENCE FICTION. The popularity of science fiction stems not only from its speculations about the future but also from what it tells us about the present. In this course we will explore the temporal fluidity of science fiction along with many of its other generic features, including plots, settings, characters, ideological perspectives, and explanations of science and technology. Students will read both sci-fi novels and short stories by influential authors from H.G. Wells to Kim Stanley Robinson. Considering the importance of cinema to the sci-fi genre, the course will also host a number of screenings, including relevant film adaptations of literary texts covered in the class. The course is likely to include Wells\u0092s War of the Worlds, Isaac Asimov's I, Robot, Ray Bradbury's Fahrenheit 451, Philip K. Dick's So Androids Dream of Electric Sheep and Ursula K. Le Guin's The Left Hand of Darkness, along with such film classics as Metropolis, Things to Come, The Day the Earth Stood Still, 2001, Blade Runner and Gattaca. Finally, students will read scholarly texts on both specific works and the sci-fi genre as a whole.",
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Bjorn Nordfjord"
	],
	"level": 100,
	"locations": [
		"OM 310"
	],
	"name": "First-Year Writing",
	"notes": "Section title: Science Fiction.",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.370321+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-05T11:32:17.732778+00:00",
			"locations": [
				"RNS 124"
			]
		},
		{
			"_updated": "2016-10-07T11:32:20.910373+00:00",
			"locations": [
				"RML 421"
			]
		},
		{
			"_updated": "2016-10-20T11:31:29.635758+00:00",
			"notes": null
		},
		{
			"_updated": "2016-11-11T11:31:31.961383+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:39.486158+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "H",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2016
}
