{
	"clbid": "0000108360",
	"credits": 1.0,
	"crsid": "0000029265",
	"department": "NURS",
	"description": [
		"This course focuses on holistic health assessment, health promotion, and disease prevention across the lifespan. Students obtain health histories, identify risk factors, and develop health assessment skills in physiologic, psychosocial, developmental, and spiritual dimensions. Identification of data from a holistic perspective and analysis of findings through critical thinking are emphasized. Active learning experiences are utilized to apply knowledge and informatics during health assessment. Counts toward the nursing major. Offered annually in the spring semester. Prerequisites: open to sophomore nursing majors only; CNA certification; concurrent registration in ID 210."
	],
	"enrolled": 20,
	"firstyear": "1/0",
	"groupid": "0000029265",
	"instructors": [
		"Elizabeth Rodgers"
	],
	"junior": "0/0",
	"level": 200,
	"max": 30,
	"name": "Holistic Health",
	"notes": [
		"Open to Sophomore Nursing majors only.",
		"Students in Nursing 211 must also register for one Nursing 211 lab."
	],
	"number": 211,
	"offerings": [
		{
			"day": "Mo",
			"end": "14:55",
			"location": "YTT 050A",
			"start": "14:00"
		},
		{
			"day": "We",
			"end": "14:55",
			"location": "YTT 050A",
			"start": "14:00"
		},
		{
			"day": "Fr",
			"end": "14:55",
			"location": "YTT 050A",
			"start": "14:00"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: open to sophomore nursing majors only; CNA certification; concurrent registration in ID 210.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.413838+00:00",
			"locations": []
		},
		{
			"_updated": "2016-11-12T11:32:04.837964+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:41.893212+00:00",
			"description": "This course focuses on holistic health assessment, health promotion, and disease prevention across the lifespan. Students obtain health histories, identify risk factors, and develop health assessment skills in physiologic, psychosocial, developmental, and spiritual dimensions. Identification of data from a holistic perspective and analysis of findings through critical thinking are emphasized. Active learning experiences are utilized to apply knowledge and informatics during health assessment. Counts toward the nursing major. Offered fall 2015 and each spring thereafter. Prerequisites: open to junior nursing majors only in the fall of 2015 and to sophomore nursing majors in the spring of 2016 and each spring thereafter. Concurrent registration with NURS 311, NURS 312, and NURS 313 in the fall of 2015. Concurrent registration with ID 210 in the spring of 2016 and each spring thereafter.",
			"prerequisites": "Prerequisites: open to junior nursing majors only in the fall of 2015 and to sophomore nursing majors in the spring of 2016 and each spring thereafter. Concurrent registration with NURS 311, NURS 312, and NURS 313 in the fall of 2015. Concurrent registration with ID 210 in the spring of 2016 and each spring thereafter."
		},
		{
			"_updated": "2018-07-12T16:51:40.356144+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.458812+00:00",
			"enroll": "20",
			"max": "30"
		},
		{
			"_updated": "2018-11-02T04:18:40.661203+00:00",
			"firstyear": null,
			"junior": null,
			"senior": null
		},
		{
			"_updated": "2019-02-09T05:05:09.867135+00:00",
			"firstyear": "2/0"
		}
	],
	"semester": 3,
	"senior": "0/0",
	"status": "C",
	"term": 20163,
	"title": "Holistic Health Assessment and Health Promotion",
	"type": "Research",
	"year": 2016
}
