{
	"clbid": "0000108294",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"DOING DEMOCRACY: THE POLITICS OF FOOD. Why do you eat what you eat? What does this say about you and your relationship to people, the environment, animals, and politics? Finally, how is the act of eating a political action, akin to public discourse? The theme of this writing course will explore various philosophies of food consumption and distribution, asking and debating questions about why certain communities experience obesity and abundance while others suffer from starvation and lack. We will investigate farming and agribusiness, philosophies of food consumption such as vegetarianism and the slow foods movement, and personal food and cooking habits. As a class, we will frame our discussions and writings around contemporary readings, advertisements, documentaries, film representations, fictional texts, recipes and cookbooks, and academic texts. As part of this exploration into how food and democracy go hand in hand, you will be expected to write a wide variety of genres including a food narrative, controversy analysis, researched argument, public argument, and manifesto."
	],
	"enrolled": 19,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Rebecca S. Richards"
	],
	"junior": "0/0",
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section title: Doing Democracy: The Politics of Food."
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "RML 421",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "RML 421",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.368499+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-05T11:32:17.697980+00:00",
			"locations": [
				"RML 420",
				"RML 420"
			]
		},
		{
			"_updated": "2016-10-06T11:31:16.454781+00:00",
			"locations": [
				"RML 421",
				"RML 421"
			]
		},
		{
			"_updated": "2016-10-07T11:32:20.908184+00:00",
			"locations": [
				"CHM 224",
				"CHM 224"
			],
			"section": "M"
		},
		{
			"_updated": "2016-10-20T11:31:29.633830+00:00",
			"notes": null
		},
		{
			"_updated": "2016-11-11T11:31:31.959983+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:39.350076+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:40.339526+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.445284+00:00",
			"enroll": "19",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:40.642777+00:00",
			"junior": null,
			"senior": null
		}
	],
	"section": "O",
	"semester": 3,
	"senior": "0/0",
	"status": "C",
	"term": 20163,
	"type": "Research",
	"year": 2016
}
