{
	"clbid": "0000108105",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"TORAH, MIDRASH, GOSPEL: THE BIBLE BETWEEN JUDAISM AND CHRISTIANITY. Both Judaism and Christianity have claimed the Hebrew Bible (or “Old Testament”) as the foundational text of their traditions. Throughout the centuries, both traditions have developed distinctive reading strategies for making sense of the diverse and complicated texts they regard as scripture. This course takes a thematic approach to topics in the Hebrew Bible that were important and sometimes divisive for its later readers, including the authors of the New Testament. These themes include law, prophecy, kingship, and the Temple in Jerusalem. For each of these topics, we will study important passages from the Hebrew scriptures and then examine related passages from rabbinic midrash (a form of biblical interpretation that has played a significant role in the development of Judaism) and the New Testament. Through attentive and active participation in this course, students will attain a basic familiarity with biblical texts, themes, and genres and understand some of the tools with which scholars approach them. In addition, this course seeks to help students become adept at the interpretation of texts and the practice of close reading, skills useful not only in biblical or religious studies but in all academic fields."
	],
	"enrolled": 13,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Mara H. Benjamin"
	],
	"level": 100,
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Topic: Torah, Midrash, Gospel: The Bible Between Judaism and",
		"Christianity."
	],
	"number": 121,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "OM 310",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "OM 310",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.116158+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-13T11:31:26.529652+00:00",
			"notes": null
		},
		{
			"_updated": "2017-01-14T22:54:42.279968+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:23.626434+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:40.214197+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.363848+00:00",
			"enroll": "13",
			"max": "18"
		}
	],
	"section": "Q",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
