{
	"clbid": 108825,
	"credits": 1.0,
	"crsid": 16,
	"departments": [
		"AFAM"
	],
	"description": [
		"This interdisciplinary course examines the ties that bind Africans and African Americans. Africans on the African continent and in the diaspora share historical, cultural, and religious lives that prove richly diverse. Students explore ways that peoples of African descent interact. From colonial times to the present day whether in the New World, or in Africa their lives intersect to create institutions and powerful influences in the world. Counts toward American studies major and race and ethnic studies major and concentration."
	],
	"gereqs": [
		"ALS-L",
		"MCG"
	],
	"instructors": [
		"Abdulai Iddrisu"
	],
	"level": 200,
	"locations": [
		"RNS 435"
	],
	"name": "Sem: Africa/Americas",
	"number": 231,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.002090+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-01T11:31:39.577886+00:00",
			"locations": [
				"RML 525",
				"RML 525"
			],
			"times": [
				"T 0120-0245PM",
				"Th 0215-0335PM"
			]
		},
		{
			"_updated": "2016-10-05T11:32:19.716873+00:00",
			"locations": [
				"RML 525"
			]
		},
		{
			"_updated": "2017-05-30T17:12:18.214514+00:00",
			"description": "This interdisciplinary course examines the ties that bind Africans and African Americans. Africans on the African continent and in the diaspora share historical, cultural, and religious lives that prove richly diverse. Students explore ways that peoples of Africian descent interact. From colonial times to the present day whether in the New World, or in Africa their lives intersect to create institutions and powerful influences in the world. Counts toward American studies major and race and ethnic studies major and concentration."
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20163,
	"times": [
		"MWF 0905-1000"
	],
	"title": "Africa and the Americas: The Diaspora Experience",
	"type": "Seminar",
	"year": 2016
}
