{
	"clbid": "0000108287",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"HIP HOP GENERATION. How did we get from Watergate and DJ Kool Herc’s “break” to Obama’s playlists and Yeezus? This seminar uses hip-hop culture as a guide to the social, political, and economic changes that have taken place in the US since the early 1970s. We will focus on the historical circumstances and unique spaces out of which hip hop arises as well as the culture’s own conception of history and aesthetics, its poetics of place. While our abiding interest will be the transformations of musical sound and urban culture over the last forty years, we will also attend to the wide-ranging influence that hip hop has had on documentary and feature film, journalism, literature, dance, advertising, visual art, and even, perhaps, US politics. Writing assignments will be developmental in nature, beginning with short, “close listening” exercises and album reviews and building toward a final digitial project that incorporates various media to construct its argument."
	],
	"enrolled": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Sean F. Ward"
	],
	"level": 100,
	"locations": [
		"TB 227"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section title: Hip Hop Generation."
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.353928+00:00",
			"locations": []
		},
		{
			"_updated": "2016-09-10T11:32:21.364722+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2016-10-06T11:31:16.448016+00:00",
			"locations": [
				"RML 420"
			]
		},
		{
			"_updated": "2016-10-20T11:31:29.620624+00:00",
			"notes": null
		},
		{
			"_updated": "2016-11-11T11:31:31.954931+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:38.665855+00:00",
			"description": "First-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:40.335133+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.441631+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "C",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 0905-1000"
	],
	"type": "Research",
	"year": 2016
}
