{
	"clbid": 108964,
	"credits": 1.0,
	"crsid": 22130,
	"departments": [
		"ENGL"
	],
	"description": [
		"American poetry of the twentieth and twenty-first centuries is noted for constant innovation in free-verse forms. We will read an expanse of poets and forms, and create a timeline for the rise of major schools of aesthetics such as: Imagism, Confessionalism, Black Mountain School, New York School, L=A=N=G=U=A=G=E poetry, Black Arts Movement and late multicultural collections, American Surrealism, among others. We’ll also read various ideologies and philosophies of poetry writing, including manifestos, to examine how innovations move the orthodox lines of U.S. narrative and lyric verse forms (if at all). Students will analyze, imitate, and experiment with the conventions that we study each week with opportunities for feedback throughout the term. Prerequisite: FYW."
	],
	"enroll": "17",
	"gereqs": [
		"ALS-L",
		"WRI"
	],
	"instructors": [
		"Jennifer Kwon Dobbs"
	],
	"level": 200,
	"locations": [
		"RML 420"
	],
	"max": "18",
	"name": "Top: 19th & 20th Cent Amer Poetry",
	"number": 280,
	"pn": false,
	"prerequisites": "FYW.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:19.167300+00:00",
			"locations": []
		},
		{
			"_updated": "2016-09-22T11:31:40.482397+00:00",
			"section": null
		},
		{
			"_updated": "2016-10-05T11:32:19.874353+00:00",
			"locations": [
				"OM 030"
			]
		},
		{
			"_updated": "2016-10-08T11:31:26.792124+00:00",
			"name": "Top: Studies in Poetry"
		},
		{
			"_updated": "2016-11-11T11:31:32.412539+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-01-20T22:58:20.235013+00:00",
			"locations": [
				"RML 421"
			]
		},
		{
			"_updated": "2017-05-30T17:12:25.688177+00:00",
			"description": "These courses emphasize the study of literature united by specific formal elements rather than by theme, topic, historical period, or national origin. The genre studied may be broad, such as narrative fiction, or narrowly defined, such as the elegy. The course focuses on the study of literature through a critical exploration of form. May be repeated if topic is different. Click on course title in the class and lab for more information about the course for that term. Prerequisite: FYW."
		},
		{
			"_updated": "2018-02-03T00:02:43.972849+00:00",
			"prerequisites": "Prerequisite: FYW."
		},
		{
			"_updated": "2018-07-12T16:51:41.127271+00:00",
			"enroll": null,
			"max": null
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 1150-1245PM"
	],
	"title": "Topics in Genre",
	"type": "Topic",
	"year": 2016
}
