{
	"clbid": 108116,
	"credits": 1.0,
	"crsid": 100,
	"departments": [
		"BIO"
	],
	"description": "This course explores contemporary biological issues related to health and the environment, with the goal of fostering informed citizens prepared for current biological debates. Students learn therelevant biological principles in lecture and lab followed by appropriate lab or field research. Specific topics vary from year to year and may include emerging diseases, cardiovascular health, genetics, specific groups of organisms, behavior, and environmental dynamics. The course includes lectures plus one two-hour laboratory per week.",
	"gereqs": [
		"IST",
		"SED"
	],
	"groupid": 100,
	"instructors": [
		"Sara E. Fruehling"
	],
	"level": 100,
	"locations": [
		"RNS 150"
	],
	"name": "Biological Science",
	"notes": "Students in Bio 121 must also register for one lab Bio 121 AL, BL, CL or DL.",
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.137858+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-05T11:32:17.284766+00:00",
			"locations": [
				"RNS 410"
			]
		},
		{
			"_updated": "2016-11-11T11:31:31.847128+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:25.245912+00:00",
			"description": "This course explores contemporary biological issues related to health and the environment, with the goal of fostering informed citizens prepared for current biological debates. Students learn the relevant biological principles in lecture and lab followed by appropriate lab or field research. Specific topics vary from year to year and may include emerging diseases, cardiovascular health, genetics, specific groups of organisms, behavior, and environmental dynamics. The course includes lectures plus one two-hour laboratory per week."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 1150-1245PM"
	],
	"title": "Biological Science: Issues in Biology",
	"type": "Research",
	"year": 2016
}
