{
	"clbid": 108366,
	"credits": 1.0,
	"crsid": 126,
	"departments": [
		"BIO"
	],
	"description": [
		"Students journey toward greater understanding of the human body through an integrated study of the structure of the body (anatomy) and how organs such as the brain, heart, and kidney perform their remarkable functions (physiology). The course is designed primarily for students intending careers in the health sciences. Students attend lectures plus one three-hour laboratory per week. Offered each semester. Counts toward exercise science major and neuroscience concentration. Prerequisite: BIO 143, or BIO 150 and BIO 227 or CH/BI 227."
	],
	"enroll": "56",
	"groupid": 126,
	"instructors": [
		"Sarah Amugongo"
	],
	"level": 200,
	"locations": [
		"RNS 410"
	],
	"max": "60",
	"name": "Human Anatomy & Physiology",
	"notes": [
		"Students in Bio 243 must also register for one lab Bio 243 AL, BL, or CL.",
		"This course is open to a limited number of first-year students."
	],
	"number": 243,
	"pn": false,
	"prerequisites": "BIO 143, or BIO 150 and BIO 227 or CH/BI 227.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:47:18.427696+00:00",
			"locations": []
		},
		{
			"_updated": "2016-10-13T11:31:27.386834+00:00",
			"notes": "Students in Bio 243 must also register for one lab Bio 243 AL, BL, or CL. This course has class-year limits."
		},
		{
			"_updated": "2016-11-11T11:31:31.991535+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:11:42.703865+00:00",
			"description": "Students journey toward greater understanding of the human body through an integrated study of the structure of the body (anatomy) and how organs such as the brain, heart, and kidney perform their remarkable functions (physiology). The course is designed primarily for students intending careers in the health sciences. Students attend lectures plus one three-hour laboratory per week. Offered annually. Counts toward exercise science major, neuroscience concentration, and biomedical studies concentration (for students through class of 2016). Prerequisite: BIO 143, or BIO 150 and BIO 227, or BIO 125, or CH/BI 227.",
			"prerequisites": "Prerequisite: BIO 143, or BIO 150 and BIO 227, or BIO 125, or CH/BI 227."
		},
		{
			"_updated": "2018-02-03T00:02:43.456554+00:00",
			"prerequisites": "Prerequisite: BIO 143, or BIO 150 and BIO 227 or CH/BI 227."
		},
		{
			"_updated": "2018-07-12T16:51:40.361011+00:00",
			"enroll": null,
			"max": null
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 0800-0855"
	],
	"title": "Human Anatomy and Physiology: Organs and Organ Systems",
	"type": "Research",
	"year": 2016
}
