{
	"clbid": "0000143894",
	"credits": 1.0,
	"crsid": "0000036257",
	"department": "WRIT",
	"description": [
		"As the most recognized expression of physical culture, organized sports occupy a prominent position around the world. For centuries, athletic success--or failure--can and has been used as a tool to make war, peace, politics, and money. This seminar is designed for students interested in the political, cultural, and historical impact of sports and physical culture. You do not need to be a collegiate athlete--or even particularly sporty--to apply! Some of our guiding questions for the semester include: When did organized athletics emerge--and what implications does that hold for us today? How do national and international interests collide in the arena of sports? Can and should sporting achievement be viewed independently of other contexts? How can we understand and analyze sports as \"physical culture\"? What athletic pursuits and other physical cultures matter to our St. Olaf campus community? In this course, we will use tools from the fields of cultural and literary analysis to think, talk, and write about the present, past, and future of sports and physical culture--from the intramural clubs at St. Olaf to international competitions like the Olympic Games. We will analyze historical and contemporary source texts, craft and debate persuasive arguments, research and write about physical culture(s), and reflect on our shared physical, emotional, and critical-rhetorical growth at St. Olaf."
	],
	"enrolled": 17,
	"gereqs": [
		"FYW",
		"WRR"
	],
	"groupid": "0000036257",
	"grouptype": "A",
	"instructors": [
		"Matthew O. Anderson"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Top: Bodies in Motion",
	"notes": [
		"Section topic: Bodies in Motion: Sports, Politics, and Physical Culture"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "TOH 210",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "TOH 210",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "TOH 210",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"section": "A",
	"semester": 1,
	"senior": "0/0",
	"status": "O",
	"term": 20221,
	"title": "Writing and Rhetoric",
	"type": "Topic",
	"year": 2022
}
