{
	"clbid": "0000143895",
	"credits": 1.0,
	"crsid": "0000036257",
	"department": "WRIT",
	"description": [
		"Increasingly, we ask ourselves, \"What can I do about climate change?\" Maybe we try to recycle or donate to environmental causes, but we wonder if such actions make a difference. Maybe what we're really wondering is this: how do we live meaningfully in the time of climate change? How do we confront climate anxiety, find joy, and be good ancestors to future generations? To address these questions, we'll discuss environmental media from diverse leaders of the emerging climate renaissance. These voices will take us from the heights of the Arctic to worlds below the earth, through forests that communicate with each other, and into the food cultures of the future. In the process, we'll do civically engaged environmental work with our local Northfield community and dispel the myths that make writing difficult in favor of evidence-based essay strategies. Ultimately, we'll work together to find words and ideas to live responsibly in community--with each other and the more-than-human world. No prior environmental knowledge is required."
	],
	"enrolled": 17,
	"gereqs": [
		"FYW",
		"WRR"
	],
	"groupid": "0000036257",
	"grouptype": "F",
	"instructors": [
		"Ryan C. Eichberger"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Top: Living Well in Climate Change",
	"notes": [
		"Section topic: Living Well in the Time of Climate Change",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 120,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "RML 525",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "RML 525",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "RML 525",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": false,
	"section": "F",
	"semester": 1,
	"senior": "0/0",
	"status": "O",
	"term": 20221,
	"title": "Writing and Rhetoric",
	"type": "Topic",
	"year": 2022
}
