{
	"clbid": "0000143858",
	"credits": 1.0,
	"crsid": "0000036173",
	"department": "FYS",
	"description": [
		"Why do people care about the super-rich, ultra-famous, and powerbrokers from Capitol Hill to Hollywood? What inspires everyday consumers to desire more news, content, and connection with the celebrities who seduce and elude them? In the United States (and throughout the world), celebrities are royalty and cultural icons -- venerable symbols that often represent what fans ultimately value. This course applies critical theories of religion and the sacred to make sense of the devotion, rituals, and worship centered around celebrities. Figures from musicians, actors, authors to investors, tech giants, and influencers will provide case studies through which we will interrogate histories of demagoguery, fame, progress, and prosperity in American religious life. Throughout the semester, students will build on critical discourse regarding celebrity worship, fanism, charisma, cults of personality, worship, cultural values, and spiritual practices. These conversations will encourage students to learn methods of inquiry applied within the discipline of religious studies and lead to the acquisition of skills in analyzing historical, sociological, theological, and anthropological texts focused on sacred experience, civil religion, and American life. Students will work individually and collaboratively to develop research questions, investigate resources, and develop public-facing projects."
	],
	"enrolled": 15,
	"gereqs": [
		"FYS"
	],
	"groupid": "0000036173",
	"grouptype": "Q",
	"instructors": [
		"Timothy M. II. Rainey"
	],
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Top: Celebrity: Am Idols/Icons",
	"notes": [
		"Section topic: Celebrity: American Idols and Icons"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "OM 340",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "OM 340",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"section": "Q",
	"semester": 1,
	"status": "O",
	"term": 20221,
	"title": "First-Year Seminar",
	"type": "Topic",
	"year": 2022
}
