{
	"clbid": "0000072637",
	"credits": 1.0,
	"crsid": "0000018795",
	"department": "CH/BI",
	"description": [
		"This course introduces chemical concepts that are important for students pursuing a study of chemistry or biology. Topics include atomic structure, the periodic table, bonding interactions within and between particles, water and its solutions, biological membranes, chemical reaction types, chemical stoichiometry, equilibrium systems, acids and bases, introduction to protein structure. Examples are often pulled from the realm of biological molecules and processes. Students attend three classes and one three-hour laboratory each week. Prerequisites: high school biology, chemistry and physics. Placement via online placement exam is required. Concurrent registration in Mathematics 120 or 121 is recommended. Offered annually in the fall semester."
	],
	"enrolled": 31,
	"groupid": "0000018795",
	"instructors": [
		"Beth Abdella"
	],
	"learningmode": "S",
	"level": 100,
	"max": 48,
	"name": "Integrated Chem/Bio I",
	"notes": [
		"Students in CH/BI 125 must also register for lab section CH/BI 125AL or BL."
	],
	"number": 125,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "RNS 390",
			"start": "09:05"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "RNS 390",
			"start": "09:05"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "RNS 390",
			"start": "09:05"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: high school biology, chemistry and physics. Placement via online placement exam is required. Concurrent registration in Mathematics 120 or 121 is recommended. Offered annually in the fall semester.",
	"revisions": [
		{
			"_updated": "2018-07-12T16:50:49.148595+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:47:36.891381+00:00",
			"enroll": "31",
			"max": "48"
		},
		{
			"_updated": "2020-10-15T15:23:37.808939+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:02.880880+00:00",
			"gereqs": [
				"IST",
				"SED"
			]
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20101,
	"title": "Integrated Chem/Bio I: Chemical Concepts with Biological Applications",
	"type": "Research",
	"year": 2010
}
