{
	"clbid": "0000115190",
	"credits": 1.0,
	"crsid": "0000000438",
	"department": "ENGL",
	"description": [
		"With a focus on writings by Alex la Guma and Nadine Gordimer, this course explores South African Literature. We will concentrate on twentieth century South African literature in English, exploring its evolution through the legacy of indigenous folklore and literature and the influence of foreign cultures and literatures. The focus on la Guma and Gordimer will enable us to explore not only diverse literary techniques but also common themes in South African literature, such as the dialectic between urban and rural realities, apartheid and race relations, the struggle for liberation, and ideologies such as Marxism. We will explore artistic theories and world views which shaped the work of la Guma and Gordimer, both of whom, fortunately, have left us a rich legacy of their thoughts, in the form of interviews and essays, which illuminate not only their own works but also the broader universe of South African literature. Prerequisite: Open to rising juniors and seniors who have completed English 185 and at least two level-II English courses or by permission of the instructor."
	],
	"enrolled": 8,
	"firstyear": "0/0",
	"instructors": [
		"Joseph L. Mbele"
	],
	"level": 300,
	"max": 15,
	"name": "Top: Post Colonial Lit",
	"notes": [
		"Open to rising juniors and seniors who have completed ENGL 185 and at least two",
		"level-II English courses or by permission of instructor."
	],
	"number": 347,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "RML 420",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "RML 420",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "RML 420",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": "Open to rising juniors and seniors who have completed English 185 and at least two level-II English courses or by permission of the instructor.",
	"revisions": [
		{
			"_updated": "2018-02-03T00:03:29.187594+00:00",
			"prerequisites": "Prerequisite: Open to rising juniors and seniors who have completed English 185 and at least two level-II English courses or by permission of the instructor."
		},
		{
			"_updated": "2018-07-12T16:51:44.758076+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:37.484135+00:00",
			"enroll": "8",
			"max": "15"
		},
		{
			"_updated": "2018-11-02T04:18:44.550796+00:00",
			"firstyear": null,
			"sophomore": null
		}
	],
	"semester": 1,
	"sophomore": "0/0",
	"status": "O",
	"term": 20171,
	"title": "Topics in Post-Colonial Literatures",
	"type": "Topic",
	"year": 2017
}
