{
	"clbid": 115326,
	"credits": 1.0,
	"crsid": 626,
	"departments": [
		"HIST"
	],
	"description": "Historian Pierre Sorlin observed in the 1970s that most people get their knowledge about the past from movies, not from books or History courses. Films are powerful vehicles for immersing us in worlds from different times and places, establishing a narrative, showing us change over time, and developing an interpretation. Yet over four decades after Sorlin’s observation, historian Robert Rosenstone, himself a champion of using film to study history, noted that historical films still “trouble and disturb” most professional historians. Why is the common focus on the past shared by film and historical study so problematic? In what ways do film and historical study complement each other to help us understand the past? These are the big questions that inspire this course. To begin answering these questions, History 299 focuses on ways in which film has portrayed seminal developments and events\u0097and the contexts that produced them--in twentieth-century European history. We’ll “read” films as historical texts and explore their “meaning-making” capacity. We’ll treat some films as primary sources; we’ll examine others to consider how visions of the past bear upon the present\u0097for instance, how a particular age or generation seeks a “useable” past. We’ll compare filmic and current scholarly interpretations of the past to understand better the role of each in shaping historical memory. ORC credit.",
	"gereqs": [
		"ORC"
	],
	"instructors": [
		"Dolores Peters"
	],
	"level": 200,
	"locations": [
		"TBA"
	],
	"name": "Top: European History au Cinema",
	"notes": "Strongly recommended: Completion of at least one college-level course in modern European history prior to taking this course. This course does not fulfill an HWC.",
	"number": 299,
	"pn": false,
	"prerequisites": false,
	"semester": 1,
	"status": "O",
	"term": 20171,
	"times": [
		"M 0600-0900PM"
	],
	"title": "Topics in History",
	"type": "Topic",
	"year": 2017
}
