{
	"clbid": "0000115182",
	"credits": 1.0,
	"crsid": "0000021510",
	"department": "ENGL",
	"description": [
		"When Shakespeare first penned the phrase “All the world’s a stage” near the end of the sixteenth century, his plays were being performed on the stage of the Globe Theater in London. Over the last four hundred years, the entire globe has become a stage for Shakespeare’s plays, and this course will chart some of those journeys through space and time. We will study five of Shakespeare’s plays from several genres (comedy, tragedy, history), first placing them in their initial historical context, and then examining how these works have been translated, adapted, appropriated, revised and represented in performances around the world. Examples such of global responses may include Sulayman Al-Bassam’s The Al-Hamlet Summit, which transfers Shakespeare’s political upheaval to a contemporary Arabic context; Omkara, a Bollywood adaptation of Othello; and an Israeli production of The Merchant of Venice. If possible, the class will attend a performance of one of the plays on our syllabus; tickets and transportation will come to no more than $25. “Global Shakespeares” carries ALS-L credit, and counts as a pre-1800 course and a Cross-Disciplinary course for the English major. Prerequisite: FYW or equivalent."
	],
	"enrolled": 11,
	"gereqs": [
		"ALS-L"
	],
	"instructors": [
		"Karen E. Marsalek"
	],
	"learningmode": "S",
	"level": 200,
	"max": 30,
	"name": "Top: Global Shakespeares",
	"number": 260,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "RML 420",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "RML 420",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": "FYW or equivalent.",
	"revisions": [
		{
			"_updated": "2017-09-10T00:59:51.648331+00:00",
			"locations": [
				"RML 525",
				"RML 525"
			]
		},
		{
			"_updated": "2018-02-03T00:03:29.182393+00:00",
			"prerequisites": "Prerequisite: FYW or equivalent."
		},
		{
			"_updated": "2018-07-12T16:51:44.748056+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:37.477289+00:00",
			"enroll": "11",
			"max": "30"
		},
		{
			"_updated": "2020-10-15T15:24:03.541419+00:00",
			"learningmode": null
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20171,
	"title": "Topics in Cross-Disciplinary Literary Study",
	"type": "Topic",
	"year": 2017
}
