{
	"clbid": "0000096430",
	"credits": 1.0,
	"crsid": "0000000468",
	"department": "ENVST",
	"description": [
		"A capstone seminar for seniors in the major and concentration, this course involves intensive study of special topics utilizing student research projects and presentations. An academic civic engagement project relies on the expertise gained from their environmental studies courses and work in other majors as applicable. Topics relate to a local or regional environmental issues, providing participants with opportunities to interact with government and regulatory agencies and community groups. Offered spring semester. Prerequisites: ENVST 137, senior status, or permission of the environmental studies chair and instructor."
	],
	"enrolled": 17,
	"firstyear": "0/0",
	"instructors": [
		"Michael Swift"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 300,
	"max": 22,
	"name": "Sem: Environ Studies",
	"notes": [
		"Open to Senior Enviromental Studies majors only.",
		"Environmental Studies concentrators may register only with permission of",
		"instructor."
	],
	"number": 399,
	"offerings": [
		{
			"day": "Mo",
			"end": "14:55",
			"location": "RNS 400",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "14:55",
			"location": "RNS 400",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: ENVST 137, senior status, or permission of the environmental studies chair and instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.145146+00:00",
			"desc": "A capstone seminar for seniors in the major and concentration, this course involves intensive study of special topics utilizing student research projects and presentations. An academic civic engagement project relies on the expertise gained from their environmental studies courses and work in other majors as applicable. Topics relate to a local or regional environmental issue, providing participants with opportunities to interact with government and regulatory agencies and community groups. Prerequisites: ENVST 137, senior status, or permission of the environmental studies chair and instructor. Offered spring semester.",
			"prerequisites": "Prerequisites: ENVST 137, senior status, or permission of the environmental studies chair and instructor. Offered spring semester."
		},
		{
			"_updated": "2018-07-12T16:51:24.061576+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.837877+00:00",
			"enroll": "17",
			"max": "22"
		},
		{
			"_updated": "2018-11-02T04:18:24.746497+00:00",
			"firstyear": null,
			"junior": null,
			"sophomore": null
		},
		{
			"_updated": "2020-10-15T15:23:54.392469+00:00",
			"learningmode": null
		}
	],
	"semester": 3,
	"sophomore": "0/0",
	"status": "O",
	"term": 20143,
	"title": "Seminar in Environmental Studies",
	"type": "Seminar",
	"year": 2014
}
