{
	"clbid": "0000096522",
	"credits": 1.0,
	"crsid": "0000000325",
	"departments": [
		"EDUC"
	],
	"description": [
		"This course prepares pre-service communication arts/literature teachers to share their love of the English language with secondary students. Attention is given to the theory and techniques of teaching speech, listening, media literacy, writing, literature and reading. In addition, students explore topics including multicultural literature, adolescent literature, responding to and evaluating writing, unit planning in the language arts, and the National Council of Teachers of English Standards. Required field experience component. Offered annually in the spring semester. Prerequisite: EDUC 330."
	],
	"enroll": 2,
	"instructors": [
		"Elizabeth A. Leer"
	],
	"level": 300,
	"locations": [
		"TOH 302"
	],
	"max": 18,
	"name": "Tchg of Comm Arts/Lit",
	"number": 345,
	"pn": false,
	"prerequisites": "EDUC 330.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.222161+00:00",
			"desc": "This course prepares pre-service communication arts/literature teachers to share their love of the English language with secondary students. Attention is given to the theory and techniques of teaching speech, listening, media literacy, writing, literature and reading. In addition, students explore topics including multicultural literature, adolescent literature, responding to and evaluating writing, unit planning in the language arts, and the National Council of Teachers of English Standards. Required field experience component. Prerequisite: EDUC 330. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: EDUC 330. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.873980+00:00",
			"prerequisites": "Prerequisite: EDUC 330."
		},
		{
			"_updated": "2018-07-12T16:51:24.128756+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.884579+00:00",
			"enroll": "2",
			"max": "18"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"TTh 1115-1240PM"
	],
	"title": "Teaching of Communication Arts/Literature, 5-12",
	"type": "Research",
	"year": 2014
}
