{
	"clbid": "0000096483",
	"credits": 1.0,
	"crsid": "0000000292",
	"department": "CSCI",
	"description": [
		"This course provides an introduction to the structure and creation of computer software, using the C++ programming language and emphasizing object-oriented programming and structured collaborative software-development methodology. Concepts and skills are applied in a substantial team project. Topics include object-oriented programming, specification, programmed memory management, indirect addressing, tools including UML, team software process, requirements analysis, software design strategies, and elementary ethical analysis of software systems. Counts toward mathematical biology concentration; one of CSCI 121, CSCI 125, CSCI 251 counts toward linguistic studies concentration. Offered each semester.Prerequisite: CSCI 121 or CSCI 125 or CSCI 241 or PHYS 130 or MATH 252 or permission of instructor; concurrent registration in CSCI 252 is required."
	],
	"enrolled": 19,
	"groupid": "0000000292",
	"instructors": [
		"Richard Allen"
	],
	"learningmode": "S",
	"level": 200,
	"max": 25,
	"name": "Software Design",
	"notes": [
		"This course has class-year limits.",
		"Students in CSCI 251 must also register for one lab CSCI 252 AL or BL or CL."
	],
	"number": 251,
	"offerings": [
		{
			"day": "Mo",
			"end": "12:45",
			"location": "RNS 203",
			"start": "11:50"
		},
		{
			"day": "We",
			"end": "12:45",
			"location": "RNS 203",
			"start": "11:50"
		},
		{
			"day": "Fr",
			"end": "12:45",
			"location": "RNS 203",
			"start": "11:50"
		}
	],
	"pn": false,
	"prerequisites": "CSCI 121 or CSCI 125 or CSCI 241 or PHYS 130 or MATH 252 or permission of instructor; concurrent registration in CSCI 252 is required.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.177196+00:00",
			"desc": "This course provides an introduction to the structure and creation of computer software, using the C++ programming language and emphasizing object-oriented programming and structured collaborative software-development methodology. Concepts and skills are applied in a substantial team project. Topics include object-oriented programming, specification, programmed memory management, indirect addressing, tools including UML, team software process, requirements analysis, software design strategies, and elementary ethical analysis of software systems. Prerequisite: CSCI 121 or CSCI 125 or CSCI 241 or PHYS 130 or MATH 252 or permission of instructor; concurrent registration in CSCI 252 is required. Counts toward mathematical biology concentration; one of CSCI 121, CSCI 125, CSCI 251counts toward linguistic studies concentration. Offered each semester.",
			"prerequisites": "Prerequisite: CSCI 121 or CSCI 125 or CSCI 241 or PHYS 130 or MATH 252 or permission of instructor; concurrent registration in CSCI 252 is required. Counts toward mathematical biology concentration; one of CSCI 121, CSCI 125, CSCI 251counts toward linguistic studies concentration. Offered each semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.848715+00:00",
			"prerequisites": "Prerequisite: CSCI 121 or CSCI 125 or CSCI 241 or PHYS 130 or MATH 252 or permission of instructor; concurrent registration in CSCI 252 is required."
		},
		{
			"_updated": "2018-07-12T16:51:24.093808+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.860421+00:00",
			"enroll": "19",
			"max": "25"
		},
		{
			"_updated": "2020-10-15T15:23:54.404438+00:00",
			"learningmode": null
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"title": "Software Design and Implementation",
	"type": "Research",
	"year": 2014
}
