{
	"clbid": "0000096571",
	"credits": 1.0,
	"crsid": "0000022130",
	"department": "ENGL",
	"description": [
		"These courses emphasize the study of literature united by specific formal elements rather than by theme, topic, historical period, or national origin. The genre studied may be broad, such as narrative fiction, or narrowly defined, such as the elegy. The course focuses on the study of literature through a critical exploration of form. May be repeated if topics are different. Click on course title in the class and lab for more information about the course for that term. Prerequisite: FYW."
	],
	"enroll": 19,
	"gereqs": [
		"ALS-L"
	],
	"instructors": [
		"Bjorn Nordfjord"
	],
	"level": 200,
	"locations": [
		"RML 525"
	],
	"max": 30,
	"name": "Top: Great Amer Novel",
	"number": 280,
	"pn": false,
	"prerequisites": "FYW.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.288414+00:00",
			"desc": "These courses emphasize the study of literature united by specific formal elements rather than by theme, topic, historical period, or national origin. The genre studied may be broad, such as narrative fiction, or narrowly defined, such as the elegy. The course focuses on the study of literature through a critical exploration of form. May be repeated if topics are different. Prerequisite: FYW. Click on course title in the class and lab for more information about the course for that term.",
			"prerequisites": "Prerequisite: FYW. Click on course title in the class and lab for more information about the course for that term."
		},
		{
			"_updated": "2018-02-02T23:59:39.901206+00:00",
			"prerequisites": "Prerequisite: FYW."
		},
		{
			"_updated": "2018-07-12T16:51:24.169043+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.910653+00:00",
			"enroll": "19",
			"max": "30"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MWF 0800-0855"
	],
	"title": "Topics in Genre",
	"type": "Topic",
	"year": 2014
}
