{
	"clbid": "0000096335",
	"credits": 0.25,
	"crsid": "0000018783",
	"department": "MUSIC",
	"description": [
		"This continuation of 261 emphasizes sight playing, score reading, harmonization and transposition, more advanced improvisation and harmonic usage, performance preparation, and leadership from the keyboard. A grade of B- or higher satisfies Piano Proficiency Level 4 requirements. Offered annually in the spring semester. Prerequisite: MUSIC 261, completion of Piano Proficiency 3, or audition placement; concurrent registration in MUSIC 214 recommended."
	],
	"enrolled": 12,
	"instructors": [
		"Sandra Joy Friesen"
	],
	"learningmode": "S",
	"level": 200,
	"max": 12,
	"name": "Piano Class IV",
	"number": 262,
	"offerings": [
		{
			"day": "Mo",
			"end": "12:45",
			"location": "CHM 222",
			"start": "11:50"
		},
		{
			"day": "Fr",
			"end": "12:45",
			"location": "CHM 222",
			"start": "11:50"
		}
	],
	"pn": false,
	"prerequisites": "MUSIC 261, completion of Piano Proficiency 3, or audition placement; concurrent registration in MUSIC 214 recommended.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.051459+00:00",
			"desc": "This continuation of 261 emphasizes sight playing, score reading, harmonization and transposition, more advanced improvisation and harmonic usage, performance preparation, and leadership from the keyboard. A grade of B- or higher satisfies Piano Proficiency Level 4 requirements. Prerequisite: MUSIC 261, completion of Piano Proficiency 3, or audition placement; concurrent registration in MUSIC 214 recommended. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: MUSIC 261, completion of Piano Proficiency 3, or audition placement; concurrent registration in MUSIC 214 recommended. Offered annually in the spring semester."
		},
		{
			"_updated": "2017-05-30T15:51:49.683533+00:00",
			"instructors": [
				"Friesen Sandra Joy"
			]
		},
		{
			"_updated": "2018-02-02T23:59:39.767404+00:00",
			"prerequisites": "Prerequisite: MUSIC 261, completion of Piano Proficiency 3, or audition placement; concurrent registration in MUSIC 214 recommended."
		},
		{
			"_updated": "2018-07-12T16:51:23.980204+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.779336+00:00",
			"enroll": "12",
			"max": "12"
		},
		{
			"_updated": "2020-10-15T15:23:54.362645+00:00",
			"learningmode": null
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"type": "Research",
	"year": 2014
}
