{
	"clbid": "0000096369",
	"credits": 1.0,
	"crsid": "0000001074",
	"department": "PHYS",
	"description": [
		"This two-semester in-depth course addresses topics in classical and modern physics using algebra, geometry, and some calculus. The course is well-suited for students of biology or chemistry or for those desiring a thorough introduction beyond the high-school level.",
		"Physics 125 explores the character of electric and magnetic forces and fields, then takes up the extended description of matter (vibrations, waves - sound and light). Finally, both particle and wave descriptions are shown to be necessary for discussing quantum mechanics and its application to atomic physics. One laboratory meeting per week. Offered annually in the spring semester. Prerequisites: MATH 119 or MATH 120 or equivalent and PHYS 124."
	],
	"enroll": 46,
	"gereqs": [
		"SED"
	],
	"groupid": "0000001074",
	"instructors": [
		"Amy Larsen"
	],
	"level": 100,
	"locations": [
		"RNS 210"
	],
	"max": 60,
	"name": "Principles Physics II",
	"notes": [
		"Students in Physics 125 must also register for one",
		"lab Physics 125 AL, BL, CL, DL, or EL.",
		"Closed to first-year students."
	],
	"number": 125,
	"pn": false,
	"prerequisites": "Prerequisites: MATH 119 or MATH 120 or equivalent and PHYS 124.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.089347+00:00",
			"desc": "This two-semester in-depth course addresses topics in classical and modern physics using algebra, geometry, and some calculus. The course is well-suited for students of biology or chemistry or for those desiring a thorough introduction beyond the high-school level.\nPhysics 125 explores the character of electric and magnetic forces and fields, then takes up the extended description of matter (vibrations, waves - sound and light). Finally, both particle and wave descriptions are shown to be necessary for discussing quantum mechanics and its application to atomic physics. One laboratory meeting per week. Prerequisites: MATH 119 or MATH 120 or equivalent and PHYS 124. Offered annually in the spring semester.",
			"prerequisites": "Prerequisites: MATH 119 or MATH 120 or equivalent and PHYS 124. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-07-12T16:51:24.016881+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.804582+00:00",
			"enroll": "46",
			"max": "60"
		}
	],
	"section": "B",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MWF 1150-1245PM"
	],
	"title": "Principles of Physics II",
	"type": "Research",
	"year": 2014
}
