{
	"clbid": 96239,
	"credits": 1.0,
	"crsid": 960,
	"departments": [
		"NURS"
	],
	"description": [
		"Students explore issues related to the care of individuals suffering from acute and chronic psychiatric disorders. The course includes topics such as major mental illnesses, substance abuse, depression, and anxiety disorders. Students develop the roles of counselor and collaborator by working with an interdisciplinary team in providing care to patients in psychiatric settings. Clinical experiences and simulation emphasize the use of therapeutic communication, psychiatric assessment, and interpersonal relationship skills. Offered annually in the spring semester. Prerequisite: NURS 388."
	],
	"instructors": [
		"Susan Huehn"
	],
	"level": 300,
	"locations": [
		"HH 317"
	],
	"name": "Mental Health",
	"notes": [
		"Open to Nursing majors only.",
		"Will also meet T/Th 7:00 a.m. - 3:00 p.m. in HH 320."
	],
	"number": 392,
	"pn": false,
	"prerequisites": "NURS 388.",
	"revisions": [
		{
			"_updated": "2015-10-31T05:23:18.551978+00:00",
			"instructors": [
				"Susan L. Huehn"
			]
		},
		{
			"_updated": "2016-01-30T15:05:06.974224+00:00",
			"desc": "Students explore issues related to the care of individuals suffering from acute and chronic psychiatric disorders. The course includes topics such as major mental illnesses, substance abuse, depression, and anxiety disorders. Students develop the roles of counselor and collaborator by working with an interdisciplinary team in providing care to patients in psychiatric settings. Clinical experiences and simulation emphasize the use of therapeutic communication, psychiatric assessment, and interpersonal relationship skills. Prerequisite: NURS 388. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: NURS 388. Offered annually in the spring semester."
		},
		{
			"_updated": "2017-05-30T15:51:49.655413+00:00",
			"instructors": [
				"Huehn Susan"
			]
		},
		{
			"_updated": "2018-02-02T23:59:39.711510+00:00",
			"prerequisites": "Prerequisite: NURS 388."
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MWF 0905-1000"
	],
	"type": "Research",
	"year": 2014
}
