{
	"clbid": 96007,
	"credits": 1.0,
	"crsid": 45,
	"departments": [
		"ART"
	],
	"description": [
		"This intermediate-level course assumes students have a substantial understanding of ceramic processes, plus a good awareness of their own interests in the realm of ceramic expression. The instructor helps students focus their efforts by proposing specific areas of investigation. Materials fee. Offered annually. Prerequisite: ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor."
	],
	"instructors": [
		"Kathryne Fisher"
	],
	"level": 200,
	"locations": [
		"CAD 115",
		"CAD 115"
	],
	"name": "Intermediate Ceramics",
	"notes": [
		"This course has class-year limits."
	],
	"number": 234,
	"pn": false,
	"prerequisites": "ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.798386+00:00",
			"desc": "This intermediate-level course assumes students have a substantial understanding of ceramic processes, plus a good awareness of their own interests in the realm of ceramic expression. The instructor helps students focus their efforts by proposing specific areas of investigation. Prerequisite: ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor. Materials fee. Offered annually.",
			"prerequisites": "Prerequisite: ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor. Materials fee. Offered annually."
		},
		{
			"_updated": "2017-05-30T15:51:49.574627+00:00",
			"locations": [
				"DC 115",
				"DC 115"
			]
		},
		{
			"_updated": "2018-02-02T23:59:39.521817+00:00",
			"prerequisites": "Prerequisite: ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"T 0800-1100",
		"Th 0800-1050"
	],
	"type": "Research",
	"year": 2014
}
