{
	"clbid": "0000096498",
	"credits": 1.0,
	"crsid": "0000001405",
	"department": "STAT",
	"description": [
		"This course takes a case-study approach to the fitting and assessment of statistical models with application to real data. Specific topics include multiple regression, model diagnostics, and logistic regression. The approach focuses on problem-solving tools, interpretation, mathematical models underlying analysis methods, and written statistical reports. Offered each semester. Counts toward mathematical biology concentration. Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor."
	],
	"enrolled": 21,
	"instructors": [
		"Paul J. Roback"
	],
	"learningmode": "S",
	"level": 200,
	"max": 24,
	"name": "Statistical Modeling",
	"number": 272,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "TOH 182",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "TOH 182",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": "STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:57.943760+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T15:05:07.189416+00:00",
			"desc": "This course takes a case-study approach to the fitting and assessment of statistical models with application to real data. Specific topics include multiple regression, model diagnostics, and logistic regression. The approach focuses on problem-solving tools, interpretation, mathematical models underlying analysis methods, and written statistical reports. Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor. Offered each semester. Counts toward mathematical biology concentration.",
			"prerequisites": "Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor. Offered each semester. Counts toward mathematical biology concentration."
		},
		{
			"_updated": "2018-02-02T23:59:39.857852+00:00",
			"prerequisites": "Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:24.106430+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.869183+00:00",
			"enroll": "21",
			"max": "24"
		},
		{
			"_updated": "2020-10-15T15:23:54.409187+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:17.414456+00:00",
			"gereqs": [
				"WRI"
			]
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"type": "Research",
	"year": 2014
}
