{
	"clbid": "0000096525",
	"credits": 1.0,
	"crsid": "0000000334",
	"department": "EDUC",
	"description": [
		"Students acquire the skills, knowledge and attitudes to become successful teachers in the secondary social studies classroom. They use the curriculum standards of the National Council for Social Studies and those identified by the State of Minnesota to develop goals, outcomes, and assessments for the various content areas. Students acquire the knowledge, skills, and understandings necessary to address appropriate skills development in 5-12 social studies classrooms. Required field experience component. Offered annually in the spring semester. Prerequisite: EDUC 330."
	],
	"enrolled": 6,
	"firstyear": "0/0",
	"instructors": [
		"Sarah S. McDonald"
	],
	"learningmode": "S",
	"level": 300,
	"max": 18,
	"name": "Tchg of Soc Studies",
	"number": 365,
	"offerings": [
		{
			"day": "Mo",
			"end": "22:00",
			"location": "TOH 214",
			"start": "19:00"
		}
	],
	"pn": false,
	"prerequisites": "EDUC 330.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.226560+00:00",
			"desc": "Students acquire the skills, knowledge and attitudes to become successful teachers in secondary social studies classroom. They use the curriculum standards of the National Council for Social Studies and those identified by the State of Minnesota to develop goals, outcomes, and assessments for the various content areas. Students acquire the knowledge, skills, and understandings necessary to address appropriate skills development in 5-12 social studies classrooms. Required field experience component. Prerequisite: EDUC 330. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: EDUC 330. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.876988+00:00",
			"prerequisites": "Prerequisite: EDUC 330."
		},
		{
			"_updated": "2018-07-12T16:51:24.132969+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.887441+00:00",
			"enroll": "6",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:24.789699+00:00",
			"firstyear": null,
			"sophomore": null
		},
		{
			"_updated": "2020-10-15T15:23:54.418904+00:00",
			"learningmode": null
		}
	],
	"semester": 3,
	"sophomore": "0/0",
	"status": "O",
	"term": 20143,
	"title": "Teaching of Social Studies, 5-12",
	"type": "Research",
	"year": 2014
}
