{
	"clbid": 96495,
	"credits": 1.0,
	"crsid": 71,
	"departments": [
		"ART"
	],
	"description": "This capstone course in the studio art program consists of advanced studio work, a visiting artist series, weekly critiques, and discussions with faculty and peers. Each student's independent work with a faculty advisor culminates in a senior exhibition at Flaten Art Museum. Weekly sessions also cover such topics as preparing a resume, documenting one's work, framing, and producing exhibition announcements and posters. Offered annually. Prerequisites: (for non-studio majors) Art 102, ART 103, ART 104, two upper-level (200-300) courses, one art history course, and permission of chair",
	"instructors": [
		"Peter B. Nelson",
		"Wendell Arneson"
	],
	"level": 300,
	"locations": [
		"TBA",
		"DC 305"
	],
	"name": "Sr Studies/Studio Art",
	"notes": "Open to Seniors only.",
	"number": 343,
	"pn": false,
	"prerequisites": "Prerequisites: (for non-studio majors) Art 102, ART 103, ART 104, two upper-level (200-300) courses, one art history course, and permission of chair",
	"revisions": [
		{
			"_updated": "2016-01-30T09:05:07.185782-06:00",
			"desc": "This capstone course in the studio art program consists of advanced studio work, a visiting artist series, weekly critiques, and discussions with faculty and peers. Each student's independent work with a faculty advisor culminates in a senior exhibition at Flaten Art Museum. Weekly sessions also cover such topics as preparing a resume, documenting one's work, framing, and producing exhibition announcements and posters. Offered annually. Non-studio majors seeking admission into Art 343 must fulfill the following requirements in the Department of Art and Art History: ·ART 102, ART 103, ART 104 ·Two upper-level (200 or 300) courses ·One art history course ·Permission of chair",
			"prerequisites": false
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MW 0100-0300PM",
		"M 0700-0900PM"
	],
	"title": "Senior Studies in Studio Art",
	"type": "Research",
	"year": 2014
}
