{
	"clbid": "0000096251",
	"credits": 1.0,
	"crsid": "0000016235",
	"department": "MATH",
	"description": [
		"Modern mathematics is characterized by the interaction of theoretical and computational techniques. In this course, students study topics from pure and applied mathematics with the aid of computation. Symbolic, graphical, and numerical computational techniques are introduced. Students develop computational skills sufficient to investigate mathematical questions independently. No previous programming experience is required. Offered annually. Counts toward mathematical biology concentration. Prerequisite: MATH 220."
	],
	"enrolled": 23,
	"instructors": [
		"Steven McKelvey"
	],
	"level": 200,
	"max": 20,
	"name": "Modern Computational Math",
	"number": 242,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "RNS 204",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "RNS 204",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "RNS 204",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "MATH 220.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.986990+00:00",
			"desc": "Modern mathematics is characterized by the interaction of theoretical and computational techniques. In this course, students study topics from pure and applied mathematics with the aid of computation. Symbolic, graphical, and numerical computational techniques are introduced. Students develop computational skills sufficient to investigate mathematical questions independently. No previous programming experience is required. Prerequisite: MATH 220. Offered annually. Counts toward mathematical biology concentration.",
			"prerequisites": "Prerequisite: MATH 220. Offered annually. Counts toward mathematical biology concentration."
		},
		{
			"_updated": "2018-02-02T23:59:39.721470+00:00",
			"prerequisites": "Prerequisite: MATH 220."
		},
		{
			"_updated": "2018-07-12T16:51:23.922381+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.739675+00:00",
			"enroll": "23",
			"max": "20"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"title": "Modern Computational Mathematics",
	"type": "Research",
	"year": 2014
}
