{
	"clbid": "0000096250",
	"credits": 1.0,
	"crsid": "0000000609",
	"departments": [
		"ASIAN",
		"HIST"
	],
	"description": [
		"This class examines reform and revolution at the end of the Qing dynasty; the creation and collapse of the first Republic; warlordism, the New Culture Movement, social and cultural change, and the rise of Chinese nationalism; Japanese invasion, civil war, and the Communist victory; the People’s Republic since 1949; economic and social change, conflict with the Soviet Union, the Cultural Revolution, Maoism and Mao’s legacy; and China’s recent economic and political transformation. Foreign Language Across the Curriculum course available in Chinese for students at the third-year level in the language. Offered annually."
	],
	"enroll": 26,
	"gereqs": [
		"MCG"
	],
	"instructors": [
		"Robert Entenmann"
	],
	"level": 200,
	"locations": [
		"HH 403"
	],
	"max": 30,
	"name": "Modern China",
	"number": 251,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:57.747276+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T15:05:06.985631+00:00",
			"desc": "This class examines reform and revolution at the end of Qing dynasty; the creation and collapse of the first Republic; warlordism, the New Culture Movement, social and cultural change, and the rise of Chinese nationalism; Japanese invasion, civil war, and the Communist victory; the People’s Republic since 1949; economic and social change, conflict with the Soviet Union, the Cultural Revolution, Maoism and Mao’s legacy; and China’s recent economic and political transformation. Foreign Language Across the Curriculum course available in Chinese for students at the third-year level in the language. Offered most years."
		},
		{
			"_updated": "2018-07-12T16:51:23.921009+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.738652+00:00",
			"enroll": "26",
			"max": "30"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 0200-0255PM"
	],
	"type": "Research",
	"year": 2014
}
