{
	"clbid": "0000096449",
	"credits": 1.0,
	"crsid": "0000022783",
	"department": "THEAT",
	"description": [
		"This is a seminar course open exclusively to theater majors, to be taken during the spring semester of the senior year. Students engage in analysis of performance work as well as dissemination of creative work through written and spoken presentation methods. Each student applies research, analysis, writing, and presentation methods in the exploration of a particular theater topic or case study of his or her choosing. Offered annually in the spring semester. Prerequisites: THEAT 130, THEAT 140, THEAT 180, THEAT 232, THEAT 240 or THEAT 250, THEAT 270 or THEAT 271 or permission of instructor."
	],
	"enrolled": 10,
	"instructors": [
		"Jeanne I. Willcoxon"
	],
	"level": 300,
	"max": 21,
	"name": "Senior Capstone",
	"number": 360,
	"offerings": [
		{
			"day": "Mo",
			"end": "14:55",
			"location": "RNS 226",
			"start": "14:00"
		},
		{
			"day": "We",
			"end": "14:55",
			"location": "RNS 226",
			"start": "14:00"
		},
		{
			"day": "Fr",
			"end": "14:55",
			"location": "RNS 226",
			"start": "14:00"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: THEAT 130, THEAT 140, THEAT 180, THEAT 232, THEAT 240 or THEAT 250, THEAT 270 or THEAT 271 or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:57.907647+00:00",
			"locations": [
				"TB 227"
			]
		},
		{
			"_updated": "2016-01-30T15:05:07.156398+00:00",
			"desc": "This is a seminar course open exclusively to theater majors, to be taken during the spring semester of the senior year. Students engage in analysis of performance work as well as dissemination of creative work through written and spoken presentation methods. Each student applies research, analysis, writing, and presentation methods in the exploration of a particular theater topic or case study of his or her choosing. Prerequisites: THEAT 130, THEAT 140, THEAT 180, THEAT 232, THEAT 240 or THEAT 250, THEAT 270 or THEAT 271 or permission of instructor. Offered annually in the spring semester.",
			"prerequisites": "Prerequisites: THEAT 130, THEAT 140, THEAT 180, THEAT 232, THEAT 240 or THEAT 250, THEAT 270 or THEAT 271 or permission of instructor. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-07-12T16:51:24.072796+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.845900+00:00",
			"enroll": "10",
			"max": "21"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"type": "Seminar",
	"year": 2014
}
