{
	"clbid": "0000096229",
	"credits": 1.0,
	"crsid": "0000001093",
	"department": "PHYS",
	"description": [
		"This course utilizes integral and vector calculus in a thorough and analytic examination of classical electromagnetic theory and the physical laws on which it is based. Topics include electric and magnetic fields, macroscopic interaction of electromagnetism with matter, and the propagation of electromagnetic waves in various media. Offered annually in the spring semester. Prerequisites: PHYS 232 and MATH 230 and either MATH 226 or MATH 330 or similar course upon approval of the department chair; concurrent registration in PHYS 385 is required."
	],
	"enrolled": 14,
	"instructors": [
		"Matt Wiebold"
	],
	"level": 300,
	"locations": [
		"RNS 297"
	],
	"max": 22,
	"name": "Maxwell's Equations",
	"number": 375,
	"pn": false,
	"prerequisites": "Prerequisites: PHYS 232 and MATH 230 and either MATH 226 or MATH 330 or similar course upon approval of the department chair; concurrent registration in PHYS 385 is required.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.960826+00:00",
			"desc": "This course utilizes integral and vector calculus in a thorough and analytic examination of classical electromagnetic theory and the physical laws on which it is based. Topics include electric and magnetic fields, macroscopic interaction of electromagnetism with matter, and the propagation of electromagnetic waves in various media. Prerequisites: PHYS 232 and MATH 230 and either MATH 226 or MATH 330 or similar course upon approval of the department chair; concurrent registration in PHYS 385 is required. Offered annually in the spring semester.",
			"prerequisites": "Prerequisites: PHYS 232 and MATH 230 and either MATH 226 or MATH 330 or similar course upon approval of the department chair; concurrent registration in PHYS 385 is required. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-07-12T16:51:23.897948+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.723274+00:00",
			"enroll": "14",
			"max": "22"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "O",
	"term": 20143,
	"times": [
		"MWF 0800-0855"
	],
	"type": "Research",
	"year": 2014
}
