{
	"clbid": "0000096242",
	"credits": 1.0,
	"crsid": "0000000787",
	"department": "MGMT",
	"description": [
		"This is a capstone course for students with a management studies concentration or management area of emphasis in the economics major. Students have the opportunity to further develop their planning and decision-making skills through focused study of the management literature and case analysis exercises. Emphasis is given to identifying, analyzing, and solving organizational problems, which are strategic in nature and cut across all functional areas of the organization. Offered annually in the spring semester. Prerequisite: MGMT 250 or MGMT 251 and senior status or permission of the instructor."
	],
	"enrolled": 22,
	"instructors": [
		"Sian E. Muir"
	],
	"level": 300,
	"max": 30,
	"name": "Mgmt Policy & Strat",
	"number": 383,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "HH 307",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "HH 307",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "HH 307",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": "MGMT 250 or MGMT 251 and senior status or permission of the instructor.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:06.976827+00:00",
			"desc": "This is a capstone course for students with a management studies concentration or management area of emphasis in the economics major. Students have the opportunity to further develop their planning and decision-making skills through focused study of the management literature and case analysis exercises. Emphasis is given to identifying, analyzing, and solving organizational problems, which are strategic in nature and cut across all functional areas of the organization. Prerequisite: MGMT 250 or MGMT 251, senior status or permission of the instructor. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: MGMT 250 or MGMT 251, senior status or permission of the instructor. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.713819+00:00",
			"prerequisites": "Prerequisite: MGMT 250 or MGMT 251 and senior status or permission of the instructor."
		},
		{
			"_updated": "2018-07-12T16:51:23.911572+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.731971+00:00",
			"enroll": "22",
			"max": "30"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"title": "Management Policy and Strategy",
	"type": "Research",
	"year": 2014
}
