{
	"clbid": 96333,
	"credits": 0.25,
	"crsid": 808,
	"departments": [
		"MUSIC"
	],
	"description": [
		"In this continuation of MUSIC 161, students further develop their reading fluency and technical skill, and work with more advanced harmonic idioms. Class activities include harmonization and transposition, score reading, performance, by-ear playing, and improvisation. A grade of B- or higher satisfies Piano Proficiency Level 2 requirements. Offered annually in the spring semester. Prerequisite: MUSIC 161, completion of Piano Proficiency Level 1, or audition placement. Concurrent registration in MUSIC 114."
	],
	"enroll": 12,
	"instructors": [
		"Linda Berger"
	],
	"level": 100,
	"locations": [
		"CHM 222",
		"CHM 222"
	],
	"max": 12,
	"name": "Piano Class II",
	"number": 162,
	"pn": false,
	"prerequisites": "MUSIC 161, completion of Piano Proficiency Level 1, or audition placement. Concurrent registration in MUSIC 114.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.048454+00:00",
			"desc": "In this continuation of MUSIC 161, students further develop their reading fluency and technical skil l, and work with more advanced harmonic idioms. Class activities include harmonization and transposition, score reading, performance, by-ear playing, and improvisation. A grade of B- or higher satisfies Piano Proficiency Level 2 requirements. Prerequisite: MUSIC 161, completion of Piano Proficiency Level 1, or audition placement. Prerequisite: concurrent registration in MUSIC 114. Offered annually in the spring semester.",
			"prerequisites": "Prerequisite: MUSIC 161, completion of Piano Proficiency Level 1, or audition placement. Prerequisite: concurrent registration in MUSIC 114. Offered annually in the spring semester."
		},
		{
			"_updated": "2018-02-02T23:59:39.765303+00:00",
			"prerequisites": "Prerequisite: MUSIC 161, completion of Piano Proficiency Level 1, or audition placement. Concurrent registration in MUSIC 114."
		},
		{
			"_updated": "2018-07-12T16:51:23.977400+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:17.777368+00:00",
			"enroll": "12",
			"max": "12"
		}
	],
	"section": "C",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"T 1005-1100",
		"Th 0955-1050"
	],
	"type": "Research",
	"year": 2014
}
