{
	"clbid": "0000099784",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Sharing Science With the Public - We live in an exciting age when scientific fields are making rapid and exciting advances in knowledge, from the molecular and cellular level to a grander understanding of the cosmos. Despite increased interest in these findings, reading about science can be daunting when faced with scientific language, complicated procedures, and abstract analyses. Science writers face the difficult task of translating and communicating technical and complex findings into summaries that lay audiences can easily understand. This can be further complicated as audiences vary widely in their needs, expertise, and expectations, and thus science writers need to adjust their writing styles accordingly. In this seminar, we will read primary science resources, blogs, opinion pieces, magazines, books, and additional texts to explore how science writing can contribute to the public understanding of science. We will hone our own writing skills by communicating scientific findings in a series of blog posts and essays designed for varying audiences. Throughout the semester, we will discuss how science writers can better convey science findings to inform, intrigue, and educate the public in a nuanced and engaging manner."
	],
	"enrolled": 18,
	"instructors": [
		"M. Minda Oriña"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Topic: Sharing Science With the Public"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "RML 520",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "RML 520",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "RML 520",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.018255+00:00",
			"locations": [
				"RML 420"
			]
		},
		{
			"_updated": "2015-06-08T23:00:24.804437+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-22T05:00:16.962122+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.566584+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:27.353287+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.172692+00:00",
			"enroll": "18",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:27.857054+00:00",
			"junior": null,
			"senior": null
		},
		{
			"_updated": "2020-09-18T15:03:52.000239+00:00",
			"max": 18
		},
		{
			"_updated": "2020-10-15T15:23:56.003671+00:00",
			"learningmode": null
		},
		{
			"_updated": "2021-03-02T16:51:33.491631+00:00",
			"max": 19
		},
		{
			"_updated": "2025-10-11T21:36:18.877075+00:00",
			"gereqs": [
				"FYW"
			]
		}
	],
	"section": "A",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20151,
	"type": "Research",
	"year": 2015
}
