{
	"clbid": 99598,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": [
		"The Biblical Animal - Adam and Eve frolic through a garden of living things, and Noah navigates a floating zoo. Jonah gets stuck in the belly of a big fish, and Job faces the unseemly monstrosities of Behemoth and Leviathan. Strange lambs, lions, beasts, dogs, doves, donkeys, and other creatures populate biblical texts, often unnoticed. With these nonhuman creatures in mind, this section will focus on ‘ecotheological’ and ‘ecocritical’ readings of creation in biblical narratives. We’ll examine the bible’s relationship to environmentalism and critical animal studies\u0097paying particular attention to how these texts portray what it means to be a “human” or “nonhuman” creature. We’ll look at the vital roles nonhuman creatures play in these stories, and we’ll ask what kinds of perspectives these creatures may give on the earth and contemporary environmental issues."
	],
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Jacob J. Erickson"
	],
	"level": 100,
	"locations": [
		"OM 340",
		"OM 340"
	],
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Topic: The Biblical Animal"
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:10.815488+00:00",
			"locations": [
				"OM 310",
				"OM 310"
			]
		},
		{
			"_updated": "2015-06-04T17:00:29.809037+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-22T23:00:24.379575+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.322717+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "I",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
