{
	"clbid": "0000099741",
	"credits": 1.0,
	"crsid": "0000000139",
	"departments": [
		"BIO"
	],
	"description": [
		"Ecology focuses on the study of the interrelationships that determine the distribution and abundance of organisms. This core course examines organism-environment interactions and the study of populations, communities and ecosystems. Consideration is given to use of ecological studies in ecosystem management. Students attend lectures plus one three-hour laboratory per week. Offered each semester. Counts as \"ecology\" core category. Counts toward environmental studies major (all emphases) and concentration and mathematical biology concentration. Prerequisites: BIO 150 or BIO 126."
	],
	"enroll": 76,
	"gereqs": [
		"SED"
	],
	"groupid": "0000000139",
	"instructors": [
		"Alyson Center"
	],
	"level": 200,
	"locations": [
		"RNS 150"
	],
	"max": 88,
	"name": "Ecological Principles",
	"notes": [
		"Students in Bio 261 must also register for one lab Bio 261 AL, BL, CL, or DL.",
		"Not open to first-year students."
	],
	"number": 261,
	"pn": false,
	"prerequisites": "Prerequisites: BIO 150 or BIO 126.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:10.972056+00:00",
			"desc": "Ecology focuses on the study of the interrelationships that determine the distribution and abundance of organisms. This core course examines organism-environment interactions and the study of populations, communities and ecosystems. Consideration is given to use of ecological studies in ecosystem management. Students attend lectures plus one three-hour laboratory per week. Offered each semester. Counts as \"ecology\" core category. Counts toward environmental studies major (all tracks) and concentration. Prerequisites: BIO150 or BIO 126.",
			"instructors": [
				"Staff"
			],
			"locations": [
				"RNS 410"
			]
		},
		{
			"_updated": "2015-04-28T23:00:18.203652+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-05-08T23:00:18.210514+00:00",
			"notes": "Students in Bio 261 must also register for one lab Bio 261 AL, BL, or CL. Not open to first-year students."
		},
		{
			"_updated": "2015-09-23T04:33:11.666629+00:00",
			"status": "C"
		},
		{
			"_updated": "2016-01-30T14:55:50.511296+00:00",
			"desc": "Ecology focuses on the study of the interrelationships that determine the distribution and abundance of organisms. This core course examines organism-environment interactions and the study of populations, communities and ecosystems. Consideration is given to use of ecological studies in ecosystem management. Students attend lectures plus one three-hour laboratory per week. Offered each semester. Counts as \"ecology\" core category. Counts toward environmental studies major (all tracks) and concentration. Prerequisites: BIO 150 or BIO 126."
		},
		{
			"_updated": "2018-07-12T16:51:27.329758+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.145152+00:00",
			"enroll": "76",
			"max": "88"
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20151,
	"times": [
		"MWF 0800-0855"
	],
	"type": "Research",
	"year": 2015
}
