{
	"clbid": "0000099920",
	"credits": 1.0,
	"crsid": "0000018795",
	"department": "CH/BI",
	"description": [
		"This course introduces chemical concepts that are important for students pursuing a study of chemistry or biology. Topics include atomic structure, the periodic table, bonding interactions within and between particles, water and its solutions, biological membranes, chemical reaction types, chemical stoichiometry, equilibrium systems, acids and bases, introduction to protein structure. Examples are often pulled from the realm of biological molecules and processes. Students attend three classes and one three-hour laboratory each week. Placement via online placement exam is required. Offered annually in the fall semester. Prerequisites: high school biology, chemistry, and physics; concurrent registration in MATH 119 or MATH 120 is recommended."
	],
	"enrolled": 44,
	"groupid": "0000018795",
	"instructors": [
		"Beth Abdella"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 46,
	"name": "Integrated Chem/Bio I",
	"notes": [
		"Students in CH/BI 125 must also register for lab section CH/BI 125 AL or BL.",
		"Closed until first-year student registration in September."
	],
	"number": 125,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "RNS 290",
			"start": "09:05"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "RNS 290",
			"start": "09:05"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "RNS 290",
			"start": "09:05"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: high school biology, chemistry, and physics; concurrent registration in MATH 119 or MATH 120 is recommended.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.144578+00:00",
			"desc": "This course introduces chemical concepts that are important for students pursuing a study of chemistry or biology. Topics include atomic structure, the periodic table, bonding interactions within and between particles, water and its solutions, biological membranes, chemical reaction types, chemical stoichiometry, equilibrium systems, acids and bases, introduction to protein structure. Examples are often pulled from the realm of biological molecules and processes. Students attend three classes and one three-hour laboratory each week. Placement via online placement exam is required. Offered annually inthe fall semester. Prerequisites: highs chool biology, chemistry, and physics; concurrent registration in MATH 119 or MATH 120 is recommended."
		},
		{
			"_updated": "2015-04-24T05:00:38.153143+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-07-28T23:00:19.850741+00:00",
			"status": "C"
		},
		{
			"_updated": "2015-09-23T04:33:13.277193+00:00",
			"status": "O"
		},
		{
			"_updated": "2018-07-12T16:51:27.421194+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.249081+00:00",
			"enroll": "44",
			"max": "46"
		},
		{
			"_updated": "2018-11-02T04:18:27.956912+00:00",
			"junior": null,
			"senior": null,
			"sophomore": null
		},
		{
			"_updated": "2020-09-18T15:03:52.041237+00:00",
			"max": 46
		},
		{
			"_updated": "2020-10-15T15:23:56.049119+00:00",
			"learningmode": null
		},
		{
			"_updated": "2021-03-02T16:51:33.537668+00:00",
			"max": 48
		},
		{
			"_updated": "2025-10-11T21:36:18.914496+00:00",
			"gereqs": [
				"IST",
				"SED"
			]
		}
	],
	"semester": 1,
	"senior": "1/0",
	"sophomore": "0/0",
	"status": "C",
	"term": 20151,
	"title": "Integrated Chem/Bio I: Chemical Concepts with Biological Applications",
	"type": "Research",
	"year": 2015
}
