{
	"clbid": 99789,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": "Think Globally, Act Locally - An environmental mantra in recent decades has been \u0093Think Globally, Act Locally.\u0094 Is this simply a catchy phrase? Or a call to action? A framework for living? Students will read texts, research current events, watch films, and write essays in order to examine the adequacy of this slogan in regards to environmentalism. Intellectual play as well as experiential learning will be encouraged. You must be enrolled in the Environmental Conversations program to take this course.",
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Mark Allister"
	],
	"level": 100,
	"locations": [
		"RML 520"
	],
	"name": "First-Year Writing",
	"notes": "Open to Environmental Conversations students only. Section Topic: Think Globally, Act Locally. Closed until new student registration in September.",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.026487+00:00",
			"locations": [
				"RML 420"
			]
		},
		{
			"_updated": "2015-04-09T18:41:50.017552+00:00",
			"notes": "Open to Environmental Conversations students only."
		},
		{
			"_updated": "2015-04-24T05:00:36.315174+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-06-08T23:00:24.847346+00:00",
			"notes": "Open to Environmental Conversations students only. Closed until new student registration in September."
		},
		{
			"_updated": "2015-06-09T05:00:18.225387+00:00",
			"notes": "Open to Environmental Conversations students only. Section Topic: Think Globally, Act Locally Closed until new student registration in September."
		},
		{
			"_updated": "2015-06-19T23:00:23.643804+00:00",
			"status": "C"
		},
		{
			"_updated": "2015-07-13T23:00:17.973054+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.574885+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "C",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"MWF 1045-1140"
	],
	"type": "Research",
	"year": 2015
}
