{
	"clbid": "0000099734",
	"credits": 1.0,
	"crsid": "0000000740",
	"departments": [
		"MATH"
	],
	"description": [
		"This course introduces differential equations and analytical, numerical, and graphical techniques for the analysis of their solutions. First- and second-order differential equations and linear systems are studied. Applications are selected from areas such as biology, chemistry, economics, ecology, and physics. Laplace transforms or nonlinear systems may be covered as time permits. Students use computers extensively to calculate and visualize results. Offered each semester. Counts toward neuroscience, management studies, and mathematical biology concentrations. Prerequisite: MATH 126 or MATH 128 and MATH 220."
	],
	"enroll": 21,
	"instructors": [
		"Joseph Benson"
	],
	"level": 200,
	"locations": [
		"RNS 204"
	],
	"max": 22,
	"name": "Differential Equations I",
	"notes": [
		"Open to first-year students with permission of department chair."
	],
	"number": 230,
	"pn": false,
	"prerequisites": "MATH 126 or MATH 128 and MATH 220.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:10.964828+00:00",
			"instructors": [
				"Paul Zorn"
			],
			"locations": [
				"TOH 184"
			]
		},
		{
			"_updated": "2015-04-07T21:54:33.197508+00:00",
			"times": [
				"MWF 1045-1140"
			]
		},
		{
			"_updated": "2015-04-14T05:40:42.458448+00:00",
			"section": "A"
		},
		{
			"_updated": "2015-05-08T05:00:13.299773+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-09-23T04:33:11.590598+00:00",
			"notes": null
		},
		{
			"_updated": "2016-01-30T14:55:50.464243+00:00",
			"desc": "This course introduces differential equations and analytical, numerical, and graphical techniques for the analysis of their solutions. First- and second-order differential equations and linear systems are studied. Applications are selected from areas such as biology, chemistry, economics, ecology, and physics. Laplace transforms or nonlinear systems may be covered as time permits. Students use computers extensively to calculate and visualize results. Offered each semester. Counts toward neuroscience and mathematical biology concentrations. Prerequisite: MATH 126 or MATH 128 and MATH 220."
		},
		{
			"_updated": "2018-02-03T00:00:24.368881+00:00",
			"prerequisites": "Prerequisite: MATH 126 or MATH 128 and MATH 220."
		},
		{
			"_updated": "2018-07-12T16:51:27.326258+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.140964+00:00",
			"enroll": "21",
			"max": "22"
		}
	],
	"section": "B",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2015
}
