{
	"clbid": "0000099786",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Seeing Race in the Twenty-First Century - In the past several years, the nation’s attention has repeatedly turned to race and its role in contemporary life. Yet, in the public protests and debates that have followed events such as the deaths of Trayvon Martin and Michael Brown, activists, scholars, political leaders, journalists, and—not least of all—college students have pointed to the shortcomings of the contemporary dialogue about race. This seminar is intended to address this need. Over the course of the semester, we will consider the role of race in aspects of twenty-first-century American life including education, housing, jobs, and the law; examine its presence on contemporary college campuses; and trace its appearance in popular culture. Readings and other materials for this distinctly interdisciplinary seminar will be drawn from the social sciences, the arts, and the humanities."
	],
	"enrolled": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Jonathan T. Naito"
	],
	"junior": "0/0",
	"level": 100,
	"max": 19,
	"name": "First-Year Writing",
	"notes": [
		"Section Topic: Seeing Race in the Twenty-First Century"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "TOH 316",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "TOH 316",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.021716+00:00",
			"locations": [
				"OM 020",
				"OM 020"
			]
		},
		{
			"_updated": "2015-06-09T05:00:18.200323+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-22T05:00:16.995953+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.571068+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:27.355017+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.174120+00:00",
			"enroll": "18",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:27.858954+00:00",
			"junior": null,
			"senior": null
		},
		{
			"_updated": "2020-09-18T15:03:52.001346+00:00",
			"max": 18
		}
	],
	"section": "L",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20151,
	"type": "Research",
	"year": 2015
}
