{
	"clbid": "0000099593",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"Belonging as Blessing and Challenge - Throughout the Bible we find stories of conflict and hope within families, communities, and nations. Lines are drawn and identities defined as individuals and groups interpret their relationship with God and with one another. In this section we will discuss how kinship, ethnicity, and friendship function within key Biblical narratives. How are various identities defined and contested? Are the boundaries fixed or porous? Making use of historical, literary, and theological methods we will examine the benefits and burdens of belonging. While looking at the Bible we will also examine our own context and questions about identity, racism, political power, and social solidarity."
	],
	"enroll": 18,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Anthony Bateza"
	],
	"level": 100,
	"locations": [
		"OM 210"
	],
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Topic: Belonging as Blessing and Challenge"
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:10.806581+00:00",
			"locations": [
				"OM 305"
			]
		},
		{
			"_updated": "2015-06-04T17:00:29.737546+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-22T05:00:15.187761+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.306694+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:27.254542+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.055798+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "D",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"MWF 1045-1140"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
