{
	"clbid": 99494,
	"credits": 1.0,
	"crsid": 839,
	"depts": [
		"MUSIC"
	],
	"desc": "This studio course focuses on advanced techniques of acting and singing for the musical stage with emphasis on opera. Students explore voice, movement, improvisation, and characterization at an advanced level. Participants receive coaching in musical and dramatic style through solo and small ensemble literature and prepare scenes for class performance. The course culminates with public performances of a fully staged and costumed lyric theater work. May be repeated once. A production fee will be charged to all students participating in the production. Offered annually in the fall semester. Prerequisites: two semesters of voice study or permission of instructor.",
	"instructors": [
		"James McKeel"
	],
	"level": 200,
	"locations": [
		"CHM Urness",
		"CHM Urness"
	],
	"name": "Adv Act Lyric Stage",
	"notes": "Only open to students by previous audition.",
	"num": 267,
	"pf": false,
	"prerequisites": "Prerequisites: two semesters of voice study or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-23T00:00:38.464416-05:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:50.115274-06:00",
			"desc": "This studio course focuses on advanced techniques of acting and singing for the musical stage with emphasis on opera. Students explore voice, movement, improvisation, and characterization at an advanced level. Participants receive coaching in musical and dramatic style through solo and small ensemble literature and prepare scenes for class performance. The course culminates with public performances of a fully staged and costumed lyric theater work. May be repeated once. A production fee will be charged to all students participating in the production. Offered annually in fall semester. Prerequisites: Two semesters of voice study and THEAT 131: Acting for the Lyric Stage.",
			"prerequisites": "Prerequisites: Two semesters of voice study and THEAT 131: Acting for the Lyric Stage."
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Advanced Acting For The Lyric Stage",
	"type": "Research",
	"year": 2015
}
