{
	"clbid": "0000099792",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Telling Stories About Climate Change - The most recent report from the International Panel on Climate Change (IPCC) doesn’t pull any punches. The globe continues to warm, ice continues to melt at an alarming pace, and the seas continue to rise. Climate change is already happening. Yet, according to a 2013 survey by the Pew Research Center, only 40% of Americans cited climate change as a major threat. So what gives? Why aren’t people getting the message? Are we delivering it wrong? Do we need more stories, and better storytellers? This writing seminar will examine various approaches to the subject, with a particular focus on how a compelling story might be told, especially when conveying scientific data and abstract ideas. What makes a story compelling? Memorable? Inspiring? We’ll frame our discussion and writings around a variety of nonfiction (literary and investigative journalism, media, film, and graphic novels). In class, students write responses to assigned reading or films, work in small writing groups to give and receive feedback, and work on exercises that take up a certain element covered in our writing handbook. Additional writing assignments will include a personal essay, analysis essay, a research essay, short blog entries, a manifesto and more."
	],
	"enrolled": 14,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Juliet Patterson"
	],
	"junior": "0/0",
	"level": 100,
	"max": 19,
	"name": "First-Year Writing",
	"notes": [
		"Section Topic: Telling Stories About Climate Change"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "OM 020",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "OM 020",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.031606+00:00",
			"locations": [
				"RNS 204",
				"RNS 204"
			]
		},
		{
			"_updated": "2015-05-11T17:00:18.552193+00:00",
			"section": "R"
		},
		{
			"_updated": "2015-06-09T05:00:18.344584+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-23T17:00:18.799643+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.581047+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:27.359474+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.177778+00:00",
			"enroll": "14",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:27.864001+00:00",
			"junior": null,
			"senior": null
		},
		{
			"_updated": "2020-09-18T15:03:52.004438+00:00",
			"max": 18
		}
	],
	"section": "Q",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20151,
	"type": "Research",
	"year": 2015
}
