{
	"clbid": "0000099782",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Outsiders, Misfits and Heroes - In this seminar, we’ll read texts by and about outsiders, misfits and heroes— characters who by definition have a unique or unusual perspective or story to share. What makes a hero? Or a misfit? Can they be one in the same? Our reading will focus primarily on literature (fiction, creative nonfiction, poetry), but we’ll also look at film, television and music—powerful lenses for both autobiographical and mythic material. Students will explore their own ‘heroism’ or ‘outsiderhood’ (either literally or metaphorically) through reading and a variety of writing projects and will consider how the voice of a misfit, outsider or hero often serves as a transformative agent within the culture at large. In class, students do some storytelling on their own, write responses to assigned reading or films, work in small writing groups to give and receive feedback, and work on exercises that take up a certain element covered in our writing handbook. Additional writing assignments will include a personal essay, a literary analysis, a research essay, short blog entries, a manifesto, and more."
	],
	"enrolled": 17,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Juliet Patterson"
	],
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Topic: Outsiders, Misfits, and Heroes"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "13:10",
			"location": "OM 020",
			"start": "11:45"
		},
		{
			"day": "Th",
			"end": "14:05",
			"location": "OM 020",
			"start": "12:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.015243+00:00",
			"locations": [
				"RML 420",
				"RML 420"
			]
		},
		{
			"_updated": "2015-05-11T17:00:18.449887+00:00",
			"section": "P"
		},
		{
			"_updated": "2015-06-09T05:00:18.124973+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-22T05:00:16.934627+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.562712+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:27.351571+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.171117+00:00",
			"enroll": "17",
			"max": "18"
		}
	],
	"section": "O",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"type": "Research",
	"year": 2015
}
