{
	"clbid": "0000099788",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"Language Matters - Evolutionary biologist Mark Pagel has called it “the most powerful, dangerous and subversive trait that natural selection has ever devised a piece of neural audio technology for rewiring other people’s minds.” Language—spoken, signed, and written—is one of the most important ways we influence others and construct ourselves. This seminar is ideal for students interested in the phenomenon of human language, its changes over time and space, its beauty and persuasive power, and its roles in social and cultural identities. Questions we will address include: How does gender impact our language? How has the English language changed in the last 450 years? Why are “bad words” bad? How do advertisers manipulate language? What does txtng do 2 yr language? Varied reading assignments, including journalism, memoir, and drama, show us how some authors have thought through these questions. We discuss these authors’ ideas and the “moves” they make as writers. Writing assignments draw on our readings, on personal experience and the results of your inquisitive research. We give sustained attention to writing as an ongoing process, devoting substantial time to workshops of multiple drafts."
	],
	"enrolled": 15,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Karen E. Marsalek"
	],
	"level": 100,
	"locations": [
		"RML 420",
		"RML 420"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section Topic: Language Matters"
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.024986+00:00",
			"locations": [
				"RML 520",
				"RML 520"
			]
		},
		{
			"_updated": "2015-04-24T05:00:36.288089+00:00",
			"locations": [
				"RML 421",
				"RML 421"
			]
		},
		{
			"_updated": "2015-05-11T17:00:18.519184+00:00",
			"section": "O"
		},
		{
			"_updated": "2015-06-09T05:00:18.213910+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-23T17:00:18.754450+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.572978+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:27.355881+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.174843+00:00",
			"enroll": "15",
			"max": "18"
		}
	],
	"section": "N",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"type": "Research",
	"year": 2015
}
