{
	"clbid": "0000099599",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"Love and Justice in the Bible - All too often, it is assumed that the Old Testament develops the theme of justice, while the New Testament introduces the theme of love, as if God’s character and strategy for dealing with the world abruptly change with the turn of the page. This course challenges that assumption by asking what love and justice have in common in biblical writings stretching across Old and New Testaments. Some of the questions we’ll consider include: How do different settings, such as family, clan and community, national and international relations, affect biblical perspectives on justice? How are these differing perspectives reflected in the various genres of biblical writing such as narrative, law, prophecy, wisdom, and apocalyptic? Where do we see biblical writers wrestling with problems posed by the apparent lack of justice? Is there any point at which love and justice part company? Can there be love without justice, or justice without love? Finally, how might these perspectives help us reflect on contemporary problems?"
	],
	"enrolled": 18,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Margaret Odell"
	],
	"junior": "0/0",
	"level": 100,
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Topic: Love and Justice in the Bible"
	],
	"number": 121,
	"offerings": [
		{
			"day": "Mo",
			"end": "14:55",
			"location": "OM 210",
			"start": "14:00"
		},
		{
			"day": "We",
			"end": "14:55",
			"location": "OM 210",
			"start": "14:00"
		},
		{
			"day": "Fr",
			"end": "14:55",
			"location": "OM 210",
			"start": "14:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:10.817116+00:00",
			"locations": [
				"OM 140"
			]
		},
		{
			"_updated": "2015-06-04T17:00:29.950646+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-23T17:00:17.330607+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.324444+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:27.260415+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.062165+00:00",
			"enroll": "18",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:27.758741+00:00",
			"junior": null,
			"senior": null
		}
	],
	"section": "J",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20151,
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
