{
	"clbid": 99727,
	"credits": 1.0,
	"crsid": 176,
	"depts": [
		"AMCON"
	],
	"desc": "Spanning two centuries, from the founding of the colonies to the close of the Civil War, this course begins the discussion of questions central to the entire sequence: \"What is an American?\" \"What does it mean to be free?\" Students explore the institutions, images, and stories of Euro-Americans, African Americans, and Native Americans. Topics and texts range from the Declaration of Independence and Thomas Jefferson's architecture to the Narrative of the Life of Frederick Douglass and the coming of the Civil War. Offered annually in the fall semester. Counts toward American studies major.",
	"instructors": [
		"Eric J. Fure-Slocum",
		"Judy Kutulas"
	],
	"level": 100,
	"locations": [
		"HH 319"
	],
	"name": "Declaring Independence: 1607-1865",
	"notes": "Open to American Conversations students only.",
	"num": 101,
	"pf": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-25T23:19:10.956838-05:00",
			"name": "Declaring Ind: 1607-1865"
		},
		{
			"_updated": "2015-04-21T12:00:28.897903-05:00",
			"status": "O"
		},
		{
			"_updated": "2015-10-15T12:00:39.710665-05:00",
			"instructors": [
				"Eric J. Fure-Slocum"
			]
		},
		{
			"_updated": "2015-11-23T00:01:17.906083-06:00",
			"instructors": [
				"Eric J. Fure-Slocum",
				"Judy Kutulas"
			]
		},
		{
			"_updated": "2015-11-23T06:00:55.502032-06:00",
			"instructors": [
				"Eric J. Fure-Slocum"
			]
		},
		{
			"_updated": "2016-01-30T08:55:50.455563-06:00",
			"desc": "Spanning two centuries, from the founding of the colonies to the close of the Civil War, this course begins the discussion of questions central to the entire sequence: \"What is an American?\" \"What does it mean to be free?\" Students explore the institutions, images, and stories of Euro-Americans, African Americans, and Native Americans.Topics and texts range from the Declaration of Independence and Thomas Jefferson's architecture to the Narrative of the Life of Frederick Douglass and the coming of the Civil War. Offered annually in the fall semester. Counts towards American studies major."
		}
	],
	"section": "B",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Declaring Independence, 1607-1865",
	"type": "Research",
	"year": 2015
}
