{
	"clbid": "0000099541",
	"credits": 1.0,
	"crsid": "0000018779",
	"department": "ASIAN",
	"description": [
		"How do pilgrims, travelers and migrants make sense of their journeys in Asia? Students explore maps, histories, tales, and guides that define Asia today and in years past, including several classic Asian texts; study how cultural, linguistic, economic, religious, social, and political connections and divisions create and sustain communities in Asia; and plan related projects for their Interim course. Offered annually in the fall semester. Prerequisite: CHIN 112 or JAPAN 112 or permission of instructor. Must be accepted into Asian Conversations program to register."
	],
	"enrolled": 39,
	"instructors": [
		"Hsiang-Lin Shih",
		"Kendra Strand"
	],
	"level": 200,
	"locations": [
		"HH 403",
		"HH 403"
	],
	"max": 40,
	"name": "AsianCon1:MappingJourneys",
	"notes": [
		"Registration for this course restricted to those students who have applied to",
		"the Asian Conversations program and been accepted into it. This course will",
		"also meet in HH 319."
	],
	"number": 210,
	"pn": false,
	"prerequisites": "CHIN 112 or JAPAN 112 or permission of instructor. Must be accepted into Asian Conversations program to register.",
	"revisions": [
		{
			"_updated": "2015-04-14T05:40:42.205046+00:00",
			"instructors": [
				"Hiroe Akimoto",
				"Barbara Reed"
			]
		},
		{
			"_updated": "2015-04-17T01:15:00.105299+00:00",
			"instructors": [
				"Hiroe Akimoto",
				"Hsiang-Lin Shih"
			]
		},
		{
			"_updated": "2015-04-21T17:00:27.591869+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-05-06T05:00:21.314195+00:00",
			"notes": "Registration for this course restricted to those students who have applied to the Asian Conversations program and been accepted into it."
		},
		{
			"_updated": "2016-01-30T14:55:50.206061+00:00",
			"desc": "How do pilgrims, travelers and migrants make sense of their journeys in Asia? Students explore maps, histories, tales, and guides that define Asia today and in years past, including several classic Asian texts; study how cultural, linguistic, economic, religious,social, and political connections and divisions create and sustain communities inAsia;and plan related projects for their Interim course. Offered annually in the fall semester. Prerequisite: CHIN 112 or JAPAN 112 or permission of instructor. Must be accepted into Asian Conversations program to register."
		},
		{
			"_updated": "2018-02-03T00:00:24.264384+00:00",
			"prerequisites": "Prerequisite: CHIN 112 or JAPAN 112 or permission of instructor. Must be accepted into Asian Conversations program to register."
		},
		{
			"_updated": "2018-07-12T16:51:27.212153+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.014374+00:00",
			"enroll": "39",
			"max": "40"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Asian Conversations I: Mapping Journeys",
	"type": "Research",
	"year": 2015
}
