{
	"clbid": 99349,
	"credits": 1.0,
	"crsid": 1403,
	"departments": [
		"STAT"
	],
	"description": "A first course in statistical methods for scientists, this course addresses issues for proposing/designing an experiment, as well as exploratory and inferential techniques for analyzing and modeling scientific data. Topics include probability models, exploratory graphics, descriptive techniques, statistical designs, hypothesis testing, confidence intervals, and simple/multipler egression. Offered each semester. Enrollment limited for seniors. STAT 110, STAT 212, and ECON 263 all provide an introduction to statistics and students should not take more than one; they all can serve as a prerequisite for further courses. Counts toward the mathematical biology concentration. Prerequisite: MATH 119 or MATH 120 or equivalent.",
	"gereqs": [
		"AQR"
	],
	"instructors": [
		"Julie M. Legler"
	],
	"level": 200,
	"locations": [
		"TOH 182"
	],
	"name": "Statistics for Science",
	"number": 212,
	"pn": false,
	"prerequisites": "Prerequisite: MATH 119 or MATH 120 or equivalent.",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.599683+00:00",
			"desc": "A first course in statistical methods for scientists, this course addresses issues for proposing/designing an experiment, as well as exploratory and inferential techniques for analyzing and modeling scientific data. Topics include probability models, exploratory graphics, descriptive techniques, statistical designs, hypothesis testing, confidence intervals, and simple/multiple regression. Prerequisite: MATH 119 or MATH 120 or equivalent. Offered each semester. Enrollment limited for seniors. STAT 110, STAT 212, and ECON 263 all provide an introduction to statistics and students should not take more than one; they all can serve as a prerequisite for further courses. Counts toward the mathematical biology concentration.",
			"prerequisites": "Prerequisite: MATH 119 or MATH 120 or equivalent. Offered each semester. Enrollment limited for seniors. STAT 110, STAT 212, and ECON 263 all provide an introduction to statistics and students should not take more than one; they all can serve as a prerequisite for further courses. Counts toward the mathematical biology concentration."
		}
	],
	"section": "D",
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Statistics for the Sciences",
	"type": "Research",
	"year": 2014
}
