{
	"clbid": 99678,
	"credits": 1.0,
	"crsid": 608,
	"departments": [
		"HIST"
	],
	"description": "This course studies Chinese civilization from its beginnings to the end of the 19th century, providing an overview of traditional Chinese thought, culture, institutions, and society. Students examine the development of philosophy and religion, achievements in art and literature, and social and economic change. This course also considers foreign conquest dynasties, Chinese expansion into Inner Asia, and China's relations with the West. Foreign Language Across the Curriculum course available in Chinese for students at the third-year level in the language. Offered annually.",
	"gereqs": [
		"MCG"
	],
	"instructors": [
		"Robert Entenmann",
		"James Coplin"
	],
	"level": 200,
	"locations": [
		"HH 403"
	],
	"name": "Chinese Civilization",
	"number": 250,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-25T23:19:10.916763-05:00",
			"locations": [
				"TOH 114"
			]
		},
		{
			"_updated": "2015-05-16T00:00:22.934974-05:00",
			"depts": [
				"ASIAN",
				"HIST"
			]
		},
		{
			"_updated": "2015-12-16T18:00:57.876095-06:00",
			"instructors": [
				"Robert Entenmann"
			]
		},
		{
			"_updated": "2016-01-30T08:55:50.412772-06:00",
			"desc": "This course studies Chinese civilization from its beginnings to the end of the 19th century, providing an overview of traditional Chinese thought, culture, institutions, and society. Students examine the development of philosophy and religion, achievements in art and literature, and social and economic change. This course also considers foreign conquest dynasties, Chinese expansion into Inner Asia, and China's relations with the West. Foreign Language Across the Curriculum course available in Chinese for students at the third-year level in the language. Offered most years."
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20151,
	"times": [
		"MWF 0200-0255PM"
	],
	"type": "Research",
	"year": 2015
}
