{
	"clbid": "0000099276",
	"credits": 1.0,
	"crsid": "0000025428",
	"department": "ALSO",
	"description": [
		"Students learn a language such as Arabic, Korean, or Italian in a guided, independent studyprogram offered through the World Languages Center. They meet with a native speaker conversation partner for three hours a week, in addition to ten hours of study on their ownand mandatory tutorial sessions. Syllabi and tests are developed and administered in consultation with an expert outside examiner. Students in this program are strongly encouraged to take courses in the general curriculum that provide important cultural context for the study of their language. The language(s) offered in any semester depend(s)on student interest, usually requiring 2-5 students to offer a section. Prerequisite:Completion of FOL general education requirement. For additional course info seehttp://www.stolaf.edu/services/wlc/also.html"
	],
	"enrolled": 3,
	"instructors": [
		"Renata Debska-McWilliams"
	],
	"learningmode": "S",
	"level": 200,
	"max": 10,
	"name": "Top: Intermed Arabic I",
	"notes": [
		"Prerequisite: Permission of instructor required to register."
	],
	"number": 200,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "TOH 153",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "TOH 153",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "TOH 153",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisite:Completion of FOL general education requirement. For additional course info seehttp://www.stolaf.edu/services/wlc/also.html",
	"revisions": [
		{
			"_updated": "2016-01-30T15:05:07.586436+00:00",
			"desc": "Students learn a language such as Arabic, Korean, or Italian in a guided, independent study program offered through the World Languages Center. They meet with a native speaker conversation partner for three hours a week, in addition to ten hours of study on their own and mandatory tutorial sessions. Syllabi and tests are developed and administered in consultation with an expert outside examiner. Students in this program are strongly encouraged to take courses in the general curriculum that provide important cultural context for the study of their language. The language(s) offered in any semester depend(s) on student interest, usually requiring 2-5 students to offer a section. Prerequisite: Completion of FOL requirement. For additional course info see http://www.stolaf.edu/services/wlc/also.html",
			"prerequisites": "Prerequisite: Completion of FOL requirement. For additional course info see http://www.stolaf.edu/services/wlc/also.html"
		},
		{
			"_updated": "2018-07-12T16:51:24.321036+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.083538+00:00",
			"enroll": "3",
			"max": "10"
		},
		{
			"_updated": "2020-10-15T15:23:54.524883+00:00",
			"learningmode": null
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20143,
	"title": "Alternative Language Study Option",
	"type": "Topic",
	"year": 2014
}
