{
	"clbid": "0000099601",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"From Denarii to Dollars: Biblical Economics - What does the Bible have to do with economics? Can the Bible be used to guide our economic as well as spiritual practices? Understanding that economics means “the law of the household,” this section will read the Bible in light of questions about issues such as wealth, prosperity, taxes, private property, and the market. To do so, we will look at the economic structures and concerns of a diverse biblical world rooted in an agrarian economy, tracing the recurrence of themes such as poverty, oppression, idolatry and the care for the land. Alongside of this focus on the Bible itself, we will examine how philosophers, theologians, and economists read the Bible to support certain economic practices, both in the past and within the contemporary context. Doing so will allow us to reflect on the continuing relevance of biblical economics for today."
	],
	"enrolled": 19,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Peder J. Jothen"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section Topic: From Denarii to Dollars: Biblical Economics"
	],
	"number": 121,
	"offerings": [
		{
			"day": "Tu",
			"end": "09:25",
			"location": "OM 305",
			"start": "08:00"
		},
		{
			"day": "Th",
			"end": "09:20",
			"location": "OM 305",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-06-04T17:00:29.966065+00:00",
			"notes": null
		},
		{
			"_updated": "2015-07-23T17:00:17.362227+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:50.329972+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:27.262684+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.064254+00:00",
			"enroll": "19",
			"max": "18"
		},
		{
			"_updated": "2018-11-02T04:18:27.760712+00:00",
			"junior": null,
			"senior": null
		},
		{
			"_updated": "2020-10-15T15:23:55.942489+00:00",
			"learningmode": null
		}
	],
	"section": "L",
	"semester": 1,
	"senior": "0/0",
	"status": "C",
	"term": 20151,
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
