{
	"clbid": "0000091205",
	"credits": 1.0,
	"crsid": "0000024140",
	"department": "PSYCH",
	"description": [
		"This course explores childhood and family life in modern India through site visits, observations, lectures, and readings, addressing questions such as: How does India's unique history and culture, population growth, and economic development affect parenting practices, children's self-concept, relationships, and education? How do adolescents in India understand and experience gender roles and the transition to adulthood? How do Indian psychologists and social workers integrate traditional and contemporary approaches in this religiously and linguistically diverse nation? Prerequisite: Psychology 125 or Asian Studies 121 or Family Studies 232 or 242 or permission of the instructor. Offered every 3-4 years during Interim. Counts toward women's and gender studies major and concentration."
	],
	"enrolled": 20,
	"instructors": [
		"Dana Gross"
	],
	"learningmode": "S",
	"level": 200,
	"max": 20,
	"name": "Human Development/India",
	"notes": [
		"This is an off-campus course.",
		"You will find this course listed in Studio Abroad under its course title."
	],
	"number": 223,
	"pn": false,
	"prerequisites": "Psychology 125 or Asian Studies 121 or Family Studies 232 or 242 or permission of the instructor. Offered every 3-4 years during Interim. Counts toward women's and gender studies major and concentration.",
	"revisions": [
		{
			"_updated": "2018-02-02T23:57:19.061840+00:00",
			"prerequisites": "Prerequisite: Psychology 125 or Asian Studies 121 or Family Studies 232 or 242 or permission of the instructor. Offered every 3-4 years during Interim. Counts toward women's and gender studies major and concentration."
		},
		{
			"_updated": "2018-07-12T16:51:13.676892+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:07.499980+00:00",
			"enroll": "20",
			"max": "20"
		},
		{
			"_updated": "2020-10-15T15:23:49.593816+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:13.228948+00:00",
			"gereqs": [
				"HBS",
				"MCG"
			]
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20132,
	"title": "Exploring India: Human Development in Cross-Cultural Context",
	"type": "Research",
	"year": 2013
}
