{
	"clbid": "0000068046",
	"credits": 1.0,
	"crsid": "0000000436",
	"department": "ENGL",
	"description": [
		"This course will focus on nineteenth-century American writings that, in the decades before the Civil War, concern themselves with the issues of freedom, self-determination, and self-reliance. Writing during the period we often call the \"American Renaissance,\" some of these authors embraced the idea of literary independence for American writers, spiritual liberation form the religious institutions of the past, and the opportunity for unlimited development of the self. Others were concerned with the possibilities of freedom from slavery, from marriage, or from economic oppression. But all of these writers can be seen as entering into a conversation or debate with one another about the possibilities--or lack thereof--of attaining personal freedom and reforming American life. Among the texts we will consider: Emerson's Essays, Thoreau's Walden, Stowe's Uncle Tom's Cabin, Hawthorne's The Scarlet Letter, Frederick Douglass's Narrative of the Life, Harriet Jacob's Incidents in the Life of a Slave Girl, Fuller's \"The Great Lawsuit,\" Melville's \"Bartleby the Scrivener\" and \"Benito Cereno,\" and Whitman's powtry. Prerequisite: English 185 plus one additional course of relevant background."
	],
	"enrolled": 12,
	"firstyear": "0/0",
	"instructors": [
		"Carol Holly"
	],
	"learningmode": "S",
	"level": 300,
	"max": 15,
	"name": "Adv Lit Era: Decl Indep",
	"number": 340,
	"offerings": [
		{
			"day": "Mo",
			"end": "12:40",
			"location": "RML 520",
			"start": "10:40"
		},
		{
			"day": "Tu",
			"end": "12:40",
			"location": "RML 520",
			"start": "10:40"
		},
		{
			"day": "We",
			"end": "12:40",
			"location": "RML 520",
			"start": "10:40"
		},
		{
			"day": "Th",
			"end": "12:40",
			"location": "RML 520",
			"start": "10:40"
		},
		{
			"day": "Fr",
			"end": "12:40",
			"location": "RML 520",
			"start": "10:40"
		}
	],
	"pn": false,
	"prerequisites": "English 185 plus one additional course of relevant background.",
	"revisions": [
		{
			"_updated": "2018-02-02T23:51:03.011303+00:00",
			"prerequisites": "Prerequisite: English 185 plus one additional course of relevant background."
		},
		{
			"_updated": "2018-07-12T16:50:43.880641+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:47:30.780365+00:00",
			"enroll": "12",
			"max": "15"
		},
		{
			"_updated": "2018-11-02T04:17:33.036401+00:00",
			"firstyear": null
		},
		{
			"_updated": "2020-10-15T15:23:35.027313+00:00",
			"learningmode": null
		}
	],
	"semester": 2,
	"status": "O",
	"term": 20092,
	"title": "Advanced Studies in Literary Eras: American",
	"type": "Topic",
	"year": 2009
}
