{
	"clbid": "0000100473",
	"credits": 1.0,
	"crsid": "0000000192",
	"department": "CHEM",
	"description": [
		"This study of chemical stoichiometry, equilibrium, acid-base chemistry, coordination chemistry, and atomic and molecular structure supplies the fundamental background on which all later chemistry courses depend. It includes applications of equilibrium principles to acid-base chemistry. Students attend three classes and one three-hour laboratory each week. Offered annually in the fall semester. Counts toward biomolecular science concentration. Prerequisites: high school chemistry and physics. Students planning to continue in chemistry should consider concurrent registration in MATH 119 or MATH 120. Placement via online placement exam is required. The course cannot be taken in conjunction with or after credit in CHEM 121."
	],
	"enrolled": 23,
	"groupid": "0000000192",
	"instructors": [
		"George K. Anquandah"
	],
	"junior": "1/3",
	"learningmode": "S",
	"level": 100,
	"max": 40,
	"name": "Struct Chem & Equilib",
	"notes": [
		"Students registering for Chem 125 must also register for one Chem 125 lab.",
		"This course has class year limits."
	],
	"number": 125,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "RNS 390",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "RNS 390",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "RNS 390",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: high school chemistry and physics. Students planning to continue in chemistry should consider concurrent registration in MATH 119 or MATH 120. Placement via online placement exam is required. The course cannot be taken in conjunction with or after credit in CHEM 121.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:34.039041+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2016-01-30T14:55:51.285692+00:00",
			"desc": "This study of chemical stoichiometry, equilibrium, acid-base chemistry, coordination chemistry, and atomic and molecular structure supplies the fundamental background on which all later chemistry courses depend. It includes applications of equilibrium principles to acid-base chemistry. Students attend three classes and one three-hour laboratory each week. Offered annually in the fall semester. Prerequisites: high school chemistry and physics. Students planning to continue in chemistry should consider concurrent registration in MATH 119 or MATH 120. Placement via online placement exam is required. The course cannot be taken in conjunction with or after credit in CHEM 121."
		},
		{
			"_updated": "2018-07-12T16:51:27.679076+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.555241+00:00",
			"enroll": "23",
			"max": "40"
		},
		{
			"_updated": "2018-10-19T04:12:28.859443+00:00",
			"firstyear": null,
			"junior": null,
			"sophomore": null
		},
		{
			"_updated": "2018-10-28T04:15:05.963187+00:00",
			"firstyear": "1/2",
			"junior": "2/5",
			"senior": null,
			"sophomore": "1/3"
		},
		{
			"_updated": "2020-10-15T15:23:56.211415+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:19.046693+00:00",
			"gereqs": [
				"SED"
			]
		}
	],
	"section": "A",
	"semester": 1,
	"senior": "1/2",
	"sophomore": "2/5",
	"status": "O",
	"term": 20151,
	"title": "Structural Chemistry and Equilibrium",
	"type": "Research",
	"year": 2015
}
