{
	"clbid": 100384,
	"credits": 1.0,
	"crsid": 745,
	"departments": [
		"MATH"
	],
	"description": [
		"Students encounter the theory of calculus and develop tools for communicating mathematical ideas with technical accuracy and sophistication. The goal is mastery of the concepts (e.g., limit, continuity, derivatives, and integrals) necessary to verify such important results as the Fundamental Theorem of Calculus, the Mean Value Theorem, and the Bolzano-Weierstrass Theorem. Emphasis is on theory and on developing the ability to write proofs. Offered each semester. Counts toward computer science mjaor. Prerequisite: MATH 126 or MATH 128, and MATH 220. Permission of instructor required for first-year students."
	],
	"enroll": "16",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Paul Zorn"
	],
	"level": 200,
	"locations": [
		"TOH 186",
		"TOH 186"
	],
	"max": "18",
	"name": "Real Analysis I",
	"notes": [
		"Open to first-year students with permission of department chair."
	],
	"number": 244,
	"pn": false,
	"prerequisites": "MATH 126 or MATH 128, and MATH 220. Permission of instructor required for first-year students.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.518969+00:00",
			"instructors": [
				"Kay E. Smith"
			],
			"locations": [
				"RNS 206"
			],
			"times": [
				"MWF 1045-1140"
			]
		},
		{
			"_updated": "2015-04-28T23:00:22.868624+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-09-23T04:33:17.072927+00:00",
			"notes": null
		},
		{
			"_updated": "2016-01-30T14:55:51.186600+00:00",
			"desc": "Students encounter the theory of calculus and develop tools for communicating mathematical ideas with technical accuracy and sophistication. The goal is mastery of the concepts (e.g., limit, continuity, derivatives, and integrals) necessary to verify such important results as the Fundamental Theorem of Calculus, the Mean Value Theorem, and the Bolzano-Weierstrass Theorem. Emphasis is on theory and on developing the ability to write proofs. Offered each semester. Prerequisite: MATH 126 or MATH 128, and MATH 220. Permission of instructor required for first-year students."
		},
		{
			"_updated": "2018-02-03T00:00:24.693174+00:00",
			"prerequisites": "Prerequisite: MATH 126 or MATH 128, and MATH 220. Permission of instructor required for first-year students."
		},
		{
			"_updated": "2018-07-12T16:51:27.643445+00:00",
			"enroll": null,
			"max": null
		}
	],
	"section": "A",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"type": "Research",
	"year": 2015
}
