{
	"clbid": "0000100425",
	"credits": 1.0,
	"crsid": "0000000583",
	"department": "HIST",
	"description": [
		"This course explores topics in European history, designed to emphasize active skills of critical reading, textual and contextual analysis, historiographical argument, and historical writing. Recent topics have included \"Restoration Britain\" and \"France in World War II.\" Primarily for history majors; others by permission of instructor. Offered most years."
	],
	"enroll": 7,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Kevin Mummey"
	],
	"level": 200,
	"locations": [
		"HH 514",
		"HH 514"
	],
	"max": 15,
	"name": "Sem: The Crusading Era",
	"notes": [
		"Especially for rising sophomore history majors, but others may also register."
	],
	"number": 210,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:11.547987+00:00",
			"locations": [
				"HH 515",
				"HH 515"
			]
		},
		{
			"_updated": "2015-04-11T02:30:01.554700+00:00",
			"instructors": [
				"J. L. Carrington"
			]
		},
		{
			"_updated": "2015-04-20T23:00:27.970840+00:00",
			"notes": "Especially for rising sophomore history majors, but others may also register."
		},
		{
			"_updated": "2015-05-01T17:00:24.470903+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-12-16T00:01:00.025531+00:00",
			"gereqs": null,
			"notes": "Especially for rising sophomore history majors, but others may also register. WRI proposal pending."
		},
		{
			"_updated": "2016-01-30T14:55:51.220802+00:00",
			"desc": "History 210 examines the experience of occupation, collaboration, and resistance in France during World War II, an individually and nationally painful episode for the French. During four years of hardship and uncertainty, both the Vichy regime and French resistance groups attempted to remake France by developing competing visions of the nation. Upon the Liberation of Paris, a victorious Charles de Gaulle spoke of a nation of resisters \"from the first hour.\" The historical record and contested nature of French national memory, however, make clear that the truth is more complex. In this course we'll use both primary and secondary sources to examine the perspectives of the historical actors and the interpretations of historical scholars. We'll also consider the distinctive ways in which literature and film shape an understanding of French experience during the war years. Finally, since this course is a Majors Seminar (M-sem), we'll pay particular attention to the way historians do their work.",
			"title": "Major Seminar: France in World War II"
		},
		{
			"_updated": "2018-07-12T16:51:27.659224+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.528155+00:00",
			"enroll": "7",
			"max": "15"
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20151,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"title": "Major Seminar: European History",
	"type": "Seminar",
	"year": 2015
}
