{
	"clbid": "0000100380",
	"credits": 1.0,
	"crsid": "0000001094",
	"department": "PHYS",
	"description": [
		"Students investigate Quantum Theory, in which a particle's behavior is described through a statistically-interpreted wave function rather than through the concepts of Newtonian mechanics. Topics include an examination of the conceptual framework of Quantum Mechanics, solution of the Schrodinger Equation for systems such as the harmonic oscillator and the hydrogen atom, and approximation methods for treating more complex systems and the interaction of radiation with matter. Students in this course are normally registered for PHYS 386 as well, in order to complete the requirements for the physics major. Offered annually in the fall semester. Prerequisites: PHYS 244, PHYS 374, and either MATH 226 or MATH 330 or similar course upon approval of the department chair."
	],
	"enrolled": 27,
	"instructors": [
		"David Nitz"
	],
	"level": 300,
	"max": 30,
	"name": "Quantum Mechanics",
	"number": 376,
	"offerings": [
		{
			"day": "Mo",
			"end": "08:55",
			"location": "RNS 297",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "08:55",
			"location": "RNS 297",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "08:55",
			"location": "RNS 297",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "Prerequisites: PHYS 244, PHYS 374, and either MATH 226 or MATH 330 or similar course upon approval of the department chair.",
	"revisions": [
		{
			"_updated": "2015-09-23T04:33:17.013529+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:51.177631+00:00",
			"desc": "Students investigate Quantum Theory, in which a particle's behavior is described through a statistically-interpreted wave function rather than through the concepts of Newtonian mechanics. Topics include an examination of the conceptual framework of Quantum Mechanics, solution of the Schrodinger Equation for systems such as the harmonic oscillator and the hydrogen atom, and approximation methods for treating more complex systems and the interaction of radiation with matter. Offered annually in the fall semester. Prerequisites: PHYS 244 and PHYS 374, MATH 226, and concurrent registration in PHYS 386.",
			"prerequisites": "Prerequisites: PHYS 244 and PHYS 374, MATH 226, and concurrent registration in PHYS 386."
		},
		{
			"_updated": "2018-07-12T16:51:27.640174+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:21.504123+00:00",
			"enroll": "27",
			"max": "30"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20151,
	"type": "Research",
	"year": 2015
}
