{
	"clbid": 100461,
	"credits": 1.0,
	"crsid": 1405,
	"departments": [
		"STAT"
	],
	"description": [
		"This course takes a case-study approach to the fitting and assessment of statistical models with application to real data. Specific topics include multiple regression, model diagnostics, and logistic regression. The approach focuses on problem-solving tools, interpretation, mathematical models underlying analysis methods, and written statistical reports. Offered each semester. Counts toward environmental studies major (natural science and social science emphases) and management studies, mathematical biology, and neuroscience concentrations. Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor."
	],
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Jessica Bestrashniy"
	],
	"level": 200,
	"locations": [
		"TOH 182",
		"TOH 182"
	],
	"name": "Statistical Modeling",
	"notes": [
		"Open to first-year students by permission only."
	],
	"number": 272,
	"pn": false,
	"prerequisites": "STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-05-05T23:00:18.945712+00:00",
			"status": "O"
		},
		{
			"_updated": "2015-08-28T05:00:36.313230+00:00",
			"instructors": [
				"Jessica Musselman"
			]
		},
		{
			"_updated": "2016-01-30T14:55:51.275989+00:00",
			"desc": "This course takes a case-study approach to the fitting and assessment of statistical models with application to real data. Specific topics include multiple regression, model diagnostics, and logistic regression. The approach focuses on problem-solving tools, interpretation, mathematical models underlying analysis methods, and written statistical reports. Offered each semester. Counts toward mathematical biology concentration. Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor."
		},
		{
			"_updated": "2017-05-30T15:52:17.588865+00:00",
			"instructors": [
				"Bestrashniy Jessica"
			]
		},
		{
			"_updated": "2018-02-03T00:00:24.733672+00:00",
			"prerequisites": "Prerequisite: STAT 110, STAT 212, or STAT 214, or ECON 263, or equivalent preparation, or permission of instructor."
		}
	],
	"section": "A",
	"semester": 1,
	"status": "C",
	"term": 20151,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"type": "Research",
	"year": 2015
}
