{
	"clbid": 100835,
	"credits": 1.0,
	"crsid": 1357,
	"departments": [
		"SWRK"
	],
	"description": "Students explore service to human beings as a profession, both vocation and avocation. Who needs help? Who helps? Where? How? What motivates people to help? Using the liberal arts as a foundation for helping people, students study career opportunities in areas such as health care, social services, ministry, youth work, and thearts. The class includes lectures, discussions, speakers, and field visits; additional fee. Open only to first-year students. Offered during Interim.",
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Lisa L. Moore"
	],
	"level": 100,
	"locations": [
		"OM 020",
		"OM 020"
	],
	"name": "I Want to Help People",
	"notes": "Open only to first-year students. This course includes an academic civic engagement (ACE) component.",
	"number": 120,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.652233+00:00",
			"locations": [
				"OM 240",
				"OM 240"
			]
		},
		{
			"_updated": "2015-08-12T05:00:17.832549+00:00",
			"locations": [
				"OM 020",
				"OM 240"
			]
		},
		{
			"_updated": "2015-11-04T04:49:48.745406+00:00",
			"notes": "Open only to first-year students."
		},
		{
			"_updated": "2015-11-10T00:00:38.464932+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.198544+00:00",
			"desc": "Students explore service to human beings as a profession, a vocation, and a volunteer commitment. Who needs help? Who helps? Where? How? What motivates people to help? Using the liberal arts as a foundation for helping people, students study career opportunities in areas such as health care, social services, ministry, youth work, and thearts. The class includes lectures, discussions, speakers, and field visits; additional fee.Open only to first-year students. Offered during Interim."
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"T-F 1040-1240PM",
		"T-F 0100-0300PM"
	],
	"type": "Research",
	"year": 2015
}
