{
	"clbid": 101017,
	"credits": 1.0,
	"crsid": 1086,
	"departments": [
		"PHYS"
	],
	"description": [
		"This course offers an introduction to the physics of sound waves, the biological, physical and psychological origins of sound perception, and the synthesis of sounds and sound production in different instruments. Students explore these topics, as well as sound recording and reproduction systems, through lectures, discussions, laboratory experiments, and student presentations. Offered during Interim. Counts toward media studies concentration. Prerequisite: proficiency in algebra and geometry. Musical experience is helpful but not required."
	],
	"enroll": 30,
	"gereqs": [
		"IST",
		"SED"
	],
	"groupid": 1086,
	"instructors": [
		"Prabal Adhikari"
	],
	"level": 200,
	"locations": [
		"RNS 210"
	],
	"max": 28,
	"name": "Musical Acoustics",
	"notes": [
		"Students in Physics 252 must also register for lab Physics 252 L.",
		"Not open to first-year students during web registration."
	],
	"number": 252,
	"pn": false,
	"prerequisites": "proficiency in algebra and geometry. Musical experience is helpful but not required.",
	"revisions": [
		{
			"_updated": "2015-04-20T23:00:15.454702+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-11-10T00:00:39.518301+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.384025+00:00",
			"desc": "This course offers an introduction to the physics of sound waves, the biological, physical and psychological origins of sound perception, and the synthesis of sounds and sound production in different instruments. Students explore these topics, as well as sound recording and reproduction systems, through lectures, discussions, laboratory experiments, and student presentations. Offered during Interim. Prerequisite: proficiency in algebra and geometry. Musical experience is helpful but not required."
		},
		{
			"_updated": "2018-02-03T00:00:25.800598+00:00",
			"prerequisites": "Prerequisite: proficiency in algebra and geometry. Musical experience is helpful but not required."
		},
		{
			"_updated": "2018-07-12T16:51:29.948565+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.004177+00:00",
			"enroll": "30",
			"max": "28"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-F 1040-1210PM"
	],
	"type": "Research",
	"year": 2015
}
