{
	"clbid": 101517,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"STORYTELLING WITH DATA. This is the age of Big Data, and data is informing decisions in fields from medicine to finance to politics to education. To be an informed citizen, as H.G. Wells forecasted, statistical literacy has become as important as the ability to read and write. In this seminar, we will focus on reading and writing about statistics for a wide audience. Through readings in books such as Freakonomics by Steven Levitt and Stephen Dubner, The Signal and the Noise by Nate Silver, and Outliers by Malcolm Gladwell, we will explore questions such as: Why do drug dealers still live with their moms? Why are earthquakes so dangerous to predict? Why are so many Canadian Olympic hockey players born in January? At its core, the effective communication of data stems from the art of storytelling and the ability to ask creative, insightful questions. We will study how popular authors tell stories with data – using detective narratives, underdog triumphs, and contrasts with anecdotal evidence – and we will engage in the writing process to tell stories involving data that provide insights into the world around us."
	],
	"enroll": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Paul J. Roback"
	],
	"level": 100,
	"locations": [
		"RNS 124"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section title: Storytelling with Data."
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.803174+00:00",
			"locations": [
				"DC 204"
			]
		},
		{
			"_updated": "2015-10-16T17:00:38.578743+00:00",
			"section": "G"
		},
		{
			"_updated": "2015-10-16T23:01:00.023272+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-12T00:01:21.912009+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.988761+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:31.836559+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.778853+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "F",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"type": "Research",
	"year": 2015
}
