{
	"clbid": 101887,
	"credits": 1.0,
	"crsid": 533,
	"departments": [
		"GCON"
	],
	"description": [
		"This course pursues the expansion of Christianity throughout the Roman world and the synthesis of Judeo-Christian and Greco-Roman thought in the early Middle Ages. Students consider the development of a unified world view as expressed in religious devotions, philosophy, literature, and art and in monasticism and feudalism in Church and Empire. Students discuss works by Augustine, Benedict, Hildegard of Bingen, Aquinas, Dante, Chaucer, and Christine de Pisan, medieval drama, and the artistry of Chartres Cathedral. Offered annually in the spring semester. Counts toward medieval studies major. Prerequisites: GCON 113 and GCON 115."
	],
	"enroll": 17,
	"gereqs": [
		"FYW",
		"HWC"
	],
	"instructors": [
		"Anne Groton"
	],
	"level": 100,
	"locations": [
		"RML 520"
	],
	"max": 22,
	"name": "Medieval Synthesis",
	"notes": [
		"Open to Great Conversations students only."
	],
	"number": 116,
	"pn": false,
	"prerequisites": "Prerequisites: GCON 113 and GCON 115.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:14.022912+00:00",
			"instructors": [
				"Mary E. Trull"
			]
		},
		{
			"_updated": "2015-11-06T00:02:26.132194+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.260216+00:00",
			"desc": "This course pursues the expansion of Christianity throughout the Roman world and the synthesis of Judeo-Christian and Greco-Roman thought in the early Middle Ages. Students consider the development of a unified world view as expressed in religious devotions, philosophy, literature, and art and in monasticism and feudalism in Church and Empire. Students discuss works by Augustine, Benedict, Hildegard of Bingen, Aquinas, Dante, Chaucer, and Christine de Pisan, medieval drama, and the artistry of Chartres Cathedral. Offered annually in the spring semester. Counts towards medieval studies major. Prerequisites: GCON 113 and GCON 115."
		},
		{
			"_updated": "2018-07-12T16:51:32.009148+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.998000+00:00",
			"enroll": "17",
			"max": "22"
		}
	],
	"section": "E",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "The Tradition Redefined: The Medieval Synthesis",
	"type": "Research",
	"year": 2015
}
