{
	"clbid": "0000101950",
	"credits": 1.0,
	"crsid": "0000025458",
	"department": "ENGL",
	"description": [
		"Two themes persist in early British literature: the role of fate (Old English wyrd) versus free will and the power of wonders--from the miraculous to the magical. These themes are traced in the Old English period in sermons, charms and riddles, biblical epics and Christian texts, and the heroic epic Beowulf. Readings from the Middle English period include lyric and ballad, romance from the Arthurian and non-Arthurian traditions, drama, allegory, mystical treatises, and Chaucer's Canterbury Tales. Offered periodically. Counts toward medieval studies major. Prerequisite: FYW."
	],
	"enrolled": 17,
	"gereqs": [
		"ALS-L",
		"WRI"
	],
	"instructors": [
		"Karen Cherewatuk"
	],
	"level": 200,
	"locations": [
		"RML 420"
	],
	"max": 18,
	"name": "Old & Middle English Lit",
	"number": 223,
	"pn": false,
	"prerequisites": "FYW.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.269562+00:00",
			"locations": [
				"RML 520"
			]
		},
		{
			"_updated": "2015-11-12T00:01:24.703030+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.309121+00:00",
			"desc": "Two themes persist in early British literature: the role of fate (Old English wyrd) versus free will and the power of wonders--from the miraculous to the magical. These themes are traced in the Old English period in sermons, charms and riddles, biblical epics and Christian texts, and the heroic epic Beowulf. Readings from the Middle English period include lyric and ballad, romance from the Arthurian and non-Arthurian traditions, drama, allegory, mystical treatises, and Chaucer's Canterbury Tales. Offered periodically. Prerequisite: FYW."
		},
		{
			"_updated": "2018-02-03T00:01:09.887419+00:00",
			"prerequisites": "Prerequisite: FYW."
		},
		{
			"_updated": "2018-07-12T16:51:32.034078+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.030017+00:00",
			"enroll": "17",
			"max": "18"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1045-1140"
	],
	"title": "Old and Middle English Literature: The Weird and the Wonderful",
	"type": "Research",
	"year": 2015
}
