{
	"clbid": "0000101320",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"SUFFERING AND REDEMPTION: AMERICAN FILMS, AMERICAN VALUES. How does evil fit into a good world? Is the world even good? Why do the innocent suffer? How is it possible that humans can be vicious? What would it take to redeem the world from its darkness? This section of Religion 121 will address these and related questions in conversations with biblical traditions and a series of thoughtful American films. We will read the biblical core of 121 in relation to selected American film classics. These films, rich expressions of enduring American values, are important for a liberal arts education. This section requires that students be free to view films on most Wednesday evenings during the semester in anticipation of Thursday discussions."
	],
	"enroll": 18,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Charles Wilson"
	],
	"level": 100,
	"locations": [
		"OM 310"
	],
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section title: Suffering and Redemption: American Films, American Values."
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.558756+00:00",
			"locations": [
				"OM 340"
			]
		},
		{
			"_updated": "2015-10-02T17:01:13.014285+00:00",
			"locations": [
				"OM 240"
			]
		},
		{
			"_updated": "2015-10-12T23:00:18.945958+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-12T00:01:20.481981+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.732509+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:31.734510+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.642594+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "I",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
