{
	"clbid": 101369,
	"credits": 1.0,
	"crsid": 26714,
	"depts": [
		"BIO"
	],
	"desc": "This course provides a comprehensive overview of cellular structure and function including cellular compartments, macromolecular structures, and life processes such as energy and material flux, cell division, and control mechanisms. Students learn current and/or historical evidence and methodology (e.g., microscopy, isolation procedures, and probes). Laboratory experiences provide opportunities for qualitative and quantitative observations of cellular structure and function. Students place their work in the context of current research through examination of relevant literature and formal presentations. Offered each semester. Counts toward \"cell biology\" core category. Counts toward biomolecular science and neuroscience concentrations. Prerequisites: CHEM125 or CHEM 121/CHEM 123 or CH/BI 125; BIO 150 is strongly preferred.",
	"groupid": 26714,
	"instructors": [
		"Nicole Son"
	],
	"level": 200,
	"locations": [
		"RNS 150"
	],
	"name": "Cell Biology",
	"notes": "Students in Bio 227A must also register for one lab Bio 227 AL, BL, or CL.",
	"num": 227,
	"pf": false,
	"prerequisites": "Prerequisites: CHEM125 or CHEM 121/CHEM 123 or CH/BI 125; BIO 150 is strongly preferred.",
	"revisions": [
		{
			"_updated": "2015-06-04T12:00:29.463057-05:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-11-21T00:01:11.405286-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:43.800530-06:00",
			"desc": "This course provides a comprehensive overview of cellular structure and function including cellular compartments, macromolecular structures, and life processes such as energy and material flux, cell division, and control mechanisms. Students learn current and/or historical evidence and methodology (e.g., microscopy, isolation procedures, and probes). Laboratory experiences provide opportunities for qualitative and quantitative observations of cellular structure and function. Students place their work in the context of current research through examination of relevant literature and formal presentations. Offered each semester. Counts toward biomolecular science concentration. Prerequisites: CHEM125 or CHEM 121/CHEM 123 or CH/BI 125; BIO 150 is strongly preferred."
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2015
}
