{
	"clbid": "0000101516",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"PAGE, STAGE, AND SCREEN: TELLING STORIES. This seminar will explore three media (literature, theater, and film) and two genres (comedy and tragedy), by way of thinking about the structures and strategies of fictional narratives. What human themes/experiences/ideas in these stories are \"universal\"? What is distinctive about the ways they can be communicated by each of the three media? In each medium, we’ll explore texts both classic (Jane Austen’s Pride and Prejudice) and contemporary (a film by Spike Lee; contemporary fiction by a Northfield-based writer with a national reputation). Our class will attend two staged theater productions (professional theater in Minneapolis/St. Paul and a St. Olaf production). We’ll read novels both comic and tragic and watch films ranging from a 1930s screwball comedy to a contemporary urban tragedy. Writing assignments, formal and informal, will be frequent and varied, and will include visual analyses both of theatrical staging and film techniques, critical literary analysis, a research paper on film history, and a \"creative\" opportunity to try your hand at screenwriting."
	],
	"enroll": 18,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Diana Postlethwaite"
	],
	"level": 100,
	"locations": [
		"RML 420",
		"RML 420"
	],
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section title: Page, Stage, and Screen: Telling Stories."
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-09T18:41:49.863123+00:00",
			"locations": [
				"RML 515",
				"RML 515"
			]
		},
		{
			"_updated": "2015-10-16T23:01:00.017432+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-12T00:01:21.900910+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.986726+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:31.835704+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.777719+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"section": "L",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 1145-0110PM",
		"Th 1245-0205PM"
	],
	"type": "Research",
	"year": 2015
}
