{
	"clbid": 101606,
	"credits": 1.0,
	"crsid": 28968,
	"departments": [
		"ID"
	],
	"description": "This course explores the intersection of science, scientific knowledge, and contemporary social problems. Through sustained inquiry into a specific issue or topic, it shows students the strengths and potential overlap of different research methods and perspectives from the social and natural sciences. Depending on the topic, students may also investigate the impact of the legal and political context on such work, and the complexities of representing research to the larger public. Offered periodically. May be repeated if topic is different. Prerequisite: junior or senior standing; a limited number of sophomores will be allowed to enroll",
	"gereqs": [
		"HBS",
		"IST",
		"SED"
	],
	"groupid": 28968,
	"instructors": [
		"Thomas A. Williamson",
		"Shelly D. Dickinson"
	],
	"level": 200,
	"locations": [
		"OM 340",
		"OM 340"
	],
	"name": "Integrated Science and Society",
	"notes": "Students in this course must also register for ID 245 lab. Not open to first-year students. This course is intended for students who do not major in one of the natural sciences.",
	"number": 245,
	"pn": false,
	"prerequisites": "Prerequisite: junior or senior standing; a limited number of sophomores will be allowed to enroll",
	"revisions": [
		{
			"_updated": "2015-03-10T22:02:49.345839+00:00",
			"name": "Integrated Science/Societ"
		},
		{
			"_updated": "2015-05-01T05:00:31.107077+00:00",
			"locations": [
				"OM 340"
			],
			"times": [
				"MWF 1045-1140"
			]
		},
		{
			"_updated": "2015-10-01T05:02:56.107542+00:00",
			"notes": "Full course title: Integrated Science and Society: Addiction from the Brain to the Social. Not open to first-year students. This course is intended for for students who do not major in one of the natural sciences."
		},
		{
			"_updated": "2015-11-12T00:01:22.450925+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.046988+00:00",
			"desc": "This course explores the intersection of science, scientific knowledge, and contemporary social problems. Through sustained inquiry into a specific issue or topic, it shows students the strengths and potential overlap of different research methods and perspectives from the social and natural sciences. Depending on the topic, students may also investigate the impact of the legal and political context on such work, and the complexities of representing research to the larger public. Prerequisite: junior or senior standing; a limited number of sophomores will be allowed to enroll. Offered periodically. May be repeated if topic is different. In 2014-15 counts as an elective toward psychology and sociology/anthropology majors.",
			"prerequisites": "Prerequisite: junior or senior standing; a limited number of sophomores will be allowed to enroll. Offered periodically. May be repeated if topic is different. In 2014-15 counts as an elective toward psychology and sociology/anthropology majors."
		},
		{
			"_updated": "2016-02-12T06:02:04.122199+00:00",
			"locations": [
				"OM 240",
				"OM 240"
			]
		},
		{
			"_updated": "2016-02-19T00:00:32.789608+00:00",
			"locations": [
				"OM 140",
				"OM 140"
			]
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Integrated Science/Society:Interdisciplinary Approach Contemporary Iss",
	"type": "Research",
	"year": 2015
}
