{
	"clbid": 101096,
	"credits": 1.0,
	"crsid": 18778,
	"departments": [
		"ENVST"
	],
	"description": [
		"In this course students develop critical viewing and practical video-making skills as they explore the aesthetic, rhetorical, and expressive potential of documentary films to positively impact our environment. We study a variety of documentaries and their ties to the main genres within nonfiction (including Direct Cinema, Cinema Verite, and the Essay Film) and examine how these works construct meaning and influence society. Concurrently, the course introduces students to the basics of video production, building the technical and conceptual skills that budding practitioners need to translate ideas into video format. Focusing specifically on the critical analysis of works that address environmental sustainability and human consumption, the course is comprised of readings, film screenings, discussions, technical demos, and the production of a collaborative short documentary where students convey their own observations, hopes, and concerns on the subject."
	],
	"enroll": 15,
	"instructors": [
		"Cecilia Cornejo"
	],
	"level": 200,
	"locations": [
		"RML 515"
	],
	"max": 15,
	"name": "Top: Environmental Film Doc",
	"notes": [
		"Film screenings will be Monday evening 7-9:30 pm. Intended primarily for",
		"Environmental Studies majors and concentrators, although others may register.",
		"Open to all students; class-year limits apply. This course has an ACE component."
	],
	"number": 281,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.840799+00:00",
			"instructors": [
				"Staff"
			],
			"locations": [
				"TOH 212"
			]
		},
		{
			"_updated": "2015-08-17T23:00:16.648111+00:00",
			"times": [
				"M-F 0100-0300PM"
			]
		},
		{
			"_updated": "2015-08-26T17:00:15.913941+00:00",
			"locations": [
				"TB 227"
			],
			"notes": null,
			"times": [
				"M-F 1040-1240PM"
			]
		},
		{
			"_updated": "2015-11-06T00:01:54.041594+00:00",
			"notes": "Film screenings will be Monday evening 7-9:30 pm."
		},
		{
			"_updated": "2015-11-10T00:00:39.863065+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.468725+00:00",
			"desc": "Students study topics related to the environment. Topics vary from year to year at the discretion of the instructor. Topics may include Environment and Theology, Environmental Justice, Ecotourism, and Literature of the Poles. Class is largely discussion-based but may include a lab/fieldwork component depending on the topic. May be repeated if topics are different. Offered annually."
		},
		{
			"_updated": "2016-03-16T23:00:39.443952+00:00",
			"notes": "Film screenings will be Monday evening 7-9:30 pm. Intended primarily for Environmental Studies majors and concentrators, although others may register. Open to all students; class-year limits apply."
		},
		{
			"_updated": "2018-07-12T16:51:30.047519+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.036359+00:00",
			"enroll": "15",
			"max": "15"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-F 0800-1000"
	],
	"title": "Topics in Environmental Studies",
	"type": "Topic",
	"year": 2015
}
