{
	"clbid": 101656,
	"credits": 1.0,
	"crsid": 122,
	"departments": [
		"BIO"
	],
	"description": [
		"Genetics examines relationships between genotype and phenotype in prokaryotic and eukaryotic organisms from classical and molecular perspectives. Lectures in this core course cover ideas and technologies contributing to understanding mechanisms of gene transmission and regulation. Laboratories utilize model organisms to investigate classical and molecular modes of inheritance. Students attend lectures plus one three-hour laboratory per week. Offered each semester. Counts as \"genetics\" core category. Counts toward mathematical biology, neuroscience, and biomolecular studies concentrations. Prerequisites: BIO 150, and CHEM 125 or CHEM 121/CHEM 123 or CH/BI 125; or BIO 125 and CHEM 125 or CHEM 121/CHEM 123 or CH/BI 125."
	],
	"groupid": 122,
	"instructors": [
		"Sara E. Fruehling"
	],
	"level": 200,
	"locations": [
		"RNS 310"
	],
	"name": "Intermediate Genetics",
	"notes": "Students in Bio 233 must also register for one lab Bio 233 AL, BL or CL. This course has class-year limits.",
	"number": 233,
	"pn": false,
	"prerequisites": "Prerequisites: BIO 150, and CHEM 125 or CHEM 121/CHEM 123 or CH/BI 125; or BIO 125 and CHEM 125 or CHEM 121/CHEM 123 or CH/BI 125.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:13.857629+00:00",
			"instructors": [
				"Kimberly A. Kandl"
			]
		},
		{
			"_updated": "2015-05-01T05:00:32.635387+00:00",
			"times": [
				"MWF 1045-1140"
			]
		},
		{
			"_updated": "2015-07-16T23:00:19.824574+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-10-19T23:03:34.638862+00:00",
			"locations": [
				"RNS 310"
			]
		},
		{
			"_updated": "2015-10-23T23:01:24.570697+00:00",
			"locations": [
				"RNS 290"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.107543+00:00",
			"desc": "Genetics examines relationships between genotype and phenotype in prokaryotic and eukaryotic organisms from classical and molecular perspectives. Lectures in this core course cover ideas and technologies contributing to understanding mechanisms of gene transmission and regulation. Laboratories utilize model organisms to investigate classical and molecular modes of inheritance .Students attend lectures plus one three-hour laboratory per week. Offered each semester. Counts as \"genetics\" core category. Counts toward neuroscience concentration. Prerequisites: BIO 150, and CHEM 125 or CHEM 121/CHEM 123 or CH/BI 125; or BIO 125 and CHEM 125 or CHEM 121/CHEM 123 or CH/BI 125."
		},
		{
			"_updated": "2016-02-16T00:00:26.090301+00:00",
			"status": "O"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1150-1245PM"
	],
	"type": "Research",
	"year": 2015
}
