{
	"clbid": 101445,
	"credits": 1.0,
	"crsid": 177,
	"departments": [
		"AMCON"
	],
	"description": [
		"In this century of institutional development, national expansion, and sectional conflict, Americans continued to define a national identity. Students probe the ways in which region, religion, race, ethnicity, and gender inform individual and group contributions to the conversation. They also analyze how geographical expansion and ideas of progress influenced different visions and versions of America. Topics and texts range from Transcendentalist writers, the Second Great Awakening, and Black Elk Speaks to landscape painting and Western photography. Offered annually in the spring semester. Counts toward American studies major. Prerequisite: AMCON 101."
	],
	"gereqs": [
		"FYW",
		"HWC"
	],
	"instructors": [
		"Judy Kutulas",
		"Matthew Rohn"
	],
	"level": 100,
	"locations": [
		"TOH 214"
	],
	"name": "Democratic Vistas: 1800-1900",
	"notes": [
		"Open to American Conversations students only."
	],
	"number": 102,
	"pn": false,
	"prerequisites": "AMCON 101.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:13.667447+00:00",
			"name": "Dem Vistas: 1800-1900"
		},
		{
			"_updated": "2015-04-07T21:54:38.699880+00:00",
			"locations": [
				"HH 403"
			]
		},
		{
			"_updated": "2015-09-25T05:00:55.737334+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:51:19.261592+00:00",
			"instructors": [
				"Matthew Rohn"
			]
		},
		{
			"_updated": "2016-01-30T14:55:43.881820+00:00",
			"desc": "In this century of institutional development, national expansion, and sectional conflict, Americans continued to define a national identity. Students probe the ways in which region, religion, race, ethnicity, and gender inform individual and group contributions to the conversation. They also analyze how geographical expansion and ideas of progress influenced different visions and versions of America. Topics and texts range from Transcendentalist writers, the Second Great Awakening, and Black Elk Speaks to landscape painting and Western photography. Prerequisite: AMCON 101. Offered annually in the spring semester. Counts towards American studies major.",
			"prerequisites": "Prerequisite: AMCON 101. Offered annually in the spring semester. Counts towards American studies major."
		},
		{
			"_updated": "2016-05-08T23:00:39.684742+00:00",
			"instructors": [
				"Judy Kutulas",
				"Matthew Rohn"
			]
		},
		{
			"_updated": "2016-05-09T05:01:03.381259+00:00",
			"instructors": [
				"Matthew Rohn"
			]
		},
		{
			"_updated": "2018-02-03T00:01:09.644660+00:00",
			"prerequisites": "Prerequisite: AMCON 101."
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Democratic Vistas, 1800-1900",
	"type": "Research",
	"year": 2015
}
