{
	"clbid": 101345,
	"credits": 1.0,
	"crsid": 1165,
	"departments": [
		"PSYCH"
	],
	"description": [
		"How do biological factors influence fundamental aspects of psychology and behavior? In this course, students learn about relationships between the brain and behavior and use neuroanatomical, physiological, and biochemical levels of analysis to understand basic behavioral processes and systems, including sensation, movement, emotion, sleep and arousal, hunger, motivation, learning, and psychopathology. Offered each semester. Counts toward biology major and neuroscience concentration and biomedical studies concentration (for students through class of 2016). Prerequisite: PSYCH 125 or BIO 123, BIO 227 or CH/BI 227."
	],
	"enroll": 30,
	"gereqs": [
		"IST"
	],
	"instructors": [
		"Dorea Ruggles"
	],
	"level": 200,
	"locations": [
		"RNS 290",
		"RNS 290"
	],
	"max": 28,
	"name": "Biopsychology",
	"number": 238,
	"pn": false,
	"prerequisites": "PSYCH 125 or BIO 123, BIO 227 or CH/BI 227.",
	"revisions": [
		{
			"_updated": "2015-08-21T17:00:28.818460+00:00",
			"instructors": [
				"Jeremy Loebach"
			]
		},
		{
			"_updated": "2015-10-27T23:00:58.036052+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-11-12T00:01:20.801225+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.786482+00:00",
			"desc": "How do biological factors influence fundamental aspects of psychology and behavior? In this course, students learn about relationships between the brain and behavior and use neuroanatomical, physiological, and biochemical levels of analysis to understand basic behavioral processes and systems, including sensation, movement, emotion, sleep and arousal, hunger, motivation, learning, and psychopathology. Offered each semester. Counts toward neuroscience concentration. Prerequisite: PSYCH 125 or BIO 123, BIO 125, or BIO 227 or CH/BI 227.",
			"prerequisites": "Prerequisite: PSYCH 125 or BIO 123, BIO 125, or BIO 227 or CH/BI 227."
		},
		{
			"_updated": "2018-02-03T00:01:09.602157+00:00",
			"prerequisites": "Prerequisite: PSYCH 125 or BIO 123, BIO 227 or CH/BI 227."
		},
		{
			"_updated": "2018-07-12T16:51:31.752904+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.667908+00:00",
			"enroll": "30",
			"max": "28"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"type": "Research",
	"year": 2015
}
