{
	"clbid": "0000101605",
	"credits": 1.0,
	"crsid": "0000018802",
	"department": "CH/BI",
	"description": [
		"This course builds on the principles learned in Chemistry/Biology 125/126 and explores how chemistry informs major principles of cellular and molecular biology. Topics include cell structure, metabolism, movement, signaling, and division. The course emphasizes problem-solving, quantitative reasoning, the scientific method, and scientific writing through lectures, discussions, readings, writing assignments, and lab work. Students attend three classe sand one three-hour laboratory each week. Counts toward \"cell biology\" core category for the Biology major. Offered annually in the spring semester. Prerequisite: CH/BI 126."
	],
	"enroll": 37,
	"gereqs": [
		"IST",
		"SED"
	],
	"groupid": "0000018802",
	"instructors": [
		"Anne Walter"
	],
	"level": 200,
	"locations": [
		"RNS 410"
	],
	"max": 46,
	"name": "Integrated Chem/Bio III",
	"notes": [
		"Students in CH/BI 227 must also register for lab CH/BI 227 AL or BL.",
		"Open only to those students who have completed CH/BI 126."
	],
	"number": 227,
	"pn": false,
	"prerequisites": "CH/BI 126.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.890774+00:00",
			"locations": [
				"RNS 390"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.043892+00:00",
			"desc": "This course builds on the principles learned in Chemistry/Biology 125/126 and explores how chemistry informs major principles of cellular and molecular biology. Topics include cell structure, metabolism, movement, signaling, and division. The course emphasizes problem-solving, quantitative reasoning, the scientific method, and scientific writing through lectures, discussions, readings, writing assignments, and lab work. Students attend three classe sand one three-hour laboratory each week. Counts toward \"cell biology\" core category. Offered annually in the spring semester. Prerequisite: CH/BI 126."
		},
		{
			"_updated": "2018-02-03T00:01:09.720638+00:00",
			"prerequisites": "Prerequisite: CH/BI 126."
		},
		{
			"_updated": "2018-07-12T16:51:31.867089+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.817600+00:00",
			"enroll": "37",
			"max": "46"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"MWF 0905-1000"
	],
	"title": "Integrated Chem/Bio III: Molecular and Cellular Biology",
	"type": "Research",
	"year": 2015
}
