{
	"clbid": 101504,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"NATURE IMAGERY AND THE ENVIRONMENT. Georgia O\u0092Keeffe once wrote: \u0093My center does not come from my mind \u0096 it feels in me like a plot of warm moist well tilled earth with the sun shining on it.\u0094 Many of her landscapes express this outlook and the belief she and so many Americans have shared that American culture comes to know itself best through nature and the environment. This is a seminar about learning to read pictures, whether you know much about art or not, and sharing our understanding of pictures by writing ever more capably as the semester progresses about nature imagery from various periods of American history. A relatively short research project will combine students\u0092 skills in reading nature imagery with insight into how groups battling over environmental and energy exploration issues have employed landscapes and pictures of animals and plants to advance their positions."
	],
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Matthew Rohn"
	],
	"level": 100,
	"locations": [
		"CAD 202"
	],
	"name": "First-Year Writing",
	"notes": [
		"Section title: Nature Imagery and the Environment."
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-10-16T23:00:59.905802+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-24T00:00:49.249107+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:51:19.323337+00:00",
			"locations": [
				"DC 204"
			]
		},
		{
			"_updated": "2016-01-30T14:55:43.958703+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2017-05-30T15:52:43.681495+00:00",
			"locations": [
				"DC 202"
			]
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0800-0855"
	],
	"type": "Research",
	"year": 2015
}
