{
	"clbid": "0000101075",
	"credits": 1.0,
	"crsid": "0000000482",
	"department": "FREN",
	"description": [
		"This course provides an on-campus immersion experience for students interested in improving their oral language proficiency. Students engage in small and large group discussion, give individual and group oral presentations, and review grammar and registers of language. They also explore the notions of communicative competence and oral proficiency in order to become more effective speakers. Taught in French. Offered during Interim. Counts toward film studies and management studies concentrations. Prerequisite: FREN 232 or FREN 235, or equivalent."
	],
	"enroll": 9,
	"gereqs": [
		"FOL-F",
		"ORC"
	],
	"instructors": [
		"Wendy Allen"
	],
	"level": 200,
	"locations": [
		"TOH 310"
	],
	"max": 18,
	"name": "Speaking of French",
	"notes": [
		"Open to all students who meet the prerequisites."
	],
	"number": 250,
	"pn": false,
	"prerequisites": "FREN 232 or FREN 235, or equivalent.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.827343+00:00",
			"locations": [
				"TOH 110"
			],
			"notes": "Open to all students who meet the prerequiistes."
		},
		{
			"_updated": "2016-01-30T14:54:41.454668+00:00",
			"desc": "This course provides an on-campus immersion experience for students interested in improving their oral language proficiency. Students engage in small and large group discussion, give individual and group oral presentations, and review grammar and registers of language. They also explore the notions of communicative competence and oral proficiency in order to become more effective speakers. Taught in French. Offered during Interim. Counts toward film studies concentration. Prerequisite: FREN 232 or FREN 235, or equivalent."
		},
		{
			"_updated": "2018-02-03T00:00:25.818968+00:00",
			"prerequisites": "Prerequisite: FREN 232 or FREN 235, or equivalent."
		},
		{
			"_updated": "2018-07-12T16:51:30.015980+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.027622+00:00",
			"enroll": "9",
			"max": "18"
		}
	],
	"semester": 2,
	"status": "O",
	"term": 20152,
	"times": [
		"M-F 1040-0330PM"
	],
	"title": "Speaking",
	"type": "Research",
	"year": 2015
}
