{
	"clbid": "0000101601",
	"credits": 1.0,
	"crsid": "0000001294",
	"department": "SOAN",
	"description": [
		"How do anthropologists study other cultures? Peoples around the world create different realities through the ways they conceptualize experience (cultures) and how they organize themselves to do what they need to do (societies). Anthropologists describe and compare cultures and societies, focusing on different aspects such as family and kinship, inequality and power, religion and values, economy and technology, cultural and social change. This course is open to first-year students or students in certain accredited programs. Offered each semester. Counts toward race and ethnic studies and women's and gender studies majors; and women's and gender studies concentrations."
	],
	"enrolled": 19,
	"gereqs": [
		"HBS",
		"MCG"
	],
	"instructors": [
		"Susi K. Keefe"
	],
	"level": 100,
	"max": 19,
	"name": "Intro to Cultural Anthropology",
	"notes": [
		"Open to first-year students only."
	],
	"number": 128,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "CAD 202",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "CAD 202",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "CAD 202",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:13.795898+00:00",
			"name": "Int/Cult Anthropology"
		},
		{
			"_updated": "2015-11-12T00:01:22.368985+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:51:19.394126+00:00",
			"locations": [
				"DC 204"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.038987+00:00",
			"desc": "How do anthropologists study other cultures? Peoples around the world create different realities through the ways they conceptualize experience (cultures) and how they organize themselves to do what they need to do (societies). Anthropologists describe and compare cultures and societies, focusing on different aspects such as family and kinship, inequality and power, religion and values, economy and technology, cultural and social change. This course is open to first-year students or students in certain accredited programs. Offered each semester. Counts toward race and ethnic studies and women's and gender studies majors; and Africa and the Americas, race and ethnic studies, and women's and gender studies concentrations."
		},
		{
			"_updated": "2017-05-30T15:52:43.707952+00:00",
			"locations": [
				"DC 202"
			]
		},
		{
			"_updated": "2018-07-12T16:51:31.863995+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.813699+00:00",
			"enroll": "19",
			"max": "19"
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"title": "Introduction to Cultural Anthropology",
	"type": "Research",
	"year": 2015
}
