{
	"clbid": 101505,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": "CRITICAL LITERACY. This seminar has a special emphasis on reading, writing, and thinking through the lens of critical literacy: how we acquire language, how we use language, how language uses us. It will not be a strict nuts and bolts approach to the writing and language practices that will be expected of you at St. Olaf, though rest assured, these practices will be discussed. More importantly, we will learn to gain agency both in and out of higher education by purposely shaping our language for particular rhetorical situations. Choosing our words carefully is both an act of rebellion and leadership, and by doing so we will together become better readers, writers, and stewards of the English language.",
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Sally Franson"
	],
	"level": 100,
	"locations": [
		"OM 340",
		"OM 340"
	],
	"name": "First-Year Writing",
	"notes": "Section title: Critical Literacy.",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.777245+00:00",
			"locations": [
				"RML 420",
				"RML 420"
			]
		},
		{
			"_updated": "2015-04-16T18:38:47.746231+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2015-06-09T23:00:23.529928+00:00",
			"locations": [
				"TB 227",
				"TB 227"
			]
		},
		{
			"_updated": "2015-10-16T23:00:59.912301+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-20T00:01:12.817063+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.960886+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "N",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"type": "Research",
	"year": 2015
}
