{
	"clbid": "0000101589",
	"credits": 1.0,
	"crsid": "0000000935",
	"department": "NORW",
	"description": [
		"Students analyze the plays of Henrik Ibsen in English translation using a variety of critical approaches. Students investigate ethical issues and themes in Ibsen's plays by examining the plays through the lens of ethics, using readings in ethical theory to better understand both the ethical issues and the plays themselves. Students also study Ibsen's dramatic technique and the historical and literary context of his work. Taught in English. Offered annually. Counts toward women's and gender studies major and concentration. Prerequisite: BTS-T or permission of instructor."
	],
	"enrolled": 9,
	"gereqs": [
		"EIN"
	],
	"instructors": [
		"Solveig Zempel"
	],
	"level": 200,
	"locations": [
		"TOH 212",
		"TOH 212"
	],
	"max": 19,
	"name": "Ibsen",
	"notes": [
		"Prerequisite: Completion of BTS-T or permission of instructor.",
		"Open only to seniors and juniors during web registration."
	],
	"number": 282,
	"pn": false,
	"prerequisites": "BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.862524+00:00",
			"locations": [
				"TOH 308",
				"TOH 308"
			]
		},
		{
			"_updated": "2016-01-30T14:55:44.027069+00:00",
			"desc": "Students analyze the plays of Henrik Ibsen in English translation using a variety of critical approaches. Students investigate ethical issues and themes in Ibsen's plays by examining the plays through the lens of ethics, using readings in ethical theory to better understand both the ethical issues and the plays themselves. Students also study Ibsen's dramatic technique and the historical and literary context of his work. Taught in English. Offered most years. Counts toward women's and gender studies major and concentration. Prerequisite: BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-02-03T00:01:09.711965+00:00",
			"prerequisites": "Prerequisite: BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:31.858079+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.806322+00:00",
			"enroll": "9",
			"max": "19"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"type": "Research",
	"year": 2015
}
