{
	"clbid": 101514,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"THE NATURE OF NATURE WRITING. In the midst of climate change, extinction, and floating islands of garbage, what exactly is nature? How might writing about nature help to curtail the slow amble toward devastation around us? In this seminar, we’ll think about the content of nature writing but more importantly about what kinds of writing strategies most effectively promote that content. The subjects we’ll read about will be diverse: from definitions of sustainability to manifestos about hunting, from encounters with weasels to the absence of encounters with golden frogs, from the problems with consumption to the possibilities of cell phones as purveyors of green change. Assignments will include a personal narrative, a sustainability analysis essay, an editorial, and a radical re-creation project."
	],
	"enroll": 14,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Kaethe Schwehn"
	],
	"level": 100,
	"locations": [
		"RML 421",
		"RML 421"
	],
	"max": 19,
	"name": "First-Year Writing",
	"notes": [
		"Open to Environmental Conversation students only.",
		"Section title: The Nature of Nature Writing."
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-09T18:41:49.858672+00:00",
			"locations": [
				"RML 520",
				"RML 520"
			]
		},
		{
			"_updated": "2015-10-16T23:01:00.001956+00:00",
			"notes": "Open to Environmental Conversation students only."
		},
		{
			"_updated": "2015-11-06T00:02:17.904690+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.982623+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		},
		{
			"_updated": "2018-07-12T16:51:31.833926+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.775438+00:00",
			"enroll": "14",
			"max": "19"
		}
	],
	"section": "I",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"type": "Research",
	"year": 2015
}
