{
	"clbid": "0000101639",
	"credits": 1.0,
	"crsid": "0000000046",
	"department": "ART",
	"description": [
		"In this intermediate photography course, students explore a variety of techniques and topics. Techniques include historic processes such as cyanotype and salted paper printing, digital photography, large-scale color printing, and traditional black and white photography. Students investigate experimental approaches and non-traditional forms for presentation, and they investigate photography from broad historical, aesthetic, and social perspectives. This course includes field trips, readings, discussion, and visual presentations. Materials fee. Offered annually. Counts toward media studies concentration. Prerequisite: ART 104 or ART 205, or permission of instructor."
	],
	"enrolled": 10,
	"instructors": [
		"Margaret Ojala"
	],
	"level": 200,
	"locations": [
		"CAD 102",
		"CAD 102"
	],
	"max": 12,
	"name": "Intermediate Photography",
	"notes": [
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 238,
	"pn": false,
	"prerequisites": "ART 104 or ART 205, or permission of instructor.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:13.838567+00:00",
			"name": "Intermed Photography",
			"title": "Intermediate Photography"
		},
		{
			"_updated": "2016-01-30T14:55:44.081788+00:00",
			"desc": "In this intermediate photography course, students explore a variety of techniques and topics.Techniques include historic processes such as cyanotype and salted paper printing, digitalphotography, large-scale color printing, and traditional black and white photography. Studentsinvestigate experimental approaches and non-traditional forms for presentation, and theyinvestigate photography from broad historical, aesthetic, and social perspectives. This courseincludes field trips, readings, discussion, and slide presentations. Materials fee. Offered annually. Counts toward media studies concentration. Prerequisite: ART 104 or ART 205, or permission of instructor."
		},
		{
			"_updated": "2016-04-25T23:01:24.697488+00:00",
			"notes": null
		},
		{
			"_updated": "2017-05-30T15:52:43.724615+00:00",
			"locations": [
				"DC 102",
				"DC 102"
			]
		},
		{
			"_updated": "2018-02-03T00:01:09.747481+00:00",
			"prerequisites": "Prerequisite: ART 104 or ART 205, or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:31.893348+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.850220+00:00",
			"enroll": "10",
			"max": "12"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"times": [
		"T 1145-0245PM",
		"Th 1245-0345PM"
	],
	"type": "Research",
	"year": 2015
}
