{
	"clbid": "0000101971",
	"credits": 1.0,
	"crsid": "0000000975",
	"department": "PHIL",
	"description": [
		"Using examples from the natural sciences, this course examines fundamental concepts of science, including scientific method, the nature of scientific theories and hypotheses, objectivity in data collection and analysis, the use of technology in making observations, confirmation versus falsification, and explanation versus prediction. To illustrate why non-scientists need to understand scientific practice the course also considers controversies such as global warming and intelligent design. Offered annually. Counts toward neuroscience concentration."
	],
	"enroll": 17,
	"gereqs": [
		"IST",
		"WRI"
	],
	"instructors": [
		"Arthur Cunningham"
	],
	"level": 200,
	"locations": [
		"OM 310"
	],
	"max": 18,
	"name": "Philosophy of Science",
	"number": 244,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:39.286114+00:00",
			"locations": [
				"HH 516"
			]
		},
		{
			"_updated": "2015-11-12T00:01:24.789039+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.322833+00:00",
			"desc": "Using examples from the natural sciences, this course examines fundamental concepts of science, including scientific method, the nature of scientific theories and hypotheses, objectivity in data collection and analysis, the use of technology in making observations, confirmation versus falsification, and explanation versus prediction. To illustrate why non-scientists need to understand scientific practice the course also considers controversies such as global warming and intelligent design. Offered annually."
		},
		{
			"_updated": "2018-07-12T16:51:32.039772+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:26.037487+00:00",
			"enroll": "17",
			"max": "18"
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1045-1140"
	],
	"type": "Research",
	"year": 2015
}
