{
	"clbid": "0000101093",
	"credits": 1.0,
	"crsid": "0000000436",
	"department": "ENGL",
	"description": [
		"Students explore specific periods in American literature and examine the relationship between literary texts and movements and their particular cultural, political, and historical contexts. Each offering of this course examines a different literary era and emphasizes specific literary and historical issues. Click on course title in the class and lab for more information about the course for that term. Counts toward American studies major. Prerequisites: ENGL 185 plus at least two English courses at level II, or permission of the instructor."
	],
	"enrolled": 14,
	"instructors": [
		"Carol Holly"
	],
	"level": 300,
	"locations": [
		"RML 520"
	],
	"max": 15,
	"name": "Top: Sex, Madness & Marriage",
	"notes": [
		"Open to juniors and seniors who have completed English 185 and at least two",
		"level-II English courses or by permission of the instructor."
	],
	"number": 340,
	"pn": false,
	"prerequisites": "Prerequisites: ENGL 185 plus at least two English courses at level II, or permission of the instructor.",
	"revisions": [
		{
			"_updated": "2015-03-26T04:18:01.839317+00:00",
			"name": "Top: Sex,Madness&Marriage"
		},
		{
			"_updated": "2015-11-10T00:00:39.855992+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:54:41.467296+00:00",
			"desc": "Students explore specific periods in American literature and examine the relationship between literary texts and movements and their particular cultural, political, and historical contexts. Each offering of this course examines a different literary era and emphasizes specific literary and historical issues. Click on course title in the class and lab for more information about the course for that term. Prerequisites: ENGL 185 plus at least two English courses at level II, or permission of the instructor."
		},
		{
			"_updated": "2018-07-12T16:51:30.043363+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:23.035367+00:00",
			"enroll": "14",
			"max": "15"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20152,
	"times": [
		"M-F 1040-1240PM"
	],
	"title": "Advanced Studies in Literary Eras: American",
	"type": "Topic",
	"year": 2015
}
