{
	"clbid": 101585,
	"credits": 0.0,
	"crsid": 341,
	"departments": [
		"EDUC"
	],
	"description": "All candidates must have a multicultural field experience to help develop their competence in teaching in multicultural environments. A minimum of 80 hours of field experience in a multicultural school environment (an Interim or its equivalent) is required prior to student teaching. All field experiences must be pre-approved. Below is a summary of options: EDUC 170: Urban Schools and Communities; EDUC 347: Teaching English as a Second Language; EDUC 378: Multicultural Education in Hawaii; EDUC 379: Urban Education Seminar and Practicum; or pre-approved internships in multicultural schools with special cognitive component. See Education Department faculty and website for advice and information. EDUC 382 is not a course. Rather it is a recording mechanism indicating St. Olaf students who have completed their multicultural education requirement. Students register for EDUC 382 during their professional semester. P/N only. Offered each semester.",
	"instructors": [
		"Rosemary A. Pfarr-Baker"
	],
	"level": 300,
	"name": "Human Relations",
	"notes": "Open to Seniors in the professional semester only.",
	"number": 382,
	"pn": true,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-26T04:19:13.782169+00:00",
			"desc": "All candidates must have a multicultural field experience to help develop their competence in teaching in multicultural environments. A minimum of 80 hours of field experience in a multicultural school environment (an Interim or its equivalent) is required prior to student teaching. All field experiences must be pre-approved. Below is a summary of options: EDUC 170: Urban Schools and Communities; EDUC 347: Teaching English as a Second Language; EDUC 378: Multicultural Education in Hawaii ;EDUC379: Urban Education Seminar and Practicum; or pre-approved internships in multicultural schools with special cognitive component. See Education Department faculty and website for advice and information. EDUC 382 is not a course. Rather it is a recording mechanism indicating St. Olaf students who have completed their multicultural education requirement. Students register for EDUC 382 during their professional semester. P/N only. Offered each semester."
		},
		{
			"_updated": "2015-09-23T23:00:30.518042+00:00",
			"notes": "Open to Seniors only"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20153,
	"type": "Research",
	"year": 2015
}
