{
	"clbid": 101509,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": [
		"PERSONAL ECOLOGY. How have you been shaped by the natural places you know best? This seminar will focus on writers and filmmakers who narrate a personal experience with nature. We will read and discuss works in a range of genres, including creative nonfiction, memoir, ethnography, and documentary film. We will ask how individual and community identities are formed by interaction with nature, how cultures define “nature” differently, and how we can understand ourselves as participants in ecological systems that include living things, land, water, and air. Students will work on the process of writing, with short pieces culminating in a final research paper in which you further investigate a natural place you have experienced and write about its meaning for you."
	],
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Mary E. Trull"
	],
	"level": 100,
	"locations": [
		"RML 420"
	],
	"name": "First-Year Writing",
	"notes": [
		"Section title: Personal Ecology."
	],
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.786563+00:00",
			"locations": [
				"RML 520"
			]
		},
		{
			"_updated": "2015-10-16T23:00:59.959144+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-12T00:01:21.830583+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.971984+00:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "C",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0905-1000"
	],
	"type": "Research",
	"year": 2015
}
