{
	"clbid": "0000101312",
	"credits": 1.0,
	"crsid": "0000001191",
	"department": "REL",
	"description": [
		"THE BIBLE AND SALVATION. Like the Philippian jailer in Acts 16 who cries out for salvation while his life literally crumbles around him, people for millennia have turned to the God of scripture for hope in the midst of brokenness. From images of personal healing to cosmic renewal, the Bible employs a surprising variety of metaphors to speak of God’s care and faithfulness toward God’s creation and covenant peoples. Employing literary, historical, and cultural approaches to reading, in this course we will explore the rich diversity of biblical images of salvation. We will also delve into ways theologians have utilized these biblical motifs to address specific cultures and contexts, with an eye toward identifying metaphors of salvation appropriate to our contemporary situations and mindful of modern challenges and concerns."
	],
	"enroll": 17,
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Jason J. Ripley"
	],
	"level": 100,
	"locations": [
		"OM 305"
	],
	"max": 18,
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section title: The Bible and Salvation."
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.543201+00:00",
			"locations": [
				"OM 210"
			]
		},
		{
			"_updated": "2015-10-12T23:00:18.862401+00:00",
			"notes": null
		},
		{
			"_updated": "2015-11-20T06:01:46.273373+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.714211+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		},
		{
			"_updated": "2018-07-12T16:51:31.727705+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.633266+00:00",
			"enroll": "17",
			"max": "18"
		}
	],
	"section": "A",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0800-0855"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
