{
	"clbid": 101513,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": "WRITING LIFE IN THE ANTHROPOCENE. Nobel Prize-winning scientist Paul Crutzen once proposed that we could now call our present moment in geologic history the \u0093Anthropocene\u0094\u0097 the time of pervasive human power shaping life on Earth. Reflecting on this era, a number of contemporary writers and environmental philosophers wrestle with devastating environmental realities from human-caused global warming to mass extinctions to contemporary use of technology. They attempt to write the intricacies of earthen tragedy, beauty and responsibility in the human age. This seminar explores writing that takes on that task of thinking about the Anthropocene. Each reflects on the porous and shifting borders of what counts as \u0093human\u0094 and \u0093nonhuman,\u0094 \u0093natural\u0094 and \u0093unnatural.\u0094 We\u0092ll read Elizabeth Kolbert\u0092s chronicle of species loss in The Sixth Extinction, Alison Hawthorne Deming\u0092s personal essay-meditations on various species in Zoologies, and a range of fiction writers and poets such as Todd Davis, Ross Gay, and Pattiann Rogers as they attempt to write about life and death on Earth in new and provoking ways.",
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Jacob J. Erickson"
	],
	"level": 100,
	"locations": [
		"OM 305",
		"OM 305"
	],
	"name": "First-Year Writing",
	"notes": "Section title: Writing Life in the Anthropocene.",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T16:54:38.794992-05:00",
			"locations": [
				"TOH 316"
			]
		},
		{
			"_updated": "2015-10-16T12:00:38.535662-05:00",
			"instructors": [
				"Staff"
			],
			"locations": [
				"OM 210"
			],
			"section": "D",
			"times": [
				"MWF 1045-1140"
			]
		},
		{
			"_updated": "2015-10-16T18:00:59.987087-05:00",
			"notes": null
		},
		{
			"_updated": "2015-11-19T18:01:12.907063-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:43.980395-06:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "H",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0800-0925",
		"Th 0800-0920"
	],
	"type": "Research",
	"year": 2015
}
