{
	"clbid": "0000101655",
	"credits": 1.0,
	"crsid": "0000000045",
	"departments": [
		"ART"
	],
	"description": [
		"This intermediate-level course assumes students have a substantial understanding of ceramic processes, plus a good awareness of their own interests in the realm of ceramic expression. The instructor helps students focus their efforts by proposing specific areas of investigation. Materials fee. Offered annually. Prerequisite: ART 207. Previous studio experience in ceramics is accepted when approved by the instructor."
	],
	"enroll": 15,
	"instructors": [
		"Ron Gallas"
	],
	"level": 200,
	"locations": [
		"CAD 115",
		"CAD 115"
	],
	"max": 16,
	"name": "Intermediate Ceramics",
	"notes": [
		"This course has class-year limits."
	],
	"number": 234,
	"pn": false,
	"prerequisites": "ART 207. Previous studio experience in ceramics is accepted when approved by the instructor.",
	"revisions": [
		{
			"_updated": "2015-12-11T06:01:56.107241+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:44.106019+00:00",
			"desc": "This intermediate-level course assumes students have a substantial understanding of ceramicprocesses, plus a good awareness of their own interests in the realm of ceramic expression. Theinstructor helps students focus their efforts by proposing specific areas ofinvestigation.Materials fee. Offered annually. Prerequisite: ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor.",
			"prerequisites": "Prerequisite: ART 103 or ART 207. Previous studio experience in ceramics is accepted when approved by the instructor."
		},
		{
			"_updated": "2017-05-30T15:52:43.730570+00:00",
			"locations": [
				"DC 115",
				"DC 115"
			]
		},
		{
			"_updated": "2018-02-03T00:01:09.758562+00:00",
			"prerequisites": "Prerequisite: ART 207. Previous studio experience in ceramics is accepted when approved by the instructor."
		},
		{
			"_updated": "2018-07-12T16:51:31.904432+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:25.863878+00:00",
			"enroll": "15",
			"max": "16"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"T 0800-1100",
		"Th 0800-1050"
	],
	"type": "Research",
	"year": 2015
}
