{
	"clbid": 101318,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": [
		"GENDER IMAGININGS. Debates about the Bible’s role in defining “male” and “female” as well as the marital, sexual and social roles that flow out of gender are a lively part of contemporary culture. This section will think about the Bible in relationship to such debates. In particular, two questions will inform our conversations: 1) How is gender presented within the biblical world? 2) How does the Bible shape how we “imagine” gender? In order to ask these questions, we will examine a variety of ways contemporary thinkers understand gender within the biblical canon, ideas about the moral and social authority of the Bible and how the Bible is employed within contemporary debates about gender."
	],
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Peder J. Jothen"
	],
	"level": 100,
	"locations": [
		"OM 340"
	],
	"name": "Bible/Culture/Commun",
	"notes": [
		"Section title: Gender Imaginings."
	],
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-04-07T21:54:38.554681+00:00",
			"locations": [
				"OM 305"
			]
		},
		{
			"_updated": "2015-10-12T23:00:18.921510+00:00",
			"notes": null
		},
		{
			"_updated": "2015-12-03T00:01:57.434980+00:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T14:55:43.728697+00:00",
			"desc": "http:/www.stolaf.edu/registrar/rel This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "G",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 1150-1245PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2015
}
