{
	"clbid": 101511,
	"credits": 1.0,
	"crsid": 498,
	"departments": [
		"WRIT"
	],
	"description": "BORDER-CROSSINGS. 2015-16 marks the year of the greatest refugee crisis in recorded history. Using readings from journalism, nonfiction, and fiction, this seminar examines the concept of crossing borders-- geographically as well as metaphorically. Why leave home, why breach a boundary, how do people retain their humanity while crossing and creating a new life on the other side? Issues we explore include \u0093border syndrome\u0094 as an emotional state (Gazmend Kapllani, A Border Crossing Handbook), undocumented immigration to the United States (Sonia Nazario, Enrique\u0092s Journey ), cross-class identity in pre- and post-revolution China (Yua Hua, To Live), the body\u0092s borders and the limits of medicine (the NY Times journalist who reported on the Ebola crisis), and the thin line between life and death (Markus Zusak, The Book Thief ). We focus on the process of writing and on contextual research in short assignments, with each student\u0092s work culminating in a \u0093dense\u0094 description of one border crossing.",
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Karen Cherewatuk"
	],
	"level": 100,
	"locations": [
		"OM 210"
	],
	"name": "First-Year Writing",
	"notes": "Section title: Border-Crossings.",
	"number": 111,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-05-05T18:00:18.631088-05:00",
			"locations": [
				"RML 421"
			]
		},
		{
			"_updated": "2015-10-16T18:00:59.973257-05:00",
			"notes": null
		},
		{
			"_updated": "2015-11-11T18:01:21.854006-06:00",
			"status": "O"
		},
		{
			"_updated": "2016-01-30T08:55:43.975917-06:00",
			"desc": "See http://wp.stolaf.edu/registrar/writ/\nFirst-Year Writing, taken during the first year, equips students for effective writing in the liberal arts and introduces writing as a means of learning. The course is taught in multiple sections that explore a variety of topics. In all sections, students write frequently in a variety of genres, with emphasis in writing expository essays. One or more assignments require research. As part of the writing process, students revise their writing and meet individually with course faculty to discuss their writing."
		}
	],
	"section": "B",
	"semester": 3,
	"status": "C",
	"term": 20153,
	"times": [
		"MWF 0905-1000"
	],
	"type": "Research",
	"year": 2015
}
