{
	"clbid": "0000080572",
	"credits": 1.0,
	"crsid": "0000018782",
	"department": "ENVST",
	"description": [
		"Env Studies 381A Imagining Environmentalism",
		"(Arts and Humanities): It's been almost 50 years since Rachel Carson published Silent Spring in 1962, and the environmental movement has grown significantlly. Most Americans, however, are not environmentalists, and most Americans live in ways that aren't sustainable. This research seminar explores the environmental history of the last fifty years, and especially the ways in which words and images have affected and reflected changing American beliefs and behavior. Students will read intensively for the first half of the semester, before embarking on original research projects that illuminate the many ways that modern Americans are making environmental history.",
		"----------------------------------------------------------------------------------------------------",
		"Env Studies 381B Landscape and Regional Change in the Arctic",
		"(Natural Science): Broad regional and landscape-level changes in the Arctic are increasingly in the news and include the northerly movement of the forest-tundra treeline, expansion of shrubs, and increasing numbers of shallow lakes as permafrost melts. These changes have important regional and global implications for energy, carbon, and hydrological balance. Students in this course will read and discuss the primary literature during the first half of the semester, and in the second half of the semester engage in a project to document landscape changes over the past 60 years in the low arctic tundra of northern Manitoba and potentially the Siberian Arctic. Prior completion of ES 255 is helpful but not required."
	],
	"enrolled": 19,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"James Farrell"
	],
	"level": 300,
	"max": 18,
	"name": "Top:Imagining Environment",
	"number": 381,
	"offerings": [
		{
			"day": "Mo",
			"end": "13:50",
			"location": "HH 302",
			"start": "12:55"
		},
		{
			"day": "We",
			"end": "13:50",
			"location": "HH 302",
			"start": "12:55"
		},
		{
			"day": "Fr",
			"end": "13:50",
			"location": "HH 302",
			"start": "12:55"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2018-07-12T16:50:57.296583+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:47:50.444844+00:00",
			"enroll": "19",
			"max": "18"
		}
	],
	"section": "A",
	"semester": 1,
	"status": "C",
	"term": 20111,
	"title": "Advanced Research Topics in Environmental Studies",
	"type": "Topic",
	"year": 2011
}
