{
	"clbid": "0000130442",
	"credits": 1.0,
	"crsid": "0000000498",
	"department": "WRIT",
	"description": [
		"We live in a period of intense environmental uncertainty. We witness signs of this uncertainty daily: maybe we swipe past a headline about a vanishing species or glimpse a melting glacier on social media. Maybe we watch an interview with refugees displaced by rising seas—or sense the effects of climate change ourselves. Such experiences can leave us feeling uncertain about our futures, pointing us toward a question: how do we live well - that is, ethically, pragmatically, and hopefully - in the time of climate change? In this seminar, we will encounter and respond to essays, articles, films, and podcasts that explore what it means to live meaningfully during environmental uncertainty. Discussion will focus on the crossroads of climate change and topics like food, animal and nonhuman life, migration and diaspora, rewilding, and tourism. Additionally, students will develop their own writing and research through a place-based personal essay, an investigative essay, a digital media project, and a series of reading forums. Ultimately, students will increase their ability to explain emerging environmental concepts while developing academic and professional writing skills in a media-rich classroom environment. No prior environmental knowledge is required."
	],
	"enrolled": 11,
	"gereqs": [
		"FYW"
	],
	"instructors": [
		"Ryan C. Eichberger"
	],
	"level": 100,
	"max": 18,
	"name": "First-Year Writing",
	"notes": [
		"Section topic: Living Well in the Time of Climate Change"
	],
	"number": 111,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "RNS 435",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "RNS 435",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2019-11-21T07:39:57.049159+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2019-11-23T07:41:24.848564+00:00",
			"enrolled": 4
		},
		{
			"_updated": "2019-11-24T07:42:15.173636+00:00",
			"enrolled": 5
		},
		{
			"_updated": "2019-11-29T07:44:38.281894+00:00",
			"enrolled": 6
		},
		{
			"_updated": "2019-12-22T07:55:30.411009+00:00",
			"instructors": [
				"Staff"
			]
		},
		{
			"_updated": "2020-01-05T08:03:16.362070+00:00",
			"enrolled": 8
		},
		{
			"_updated": "2020-01-19T08:10:12.462988+00:00",
			"enrolled": 10
		}
	],
	"section": "Q",
	"semester": 3,
	"status": "C",
	"term": 20193,
	"type": "Research",
	"year": 2019
}
