{
	"clbid": "0000073458",
	"credits": 1.0,
	"crsid": "0000021394",
	"department": "FREN",
	"description": [
		"Students study French language and Moroccan culture in the imperial city of Fes. An immersion experience that includes home stays with local French-speaking families, the course focuses on Moroccan culture yesterday and today, emphasizing the multicultural aspects of Morocco and facilitating student interaction with the local population. Field trips to various sites in and around Fes, day-long visits to Meknès and Moulay Idriss, and a longer excursion to Marrakech and Casablanca. Review of second-year French grammar is integrated into the reading and discussion of texts pertaining to Morocco's history and culture and their relation to present-day Morocco. Taught in French. Prerequisite: French 231 or placement in French 232. Offered during interim. Open to first-year students."
	],
	"enrolled": 11,
	"instructors": [
		"Amine R. Bekhechi"
	],
	"learningmode": "S",
	"level": 200,
	"max": 18,
	"name": "Fr Lang/Moroccan Culture",
	"notes": [
		"Open to all students who meet the requirements.",
		"This is an off-campus course."
	],
	"number": 235,
	"pn": false,
	"prerequisites": "French 231 or placement in French 232. Offered during interim. Open to first-year students.",
	"revisions": [
		{
			"_updated": "2018-02-02T23:52:35.196893+00:00",
			"prerequisites": "Prerequisite: French 231 or placement in French 232. Offered during interim. Open to first-year students."
		},
		{
			"_updated": "2018-07-12T16:50:50.879741+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:47:38.540828+00:00",
			"enroll": "11",
			"max": "18"
		},
		{
			"_updated": "2020-10-15T15:23:38.568902+00:00",
			"learningmode": null
		},
		{
			"_updated": "2025-10-11T21:36:03.586905+00:00",
			"gereqs": [
				"FOL-F",
				"MCG"
			]
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20102,
	"title": "French Language and Moroccan Culture in Fes",
	"type": "Research",
	"year": 2010
}
