{
	"clbid": "0000112948",
	"credits": 1.0,
	"crsid": "0000000632",
	"departments": [
		"HIST"
	],
	"description": [
		"This seminar has two major objectives: 1) to study the Holocaust within the context of twentieth-century European and German history, and 2) to examine key issues and problems historians encounter as they try to understand the Holocaust. Topics may include: antisemitism in Europe and the Third Reich; the genesis of the Final Solution; the bureaucracy, process, and personnel of extermination; individual and state complicity in the Holocaust; acts of resistance and rescue; evolution of the intentionalist/stucturalist debate; issues in the representation and memorialization of the Holocaust; the Holocaust and genocide studies; and the phenomenon of Holocaust denial. Students will read a variety of secondary works that place the Holocaust in historical context and identify important scholarly debates. Students will examine a range of primary sources (e.g., survivors’ testimony, photographs, official documents) to explore issues raised in interpreting certain types of Holocaust evidence. Finally, students will view a number of films, including Shoah, Schindler’s List, and Life is Beautiful, to consider how the Holocaust can be portrayed to a broad public in an historically and politically responsible way. Pre-requisite: Hist 191, 224, 226, or permission of the instructor."
	],
	"enroll": 16,
	"gereqs": [
		"WRI"
	],
	"instructors": [
		"Dolores Peters"
	],
	"level": 300,
	"locations": [
		"OM 140",
		"OM 140"
	],
	"max": 17,
	"name": "Sem: Holocaust & History",
	"notes": [
		"Especially for rising junior and senior history majors, others need permission",
		"of instructor."
	],
	"number": 320,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2017-04-12T23:40:32.507787+00:00",
			"status": "O"
		},
		{
			"_updated": "2018-07-12T16:51:44.555056+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:37.145911+00:00",
			"enroll": "16",
			"max": "17"
		}
	],
	"semester": 1,
	"status": "C",
	"term": 20171,
	"times": [
		"T 0120-0245PM",
		"Th 0215-0335PM"
	],
	"title": "Seminar: Modern Europe",
	"type": "Seminar",
	"year": 2017
}
