{
	"clbid": "0000112267",
	"credits": 1.0,
	"crsid": "0000030308",
	"department": "DANCE",
	"description": [
		"Students study musculoskeletal anatomy (structure) and kinesiology (science of human motion) from the perspective of dance training and performance. Students learn anatomical terminology, identify select bones (major features, articulations) and muscles (locations, actions), and analyze their influence during coordinated movement patterns. Students learn joint structure and mechanics, alignment and imbalances, movement behavior, conditioning needs, and injury prevention. Students learn to notice, measure, experience, sense, and reflect upon the impact of anatomical characteristics and anomalies. Offered annually. Prerequisite: students taking this course should have previous experience in a movement intensive practice similar to dance, athletics, or exercise science. Offered annually in the fall semester."
	],
	"enrolled": 11,
	"gereqs": [
		"IST"
	],
	"instructors": [
		"Anthony Roberts"
	],
	"level": 200,
	"max": 16,
	"name": "Dance Anatomy and Kinesiology",
	"number": 270,
	"offerings": [
		{
			"day": "Tu",
			"end": "09:25",
			"location": "CAD Studio 1",
			"start": "08:00"
		},
		{
			"day": "Th",
			"end": "09:20",
			"location": "CAD Studio 1",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "students taking this course should have previous experience in a movement intensive practice similar to dance, athletics, or exercise science. Offered annually in the fall semester.",
	"revisions": [
		{
			"_updated": "2017-05-04T23:48:51.750985+00:00",
			"gereqs": null
		},
		{
			"_updated": "2018-02-03T00:03:28.767427+00:00",
			"prerequisites": "Prerequisite: students taking this course should have previous experience in a movement intensive practice similar to dance, athletics, or exercise science. Offered annually in the fall semester."
		},
		{
			"_updated": "2018-07-12T16:51:44.195823+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:36.787209+00:00",
			"enroll": "11",
			"max": "16"
		}
	],
	"semester": 1,
	"status": "O",
	"term": 20171,
	"type": "Research",
	"year": 2017
}
