{
	"clbid": 111736,
	"credits": 1.0,
	"crsid": 1191,
	"departments": [
		"REL"
	],
	"description": [
		"THE BIBLE, ANGELS AND DEMONS. How should interpreters of the biblical text make sense of references to supernatural beings like angels and demons? In what sense are they supposed to be real? How do they relate to the divine? What is their relationship with evil? Are there evil angels in the Bible and if so, where do they come from? This section will explore how different biblical texts deal with these questions. It will also examine how diverse religious communities, reading the Bible from different cultural backgrounds, have interpreted biblical texts differently in constructing concepts of spiritual, superhuman, and non-corporeal beings. From biblical texts, we will discuss figures such as the heavenly court, the serpent and Watchers of Genesis, angelic visitors, the Adversary of Job, and angels, demons, and the devil seen in many New Testament texts. We will consider how the interpretation of these biblical texts has impacted post-biblical reflection on discernment, the importance of radical hospitality, witchcraft, and heresy. In addition to the biblical text, students will work with historical writings, film, literary fiction, and traditions of scientific skepticism."
	],
	"gereqs": [
		"BTS-B"
	],
	"instructors": [
		"Benjamin E. Heidgerken"
	],
	"level": 100,
	"locations": [
		"OM 020"
	],
	"name": "Bible/Culture/Commun",
	"notes": "Section Topic: The Bible, Angels and Demons. Supplemental Instruction (SI) is available for this course.",
	"number": 121,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2016-10-13T11:31:28.245162+00:00",
			"notes": null
		},
		{
			"_updated": "2016-10-27T11:31:18.227756+00:00",
			"notes": "Section Topic: The Bible, Angels and Demons."
		},
		{
			"_updated": "2016-11-11T11:31:32.585874+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:12:40.233106+00:00",
			"description": "This course introduces first-year students to the dialogue between Biblical traditions and the cultures and communities related to them. Students study major Biblical texts and their interaction with, for example, theology, religious practice, ethics, and social values, while considering methods and fields in the study of religion in a liberal arts setting. An additional prospectus describes the theme of each section."
		}
	],
	"section": "S",
	"semester": 3,
	"status": "C",
	"term": 20163,
	"times": [
		"MWF 1255-0150PM"
	],
	"title": "Bible in Culture and Community",
	"type": "Research",
	"year": 2016
}
