{
	"clbid": 111737,
	"credits": 1.0,
	"crsid": 1244,
	"departments": [
		"REL"
	],
	"description": [
		"Should one approach and treat a sacred text differently from than other texts like King Lear, Dante's Inferno, or Harry Potter? What kinds of truths do we look for in texts and what makes certain texts “sacred?” In our contemporary culture where we primarily look to science, law, history, and, of course, the Internet for information about the world, is there a role left for sacred texts? This course raises these and other questions by examining practices of reading one particular scripture, the Bible, and by considering the category of scripture across multiple traditions. We trace interpretative strategies from late antiquity to postmodernity, and we consider scriptural texts as material objects (written on stone, plant leaves, parchment, or digitized; held aloft and buried in cemeteries; sung, recited, and illuminated). This course will be of interest to students who like books and want to hone their interpretive skills! It will be run mostly as a seminar, with occasional guest speakers and field trips."
	],
	"enroll": 8,
	"instructors": [
		"Mara H. Benjamin"
	],
	"level": 300,
	"locations": [
		"OM 110",
		"OM 110"
	],
	"max": 24,
	"name": "Top: Interpreting Sacred Texts",
	"number": 320,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2017-05-30T17:12:40.310066+00:00",
			"description": "Careful study of selected sacred texts provides students with the opportunity to learn and use various tools and methods of interpretation. Students increase their understanding of the origins, structure, use and interpretation of sacred texts in various religious communities. Specific texts and traditions vary. Students may repeat the course with different primary texts. Counts toward ancient studies major. Prerequisite: BTS-B.",
			"prerequisites": "Prerequisite: BTS-B."
		},
		{
			"_updated": "2018-07-12T16:51:41.319646+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:33.854623+00:00",
			"enroll": "8",
			"max": "24"
		}
	],
	"semester": 3,
	"status": "O",
	"term": 20163,
	"times": [
		"T 0935-1100",
		"Th 0930-1050"
	],
	"title": "Interpreting Sacred Texts",
	"type": "Topic",
	"year": 2016
}
