{
	"clbid": "0000106681",
	"credits": 1.0,
	"crsid": "0000000148",
	"departments": [
		"BIO"
	],
	"description": [
		"This course is a service/learning experience. Week one is spent on campus learning basic clinical techniques, examining emerging disease, and studying existing health care issues. Students spend three weeks in Cuzco, Peru, assessing patient needs in a public hospital, a homeless shelter, orphanages, and a small village. Week four involves discussion and writing reflective journals. Apply through the Office of International and Off-Campus Studies. Offered during Interim. Prerequisites: BIO 150 or BIO 231, and BIO 291."
	],
	"enroll": 18,
	"instructors": [
		"Sara E. Fruehling"
	],
	"level": 200,
	"max": 18,
	"name": "Peruvian Medical Experience",
	"notes": [
		"This is an off-campus course.",
		"You will find this course listed in Studio Abroad under its course title.",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 284,
	"pn": false,
	"prerequisites": "Prerequisites: BIO 150 or BIO 231, and BIO 291.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:36.433022+00:00",
			"locations": []
		},
		{
			"_updated": "2016-09-23T11:31:26.567885+00:00",
			"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title. This course includes an academic civic engagement (ACE) component.",
			"status": "O"
		},
		{
			"_updated": "2016-11-03T11:31:37.539159+00:00",
			"notes": "This is an off-campus course. You will find this course listed in Studio Abroad under its course title."
		},
		{
			"_updated": "2017-05-30T17:11:19.547841+00:00",
			"description": "This course is a service/learning experience. Week one is spent on campus learning basic clinical techniques, examining emerging disease, and studying existing health care issues. Students spend three weeks in Cuzco, Peru, assessing patient needs in a public hospital, a homeless shelter, orphanages, and a small village. Week four involves discussion and writing reflective journals. Apply through the Office of International and Off-Campus Studies. Offered during Interim. Prerequisites: BIO 150 or BIO 126 or BIO 231, and BIO 291.",
			"prerequisites": "Prerequisites: BIO 150 or BIO 126 or BIO 231, and BIO 291."
		},
		{
			"_updated": "2018-07-12T16:51:38.513245+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:31.727493+00:00",
			"enroll": "18",
			"max": "18"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20162,
	"type": "Research",
	"year": 2016
}
