{
	"clbid": "0000106423",
	"credits": 1.0,
	"crsid": "0000000977",
	"department": "PHIL",
	"description": [
		"This course clarifies central concepts and distinctions developed in the literature of moral philosophy and applications of those concepts and distinctions to concrete moral problems that arise in the practice of medicine. Issues may include euthanasia, abortion, medical paternalism, allocation of scarce medical resources, culturally sensitive medical care, pandemics, and conflicts of loyalty in managed care. Readings are drawn from both philosophical and medical discussions. Offered annually. Counts toward neuroscience concentration. Prerequisite: completion of BTS-T or permission of instructor."
	],
	"enrolled": 21,
	"gereqs": [
		"EIN"
	],
	"instructors": [
		"Karen Gervais"
	],
	"level": 200,
	"max": 25,
	"name": "Biomedical Ethics",
	"notes": [
		"Prerequisite: Completion of BTS-T or permission of instructor.",
		"Open only to seniors and juniors during web registration."
	],
	"number": 250,
	"offerings": [
		{
			"day": "Mo",
			"end": "10:00",
			"location": "TOH 112",
			"start": "08:00"
		},
		{
			"day": "Tu",
			"end": "10:00",
			"location": "TOH 112",
			"start": "08:00"
		},
		{
			"day": "We",
			"end": "10:00",
			"location": "TOH 112",
			"start": "08:00"
		},
		{
			"day": "Th",
			"end": "10:00",
			"location": "TOH 112",
			"start": "08:00"
		},
		{
			"day": "Fr",
			"end": "10:00",
			"location": "TOH 112",
			"start": "08:00"
		}
	],
	"pn": false,
	"prerequisites": "completion of BTS-T or permission of instructor.",
	"revisions": [
		{
			"_updated": "2016-04-25T21:43:36.264199+00:00",
			"locations": [],
			"notes": "Prerequisite: Completion of BTS-T or permission of instructor. Open to seniors and juniors during web registration."
		},
		{
			"_updated": "2016-06-25T06:18:41.688376+00:00",
			"locations": [
				"TBA"
			]
		},
		{
			"_updated": "2016-11-01T11:31:29.826249+00:00",
			"locations": [
				"TOH 214"
			]
		},
		{
			"_updated": "2016-11-23T11:31:18.860783+00:00",
			"status": "O"
		},
		{
			"_updated": "2017-05-30T17:10:57.819560+00:00",
			"description": "This course clarifies central concepts and distinctions developed in the literature of moral philosophy and applications of those concepts and distinctions to concrete moral problems that arise in the practice of medicine. Issues may include euthanasia, abortion, medical paternalism, allocation of scarce medical resources, culturally sensitive medical care, pandemics, and conflicts of loyalty in managed care. Readings are drawn from both philosophical and medical discussions. Offered annually. Counts toward biomedical studies concentration (for students through class of 2016) and neuroscience concentrations. Prerequisite: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-02-03T00:01:56.772189+00:00",
			"prerequisites": "Prerequisite: completion of BTS-T or permission of instructor."
		},
		{
			"_updated": "2018-07-12T16:51:38.417797+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:31.602405+00:00",
			"enroll": "21",
			"max": "25"
		}
	],
	"semester": 2,
	"status": "C",
	"term": 20162,
	"type": "Research",
	"year": 2016
}
