{
	"clbid": "0000098762",
	"credits": 1.0,
	"crsid": "0000000940",
	"departments": [
		"NURS"
	],
	"description": [
		"This course examines how contemporary culture influences present-day wellness perspectives. Values, lifestyle, daily stresses, and corresponding coping mechanisms affecting one's well-being are explored. Students study health behaviors as a function of social influences and, conversely, the impact of unhealthy coping behaviors on the social enterprise. This course also includes an exploration of wellness from the perspective of non-western cultures. Offered annually during Interim, spring semester, or fall semester. Counts towards American studies major and media studies and film studies concentrations."
	],
	"enroll": 31,
	"gereqs": [
		"HBS"
	],
	"instructors": [
		"Diana Neal"
	],
	"level": 100,
	"locations": [
		"HH 307"
	],
	"max": 30,
	"name": "Images of Wellness",
	"notes": [
		"Open to all students."
	],
	"number": 120,
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2015-03-10T21:59:58.268068+00:00",
			"locations": null,
			"status": "O"
		},
		{
			"_updated": "2016-01-30T15:05:07.547227+00:00",
			"desc": "This course examines how contemporary culture influences present-day wellness perspectives. Values, lifestyle, daily stresses, and corresponding coping mechanisms affecting one's well-being are explored. Students study health behaviors as a function of social influences and, conversely, the impact of unhealthy coping behaviors on the social enterprise. This course also includes an exploration of wellness from the perspective of non-western cultures. Offered annually during Interim, spring semester, or fall semester. Counts towards American studies major and media film studies concentration."
		},
		{
			"_updated": "2018-07-12T16:51:24.299979+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:18.058511+00:00",
			"enroll": "31",
			"max": "30"
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20143,
	"times": [
		"M 0700-1000PM"
	],
	"type": "Research",
	"year": 2014
}
