{
	"clbid": "0000084986",
	"credits": 1.0,
	"crsid": "0000000939",
	"department": "NURS",
	"description": [
		"This course explores the sources, chemical composition, and metabolic behavior of nutrients. Nutritional requirements for a balanced diet are examined as well as the consequences of excesses and deficiencies. Students use nutrition tools and guidelines to make sound food choices, learn how to read food labels, and consider factors affecting food consumption. Class activities increase students' awareness of a healthy diet, help students evaluate nutrition behaviors, and facilitate a nutritionally sound lifestyle. Prerequisite: High school biology and chemistry strongly recommended. Offered annually during Interim and in the spring semester. Counts towards exercise science major and biomedical studies concentration."
	],
	"enrolled": 30,
	"gereqs": [
		"IST"
	],
	"instructors": [
		"Bob Hauck"
	],
	"learningmode": "S",
	"level": 100,
	"max": 30,
	"name": "Nutrition & Wellness",
	"number": 110,
	"offerings": [
		{
			"day": "Tu",
			"end": "11:00",
			"location": "SAC 112",
			"start": "09:35"
		},
		{
			"day": "Th",
			"end": "10:50",
			"location": "SAC 112",
			"start": "09:30"
		}
	],
	"pn": false,
	"prerequisites": "High school biology and chemistry strongly recommended. Offered annually during Interim and in the spring semester. Counts towards exercise science major and biomedical studies concentration.",
	"revisions": [
		{
			"_updated": "2018-02-02T23:56:29.839902+00:00",
			"prerequisites": "Prerequisite: High school biology and chemistry strongly recommended. Offered annually during Interim and in the spring semester. Counts towards exercise science major and biomedical studies concentration."
		},
		{
			"_updated": "2018-07-12T16:51:08.849635+00:00",
			"enroll": null,
			"max": null
		},
		{
			"_updated": "2018-08-07T14:48:02.456188+00:00",
			"enroll": "30",
			"max": "30"
		},
		{
			"_updated": "2020-10-15T15:23:46.955890+00:00",
			"learningmode": null
		},
		{
			"_updated": "2023-08-09T02:31:02.161217+00:00",
			"instructors": [
				"Robert Hauck"
			]
		}
	],
	"semester": 3,
	"status": "C",
	"term": 20123,
	"title": "Nutrition and Wellness",
	"type": "Research",
	"year": 2012
}
