{
	"clbid": "0000150730",
	"credits": 1.0,
	"crsid": "0000000308",
	"department": "EDUC",
	"description": [
		"In this course, students examine how schools and communities in the Twin Cities interact to provide support and developmental opportunities for school-age children. Through lectures, readings, discussions, field trips, and in-school and co-curricular placements, students gain an understanding and awareness of how race, class, ethnicity, national origin, and gender shape the complex character of urban youth and schools. Students spend one week in orientation activities on campus and two weeks in the Twin Cities. During the time in the Twin Cities, St. Olaf students participate as tutors and classroom assistants during the school day and then assist in various after-school and community programs. The last week of January Term is spent back on campus discussing the experience. P/N only. Preference given to first-year students but all students may apply. Offered during January Term. Apply through the Education Department. Also counts toward race and ethnic studies major and concentration."
	],
	"enrolled": 10,
	"gereqs": [
		"MCD",
		"OEP"
	],
	"instructors": [
		"Courtney A. Humm"
	],
	"learningmode": "S",
	"level": 100,
	"max": 24,
	"name": "Urban Schools and Communities",
	"notes": [
		"This course is open to all students. (International students must be sophomores,",
		"juniors, or seniors as CPT approval is required). Admission by application.",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 170,
	"pn": true,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2023-09-08T02:22:04.124770+00:00",
			"status": "C"
		},
		{
			"_updated": "2023-10-08T02:22:14.913708+00:00",
			"status": "O"
		},
		{
			"_updated": "2023-10-11T02:20:15.367358+00:00",
			"status": "C"
		},
		{
			"_updated": "2023-10-21T02:17:54.579376+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2023-10-22T02:23:24.408746+00:00",
			"enrolled": 2
		},
		{
			"_updated": "2023-10-25T02:20:14.293584+00:00",
			"enrolled": 3
		},
		{
			"_updated": "2023-10-26T02:19:22.344396+00:00",
			"enrolled": 4
		},
		{
			"_updated": "2023-10-30T02:22:01.852082+00:00",
			"enrolled": 5
		},
		{
			"_updated": "2023-11-01T02:24:53.461346+00:00",
			"enrolled": 6
		},
		{
			"_updated": "2023-11-02T02:20:59.902867+00:00",
			"enrolled": 7
		}
	],
	"semester": 2,
	"status": "O",
	"term": 20232,
	"type": "Research",
	"year": 2023
}
