{
	"clbid": "0000150193",
	"credits": 1.0,
	"crsid": "0000036173",
	"department": "FYS",
	"description": [
		"How does contemporary culture--from popular music, social media, and sports, to education, politics, and religion--shape your sense of self and your understanding of others? In this seminar, we will use American culture to examine questions of identity and difference and the experiences that help us define ourselves as individuals and as members of various communities, including St. Olaf. A through line for the course will be those identity categories that tend to shape our lives in obvious and hidden ways: race, ethnicity, religion, class, age, gender, sexuality, and ability, among others. For example, we will discuss the racial and gender politics of hip-hop, browse the social media accounts of so-called influencers, and consider the relationship between college athletics and economics. This section is writing intensive, and we will focus on all aspects of the writing process. Your assignments will emphasize expressing opinion, analyzing media in various forms, researching how a political or social movement represents itself, and responding to the opinions of others. The final project will be a reflection--using words and images--on those influences that inform your identity and the person you imagine becoming."
	],
	"enrolled": 14,
	"gereqs": [
		"FYS"
	],
	"groupid": "0000036173",
	"grouptype": "E",
	"instructors": [
		"Sean F. Ward"
	],
	"learningmode": "S",
	"level": 100,
	"max": 14,
	"name": "Top: Identity, Media, & Am Culture",
	"notes": [
		"Section topic: Identity, Media, and American Culture",
		"Writing-intensive",
		"Enrollment by placement"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Mo",
			"end": "14:55",
			"location": "RML 420",
			"start": "14:00"
		},
		{
			"day": "We",
			"end": "14:55",
			"location": "RML 420",
			"start": "14:00"
		},
		{
			"day": "Fr",
			"end": "14:55",
			"location": "RML 420",
			"start": "14:00"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2023-06-23T03:01:38.211142+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2023-06-24T03:00:25.622976+00:00",
			"enrolled": 12,
			"status": "O"
		},
		{
			"_updated": "2023-07-19T03:44:57.615075+00:00",
			"enrolled": 15
		}
	],
	"section": "E",
	"semester": 1,
	"status": "C",
	"term": 20231,
	"title": "First-Year Seminar",
	"type": "Topic",
	"year": 2023
}
