{
	"clbid": "0000150229",
	"credits": 1.0,
	"crsid": "0000036173",
	"department": "FYS",
	"description": [
		"In this course, we will collaborate and use a variety of methods to try to answer the question: Who is science for? Through readings, discussion, and community engagement, we will explore the natural world around us and consider issues like vaccine acceptance and climate change. We will ask: Why is there skepticism of science?, How do people start to think of themselves as scientists?, and What do we need to learn about our own community in this part of Minnesota to make science accessible and useful to more people? Moving from inquiry to action, we will use our learning to help us develop and curate materials to be used for science outreach at community gatherings and in schools. The course will culminate with a science outreach event in the community. This course has an Academic Civic Engagement Component: Students will have the opportunity to spend six Thursdays working and learning with youth in the community during and after class until 5pm. Alternative assignments may be given only under special circumstances (athletics or music conflicts)."
	],
	"enrolled": 16,
	"gereqs": [
		"FYS"
	],
	"groupid": "0000036173",
	"grouptype": "U",
	"instructors": [
		"Emily Mohl"
	],
	"learningmode": "S",
	"level": 100,
	"max": 18,
	"name": "Top: Who is Science For?",
	"notes": [
		"Section topic: Who is Science For? Inquiry to Action",
		"This course includes an academic civic engagement (ACE) component."
	],
	"number": 120,
	"offerings": [
		{
			"day": "Tu",
			"end": "14:45",
			"location": "RNS 204",
			"start": "13:20"
		},
		{
			"day": "Th",
			"end": "15:35",
			"location": "RNS 204",
			"start": "14:15"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2023-06-23T03:01:38.215880+00:00",
			"enrolled": 0
		},
		{
			"_updated": "2023-06-24T03:00:25.627025+00:00",
			"enrolled": 7
		},
		{
			"_updated": "2023-06-27T03:02:23.083225+00:00",
			"enrolled": 13
		},
		{
			"_updated": "2023-06-30T02:53:30.400122+00:00",
			"enrolled": 14
		},
		{
			"_updated": "2023-07-01T03:09:29.272720+00:00",
			"enrolled": 15
		}
	],
	"section": "U",
	"semester": 1,
	"status": "O",
	"term": 20231,
	"title": "First-Year Seminar",
	"type": "Topic",
	"year": 2023
}
