{
	"clbid": "0000145440",
	"credits": 1.0,
	"crsid": "0000036257",
	"department": "WRIT",
	"description": [
		"Evolutionary biologist Mark Pagel has called it \"the most powerful, dangerous and subversive trait that natural selection has ever devised.\" Language--spoken, signed, and written--may be our most important tool for influencing others and constructing ourselves. This seminar is designed for students interested in the phenomenon of human language: its mutability, its persuasive power, and its roles in social and cultural identities. Questions we may address include: what's in a name? why do we lie? what words convey apology? how does language matter in our campus community? Readings in non-fiction and drama support class discussions of those questions and also model different writing \"moves.\" During our study of language in drama, the class will also attend a production of the play we are studying. Students synthesize reading and viewing assignments, discussion, personal experience, and the results of their inquisitive research to write in several modes and genres. The writing process for these assignments integrates substantial time for workshops of drafts and students' reflections on their own rhetorical practices and development."
	],
	"enrolled": 19,
	"gereqs": [
		"WRR"
	],
	"groupid": "0000036257",
	"grouptype": "C",
	"instructors": [
		"Karen E. Marsalek"
	],
	"junior": "0/0",
	"learningmode": "S",
	"level": 100,
	"max": 19,
	"name": "Top: Language and Identity",
	"notes": [
		"Section topic: Language and Identity"
	],
	"number": 120,
	"offerings": [
		{
			"day": "Mo",
			"end": "11:40",
			"location": "OM 310",
			"start": "10:45"
		},
		{
			"day": "We",
			"end": "11:40",
			"location": "OM 310",
			"start": "10:45"
		},
		{
			"day": "Fr",
			"end": "11:40",
			"location": "OM 310",
			"start": "10:45"
		}
	],
	"pn": false,
	"prerequisites": false,
	"revisions": [
		{
			"_updated": "2025-10-11T21:36:43.462441+00:00",
			"gereqs": [
				"FYW",
				"WRR"
			]
		}
	],
	"section": "C",
	"semester": 3,
	"senior": "0/0",
	"status": "C",
	"term": 20223,
	"title": "Writing and Rhetoric",
	"type": "Topic",
	"year": 2022
}
