{
	"department": "ENVST",
	"description": [
		"<B>Topics for Interim 2012-13</B>",
		"",
		"<B>Environmental Studies 281A Top: What is Nature Worth? Economic and ethical",
		"perspectives on the value of ecosystems.",
		"(Social Science) - Bonnie Keeler</B>",
		"Ecosystems provide many benefits to people, including food, recreation, and the provision of",
		"clean air and water. However, quantifying these benefits using traditional economic tools can be",
		"challenging. Additionally, placing a monetary value on nature may lead to unintended",
		"consequences. This course will explore the promise and potential pitfalls of economic",
		"valuation of ecosystems goods and services. Specific topics will include non-market valuation",
		"techniques, decision theory and risk analysis, ethical and equity issues surrounding",
		"conservation, and historical perspectives on the environmental movement. Students will work",
		"individually and in groups to address a series of case studies in conservation and",
		"environmental decision-making. Class sessions will include a combination of lecture, group",
		"discussion, reading groups, and hands-on lab exercises using spatial models and decision",
		"analysis techniques.",
		"",
		"<B>Environmental Studies 281B Top: Winter Ecology",
		"(Natural Science) - Charles Umbanhower, Jr.</B>",
		"Winter is an incredibly important time of year for plants, animals, and ecosystems in the",
		"northern hemisphere. This course introduces the ecology of winter, and students learn about a",
		"range of related topics including freeze tolerance and avoidance in plants and animals, energy",
		"movement through snow and ice, and the impacts of freezing on soils and lakes. Students learn",
		"through lectures, readings, laboratory work, and short field trips, as well as somes mall group",
		"research projects. Prerequisite: Biology 125 and 126, or Chemistry/Biology 125-127 and Biology",
		"126, or ES 137."
	],
	"fullname": "Topics in Environmental Studies",
	"number": 281,
	"section": "B",
	"semester": 2,
	"shortname": "Top: Winter Ecology",
	"type": "T",
	"year": 2012
}
